Repository: IITDBGroup/perm
Catalog: src/interfaces/libpq/po/*.po
Languages: cs, sk, sl

source: could not read root certificate list (%s): %s
sk: nebolo mo¾né naèíta» koreòový zoznam certifikátov (%s): %s
