Repository: IITDBGroup/perm
Catalog: src/interfaces/libpq/po/*.po
Languages: cs, sk, sl

source: Kerberos 4 error: %s
cs: Kerberos 4 chyba: %s
sk: Chyba Kerberos 4: %s
sl: Kerberos 4 napaka: %s

source: could not set socket to blocking mode: %s
cs: nelze nastavit soket do blokujícího módu: %s
sk: Nebolo mo¾né nastavi» soket na blokovací re¾im: %s
sl: vtiènice ni bilo mogoèe preklopiti v blokirajoèi naèin: %s

source: Kerberos 5 authentication rejected: %*s
cs: Kerberos 5 autentizace odmítnuta: %*s
sk: Autentifikácia Kerberos 5 odmietnutá: %*s
sl: Kerberos 5 avtentikacija je bila zavrnjena: %*s

source: could not restore non-blocking mode on socket: %s
cs: nelze obnovit neblokující mód soketu: %s
sk: Nebolo mo¾né obnovi» neblokovací re¾im na sokete: %s
sl: vtiènice ni bilo mogoèe povrniti v neblokirajoèi naèin: %s

source: SCM_CRED authentication method not supported
cs: autentizace metoda SCM_CRED není podporována
sk: Autentifikaèná metóda SCM_CRED nie je podporovaná
sl: SCM_CRED naèin avtentikacije ni podprt

source: Kerberos 4 authentication failed
cs: Kerberos 4 autentizace selhala
sk: Autentifikácia Kerberos 4 bola neúspe¹ná
sl: Kerberos 4 avtentikacija ni bila uspe¹na

source: Kerberos 4 authentication not supported
cs: Kerberos 4 autentizace není podporována
sk: Autentifikácia Kerberos 4 nie je podporovaná
sl: Kerberos 4 avtentikacija ni podprta

source: Kerberos 5 authentication failed
cs: Kerberos 5 autentizace selhala
sk: Autentifikácia Kerberos 5 bola neú¹pe¹ná
sl: Kerberos 5 avtentikacija ni bila uspe¹na

source: Kerberos 5 authentication not supported
cs: Kerberos 5 autentizace není podporována
sk: Autentifikácia Kerberos 5 nie je podporovaná
sl: Kerberos 5 avtentikacija ni podprta

source: authentication method %u not supported
cs: autentizaèní metoda %u není podporována
sk: autentifikaèná metóda %u nie je podporovaná
sl: %u ni podprt naèin avtentikacije

source: invalid authentication service name "%s", ignored
cs: neplatné jméno autentizaèní slu¾by "%s", ignorováno
sk: neplatný názov autentifikaènej slu¾by "%s" ignorovaný
sl: neveljavno ime storitve za avtentikacijo "%s" je bilo ignorirano

source: fe_getauthname: invalid authentication system: %d
cs: fe_getauthname: neplatný autentizaèní systém: %d
sk: fe_getauthname: neplatný autentifikaèný systém: %d
sl: fe_getauthname: neveljaven avtentikacijski sistem: %d

source: invalid sslmode value: "%s"
cs: neplatná hodnota sslmode: "%s"
sk: neplatná hodnota sslmode: "%s"
sl: neznan SSL naèin: "%s"

source: sslmode value "%s" invalid when SSL support is not compiled in
cs: hodnota sslmode "%s" je neplatná pokud není zakompilována podpora SSL
sk: hodnota sslvalue "%s" neplatná, ak nie je podpora SSL zabudovaná do systému
sl: SSL naèin "%s" ni veljaven, kadar program ni bil preveden s SSL podporo

source: could not set socket to TCP no delay mode: %s
cs: nelze nastavit "no delay" mód TCP soketu: %s
sk: nebolo mo¾né nastavi» re¾im "no delay" (bez odkladu) TCP soketu: %s
sl: vtiènice ni bilo mogoèe preklopiti v TCP no delay naèin: %s

source: could not connect to server: %s Is the server running locally and accepting connections on Unix domain socket "%s"?
cs: nelze navázat spojení se serverem: %s Je spu¹tìn server lokálnì a akceptuje spojení pomocí Unix soketu "%s"?
sk: nebolo mo¾né nadviaza» spojenie so serverom: %s Je server spustený lokálne a akceptuje spojenia prostredníctvom soketu "%s" systému Unix ?
sl: s stre¾nikom se ni bilo mogoèe povezati: %s Ali je stre¾nik zagnan na lokalnem raèunalniku in sprejema povezave na Unix domenski vtiènici "%s"?

source: could not connect to server: %s Is the server running on host "%s" and accepting TCP/IP connections on port %s?
cs: nelze navázat spojení se serverem: %s Je server na "%s" spu¹tìn a akceptuje TCP/IP spojení na portu %s?
sk: nebolo mo¾né nadviaza» spojenie so serverom: %s Je server spustený na serveri "%s" a akceptuje spojenia TCP/IP na porte %s?
sl: s stre¾nikom se ni bilo mogoèe povezati: %s Ali je stre¾nik zagnan na gostitelju "%s" in sprejema TCP/IP povezave na vratih %s?

source: could not translate host name "%s" to address: %s
cs: nemohu pøelo¾it jméno hostitele "%s" na adresu: %s
sk: nebolo mo¾né previes» názov poèítaèa "%s" na adresu: %s
sl: imena gostitelja "%s" ni bilo mogoèe prevesti v naslov: %s

source: could not translate Unix-domain socket path "%s" to address: %s
cs: nemohu pøelo¾it cestu Unix-domain soketu "%s" na adresu: %s
sk: nebolo mo¾né previes» cestu soketu systému Unix "%s" na adresu: %s
sl: poti Unix domenske vtiènice "%s" ni bilo mogoèe prevesti v naslov: %s

source: invalid connection state, probably indicative of memory corruption
cs: neplatný stav spojení, pravdìpodobnì indikující poru¹ení pamìti
sk: neplatný stav spojenia, pravdepodobne nastalo poru¹enie pamäti
sl: neveljavno stanje povezave, kar najverjetneje nakazuje okvaro podatkov v pomnilniku

source: could not create socket: %s
cs: nelze vytvoøit soket: %s
sk: nebolo mo¾né vytvori» soket: %s
sl: vtiènice ni bilo mogoèe ustvariti: %s

source: could not set socket to non-blocking mode: %s
cs: nelze nastavit soket do neblokujícího módu: %s
sk: nebolo mo¾né prepnú» soket do neblokovacieho re¾imu: %s
sl: vtiènice ni bilo mogoèe preklopiti v neblokirajoèi naèin: %s

source: could not set socket to close-on-exec mode: %s
cs: nelze nastavit soket do close-on-exec módu: %s
sl: vtiènice ni bilo mogoèe preklopiti v close-on-exec naèin: %s

source: could not get socket error status: %s
cs: nelze obdr¾et chybový status soketu: %s
sk: nebolo mo¾né zisti» chybový stav soketu: %s
sl: stanja napake vtiènice ni bilo mogoèe izvedeti: %s

source: could not get client address from socket: %s
cs: nelze získat adresu klienta ze soketu: %s
sk: nebolo mo¾né získat adresu klienta zo soketu: %s
sl: od vtiènice ni bilo mogoèe izvedeti naslova odjemalca: %s

source: could not send SSL negotiation packet: %s
cs: nelze poslat SSL "negotiation paket": %s
sk: nebolo mo¾né posla» vyjednávací paket SSL (negotiation packet): %s
sl: SSL pogajalskega paketa ni bilo mogoèe poslati: %s

source: out of memory
cs: nedostatek pamìti
sk: nedostatok pamäti
sl: zmanjkalo je pomnilnika

source: could not send startup packet: %s
cs: nelze poslat poèáteèní paket: %s
sk: nebolo mo¾né posla» poèiatoèný paket: %s
sl: zagonskega paketa ni bilo mogoèe poslati: %s

source: could not receive server response to SSL negotiation packet: %s
cs: nelze obdr¾et odpovìï serveru na SSL "negotiation paket": %s
sk: nebolo mo¾né získa» odpoveï serveru na vyjednávací paket SSL (negotiation packet): %s
sl: stre¾nikovega odgovora na SSL pogajalski paket ni bilo mogoèe prejeti: %s

source: server does not support SSL, but SSL was required
cs: server nepodporuje SSL, leè SSL je vy¾adováno
sk: server nepodporuje SSL, av¹ak sa po¾aduje prítomnos» SSL
sl: stre¾nik ne vsebuje podpore za SSL, le-ta pa je bila zahtevana

source: received invalid response to SSL negotiation: %c
cs: pøijata neplatná odpovìï na SSL negotiation: %c
sk: bola prijatá neplatná odpoveï na vyjednávanie SSL: %c
sl: na SSL pogajanje je bil prejet neveljaven odgovor: %c

source: expected authentication request from server, but received %c
cs: oèekáván byl autentizaèní dotaz ze serveru, ale pøijat byl %c
sk: oèakával sa autentifikaèný dotaz zo serveru, bolo v¹ak prijaté %c
sl: namesto prièakovane pro¹nje za avtentikacijo, je od stre¾nika bil prejet %c

source: unexpected message from server during startup
cs: neoèekávaná zpráva ze serveru bìhem startu
sk: neoèakávaná správa zo serveru poèas spustenia
sl: med zagonom je od stre¾nika bilo prejeto neprièakovano sporoèilo

source: invalid connection state %c, probably indicative of memory corruption
cs: neplatný status spojení %c, pravdìpodobnì indikující poru¹ení pamìti
sk: neplatný stav spojenia %c, pravdepodobne do¹lo k poru¹eniu pamäti
sl: neveljavno stanje povezave %c, kar najverjetneje nakazuje okvaro podatkov v pomnilniku

source: missing "=" after "%s" in connection info string
cs: chybné "=" po "%s" v informaèním øetìzci spojení
sk: chýbajúce "=" po "%s" v informaènom re»azci spojenia
sl: v nizu s povezavnimi podatki manjka "=" za "%s"

source: unterminated quoted string in connection info string
cs: neukonèený øetìzec v uvozovkách v informaèním øetìzci spojení
sk: neukonèený re»azec v úvodzovkách v informaènom re»azci spojenia
sl: povezavni niz vsebuje nezakljuèen niz v narekovajih

source: invalid connection option "%s"
cs: neplatný parametr spojení "%s"
sk: neplatný parameter spojenia "%s"
sl: neveljavna povezavna mo¾nost "%s"

source: connection pointer is NULL
cs: pointer spojení je NULL
sk: smerník spojenia je NULL
sl: kazalec na povezavo je NULL

source: WARNING: Password file %s has world or group read access; permission should be u=rw (0600)
cs: UPOZORNÌNÍ: Soubor s hesly %s má pøístupová práva pro ètení pro skupinu nebo v¹echny u¾ivatele; práva by mìla být u=rw (0600)
sk: UPOZORNENIE: súbor s heslami %s má prístupové práva pre èítanie pre skupinu alebo v¹etkých pou¾ivateµov; práva by mali by» u=rw (0600)
sl: OPOZORILO: Datoteka z gesli %s ima nastavljena dovoljenja, ki omogoèajo branje njene vsebine drugim uporabnikom; nastavljena bi morala biti na u=rw (0600)

source: NOTICE
cs: POZNÁMKA
sk: POZNÁMKA
sl: OPOMBA

source: command string is a null pointer
cs: øetìzec pøíkazu je prázdný ukazatel
sk: re»azec príkazu je NULL
sl: ukazni niz je null pointer

source: statement name is a null pointer
cs: název výrazu je prázdný ukazatel
sk: názov príkazu je NULL
sl: ime izjave je null pointer

source: function requires at least protocol version 3.0
cs: funkce vy¾aduje protokol alespoò 3.0 a vy¹¹í
sk: funkcia vy¾aduje aspoò protokol verzie 3.0
sl: funkcija zahteva vsaj protokol verzije 3.0

source: no connection to the server
cs: není spojení se serverem
sk: neexistuje spojenie so serverom
sl: ni povezave s stre¾nikom

source: another command is already in progress
cs: zpracovává se ji¾ jiný pøíkaz
sk: spracováva sa u¾ iný príkaz
sl: trenutno ¾e poteka izvajanje drugega ukaza

source: unexpected asyncStatus: %d
cs: neoèekávaný asyncStatus: %d
sk: neoèakávaný asyncStatus: %d
sl: neprièakovan asyncStatus: %d

source: COPY terminated by new PQexec
cs: COPY bylo ukonèeno novým PQexec
sk: COPY bolo ukonèené novým PQexec
sl: COPY je bil prekinjen s strani novega PQexec klica

source: COPY IN state must be terminated first
cs: COPY IN status musí být nejdøíve ukonèen
sk: stav COPY IN sa musí najprv ukonèi»
sl: COPY IN stanje mora najprej biti zakljuèeno

source: COPY OUT state must be terminated first
cs: COPY OUT status musí být nejdøíve ukonèen
sk: stav COPY OUT sa musí najprv ukonèi»
sl: COPY OUT stanje mora najprej biti zakljuèeno

source: no COPY in progress
cs: COPY se neprovádí
sk: COPY sa nevykonáva
sl: trenutno se ne izvaja noben COPY ukaz

source: connection in wrong state
cs: spojení je ve ¹patném stavu
sk: spojenie je v nevhodnom stave
sl: povezava je v napaènem stanju

source: invalid ExecStatusType code
cs: neplatný ExecStatusType kód
sk: neplatný kód ExecStatusType
sl: neveljavna ExecStatusType koda

source: column number %d is out of range 0..%d
cs: èíslo sloupce %d je mimo rozsah 0..%d
sk: èíslo ståpca %d je mimo rozsah 0..%d
sl: ¹tevilo stolpca %d je izven obsega 0..%d

source: row number %d is out of range 0..%d
cs: èíslo øádky %d je mimo rozsah 0..%d
sk: èíslo riadku %d je mimo rozsah 0..%d
sl: ¹tevilo vrstice %d je izven obsega 0..%d

source: could not interpret result from server: %s
cs: nelze interpretovat výsledek ze serveru: %s
sk: nebolo mo¾né interpretova» výsledok zo serveru: %s
sl: rezultata s stre¾nika ni bilo mogoèe razumeti: %s

source: could not open file "%s": %s
cs: nelze otevøít soubor "%s": %s
sk: nebolo mo¾né otvori» súbor "%s": %s
sl: datoteke "%s" ni bilo mogoèe odpreti: %s

source: could not create large object for file "%s"
cs: nelze vytvoøit "large object" pro soubor "%s"
sk: nebolo mo¾né vytvori» veµký objekt pre súbor "%s"
sl: velikega objekta za datoteko "%s" ni bilo mogoèe ustvariti

source: could not open large object %u
cs: nelze otevøít "large object" %u
sk: nebolo mo¾né otvori» veµký objekt %u
sl: velikega objekta %u ni bilo mogoèe odpreti

source: error while reading file "%s"
cs: chyba bìhem ètení souboru "%s"
sk: chyba poèas èítania súboru "%s"
sl: napaka pri branju datoteke "%s"

source: error while writing to file "%s"
cs: chyba bìhem zápisu do souboru "%s"
sk: chyba poèas zápisu do súboru "%s"
sl: napaka pri zapisovanju datoteke "%s"

source: query to initialize large object functions did not return data
cs: dotaz inicializující "large object" funkce nevrátil data
sk: dotaz inicializujúci funkcie veµkých objektov nevrátil dáta
sl: poizvedba za inicializacijo funkcij za delo z velikimi objekti ni vrnila podatkov

source: cannot determine OID of function lo_open
cs: nelze urèit OID funkce lo_open
sk: nebolo mo¾né urèi» OID funkcie lo_open
sl: OID vrednosti za funkcijo lo_open ni mogoèe ugotoviti

source: cannot determine OID of function lo_close
cs: nelze urèit OID funkce lo_close
sk: nebolo mo¾né urèi» OID funkcie lo_close
sl: OID vrednosti za funkcijo lo_close ni mogoèe ugotoviti

source: cannot determine OID of function lo_creat
cs: nelze urèit OID funkce lo_create
sk: nebolo mo¾né urèi» OID funkcie lo_creat
sl: OID vrednosti za funkcijo lo_creat ni mogoèe ugotoviti

source: cannot determine OID of function lo_unlink
cs: nelze urèit OID funkce lo_unlink
sk: nebolo mo¾né urèi» OID funkcie lo_unlink
sl: OID vrednosti za funkcijo lo_unlink ni mogoèe ugotoviti

source: cannot determine OID of function lo_lseek
cs: nelze urèit OID funkce lo_lseek
sk: nebolo mo¾né urèi» OID funkcie lo_lseek
sl: OID vrednosti za funkcijo lo_lseek ni mogoèe ugotoviti

source: cannot determine OID of function lo_tell
cs: nelze urèit OID funkce lo_tell
sk: nebolo mo¾né urèi» OID funkcie lo_tell
sl: OID vrednosti za funkcijo lo_tell ni mogoèe ugotoviti

source: cannot determine OID of function loread
cs: nelze urèit OID funkce loread
sk: nebolo mo¾né urèi» OID funkcie loread
sl: OID vrednosti za funkcijo loread ni mogoèe ugotoviti

source: cannot determine OID of function lowrite
cs: nelze urèit OID funkce lowrite
sk: nebolo mo¾né urèi» OID funkcie lowrite
sl: OID vrednosti za funkcijo lowrite ni mogoèe ugotoviti

source: integer of size %lu not supported by pqGetInt
cs: pqGetInt nepodporuje integer velikosti %lu
sk: pqGetInt nepodporuje celé èísla (integer) veµkosti %lu
sl: integer velikosti %lu ni podprt s strani pqGetInt

source: integer of size %lu not supported by pqPutInt
cs: pqPutInt nepodporuje integer velikosti %lu
sk: pqPutInt nepodporuje celé èísla (integer) veµkosti %lu
sl: integer velikosti %lu ni podprt s strani pqPutInt

source: connection not open
cs: spojení není otevøeno
sk: spojenie nie je vytvorené
sl: povezava ni odprta

source: could not receive data from server: %s
cs: nelze pøijmout data ze serveru: %s
sk: nebolo mo¾né prija» dáta zo serveru: %s
sl: podatkov iz stre¾nika ni bilo mogoèe prejeti: %s

source: server closed the connection unexpectedly This probably means the server terminated abnormally before or while processing the request.
cs: server ukonèil neoèekávanì spojení Toto pravdìpodobnì znamená, ¾e byl ukonèen nestandardnì pøed nebo bìhem vykonávání po¾adavku.
sk: server neoèekávane ukonèil spojenie Pravdepodobne to znamená, ¾e bol ukonèený ne¹tandardným spôsobom pred alebo poèas spracovania po¾iadavky.
sl: stre¾nik je neprièakovano prekinil povezavo To najverjetneje pomeni, da je pri¹lo do nenadne prekinitve izvajanja stre¾nika, pred ali med obdelavo zahteve.

source: could not send data to server: %s
cs: nelze poslat data na server: %s
sk: nebolo mo¾né posla» dáta serveru: %s
sl: podatkov ni bilo mogoèe poslati na stre¾nik: %s

source: timeout expired
cs: èasový interval ubìhl
sk: èas vypr¹al
sl: èasovna omejitev se je iztekla

source: socket not open
cs: soket není otevøen
sk: soket nie je otvorený
sl: vtiènica ni odprta

source: select() failed: %s
cs: select() selhal: %s
sk: príkaz select() bol neúspe¹ný: %s
sl: select() ni uspel: %s

source: invalid setenv state %c, probably indicative of memory corruption
cs: neplatný status spojení %c, pravdìpodobnì indikující poru¹ení pamìti
sl: neveljavno setenv stanje %c, kar najverjetneje nakazuje okvaro podatkov v pomnilniku

source: invalid state %c, probably indicative of memory corruption
cs: neplatný status %c, pravdìpodobnì indikující poru¹ení pamìti
sl: neveljavno stanje %c, kar najverjetneje nakazuje okvaro podatkov v pomnilniku

source: message type 0x%02x arrived from server while idle
cs: zpráva typu 0x%02x pøi¹la ze serveru bìhem neèinnosti
sl: v èasu neaktivnosti je od stre¾nika prispelo sporoèilo tipa 0x%02x

source: unexpected character %c following empty query response ("I" message)
cs: neoèekávaný znak %c následuje prázdnou odezvu dotazu("I" zpráva)
sl: praznemu odgovoru na poizvedbo je sledil neprièakovani znak %c ("I" sporoèilo)

source: server sent data ("D" message) without prior row description ("T" message)
cs: server odeslal data ("D" zpráva) bez pøedcházejícího popisu øádky ("T" zpráva)
sl: stre¾nik je poslal podatke ("D" sporoèilo) brez predhodnega opisa vrstic ("T" sporoèilo)

source: server sent binary data ("B" message) without prior row description ("T" message)
cs: server odeslal binární data ("B" zpráva) bez pøedchozího popisu øádky ("T" zpráva)
sl: stre¾nik je poslal binarne podatke ("B" sporoèilo) brez predhodnega opisa vrstic ("T" sporoèilo)

source: unexpected response from server; first received character was "%c"
cs: neoèekávaná odpovìï serveru; pøedchozí znak byl "%c"
sl: stre¾nik je vrnil neprièakovan odgovor; prvi prejeti znak je bil "%c"

source: out of memory for query result
cs: nedostatek pamìti pro odpovìï dotazu
sl: zmanjkalo je pomnilnika za rezultat poizvedbe

source: lost synchronization with server, resetting connection
cs: ztráta synchronizace se serverem, resetuji spojení
sl: pri¹lo je do izgube sinhronizacije s stre¾nikom; obnavljam povezavo

source: protocol error: id=0x%x
cs: chyba protokolu: id=0x%x
sl: napaka protokola: id=0x%x

source: server sent data ("D" message) without prior row description ("T" message)
cs: server odeslal data ("D" zpráva) bez pøedchozího popisu øádky ("T" zpráva)
sl: stre¾nik je poslal podatke ("D" sporoèilo) brez predhodnega opisa vrstic ("T" sporoèilo)

source: message contents do not agree with length in message type "%c"
cs: obsah zprávy nesouhlasí s délkou v typu zprávy "%c"
sl: vsebina sporoèila se razlikuje od dol¾ine v sporoèilu tipa "%c"

source: lost synchronization with server: got message type "%c", length %d
cs: ztracena synchronizace se serverem: obdr¾ena zpráva typu "%c", délky %d
sl: pri¹lo je do izgube sinhronizacije s stre¾nikom: prejeto sporoèilo tipa "%c", dol¾ine %d

source: unexpected field count in "D" message
cs: neoèekávaný poèet polí v "D" zprávì
sl: neprièakovano ¹tevilo polj v sporoèilu tipa "D"

source: at character %s
cs: na znaku %s
sl: pri znaku %s

source: DETAIL: %s
sl: PODROBNOSTI: %s

source: HINT: %s
cs: DOPORUÈENÍ: %s
sl: NAMIG: %s

source: QUERY: %s
cs: DOTAZ: %s
sl: POIZVEDBA: %s

source: CONTEXT: %s
cs: KONTEXT: %s
sl: KONTEKST: %s

source: LOCATION:
cs: UMÍSTÌNÍ:
sl: LOKACIJA:

source: PQgetline: not doing text COPY OUT
sl: PQgetline: ne izvaja se tekstovni COPY OUT

source: could not establish SSL connection: %s
cs: nelze vytvoøit SSL spojení: %s
sk: nebolo mo¾né vytvori» spojenie SSL: %s
sl: SSL povezave ni bilo mogoèe vzpostaviti: %s

source: SSL SYSCALL error: %s
cs: SSL SYSCALL chyba: %s
sk: Chyba SSL SYSCALL: %s
sl: SSL SYSCALL napaka: %s

source: SSL SYSCALL error: EOF detected
cs: SSL SYSCALL chyba: detekován EOF
sk: Chyba SSL SYSCALL: bol zistený znak konca súboru (EOF)
sl: SSL SYSCALL napaka: zaznan je bil EOF

source: SSL error: %s
cs: SSL chyba: %s
sk: Chyba SSL: %s
sl: SSL napaka: %s

source: unrecognized SSL error code: %d
cs: neznámý chybový kód SSL: %d
sl: neznana koda SSL napake: %d

source: error querying socket: %s
cs: chyba dotazování soketu: %s
sk: chyba dotazovania soketu: %s
sl: napaka pri spra¹evanju vrat: %s

source: could not get information about host "%s": %s
cs: nelze obdr¾et informace o hostu "%s": %s
sl: podatkov o gostitelju "%s" ni bilo mogoèe dobiti: %s

source: unsupported protocol
cs: nepodporovaný protokol
sk: nepodporovaný protokol
sl: protokol ni podprt

source: server common name "%s" does not resolve to %ld.%ld.%ld.%ld
cs: jméno serveru "%s" nelze pøelo¾it na %ld.%ld.%ld.%ld
sk: Názov serveru "%s" nebolo mo¾né prelo¾i» na %ld.%ld.%ld.%ld
sl: obièajno ime stre¾nika "%s" se ne razre¹i kot naslov %ld.%ld.%ld.%ld

source: server common name "%s" does not resolve to peer address
cs: jméno serveru "%s" nelze pøelo¾it na peer adresu
sk: Názov serveru "%s" nebolo mo¾né prelo¾i» na peer adresu
sl: obièajnega imena stre¾nika "%s" ni mogoèe pretvoriti v naslov

source: could not get user information
cs: nelze obdr¾et informace o u¾ivateli
sk: nebolo mo¾né získa» informácie o pou¾ivateµovi
sl: podatkov o uporabniku ni bilo mogoèe pridobiti

source: could not open certificate file "%s": %s
cs: nelze otevøít soubor certifikátu "%s": %s
sl: certifikata "%s" ni bilo mogoèe odpreti: %s

source: could not read certificate file "%s": %s
cs: nelze èíst soubor certifikát "%s": %s
sl: certifikata "%s" ni bilo mogoèe prebrati: %s

source: certificate present, but not private key file "%s"
cs: certifikát je pøítomen, ale soubor privátního klíèe ne "%s"
sl: certifikat obstaja, zasebni kljuè "%s" pa ne

source: private key file "%s" has wrong permissions
cs: soubor privátního klíèe "%s" má ¹patné oprávnìní
sl: zasebni kljuè "%s" ima nastavljena napaèna dovoljenja

source: could not open private key file "%s": %s
cs: nelze otevøít soubor s privátním klíèem "%s": %s
sl: zasebnega kljuèa "%s" ni bilo mogoèe odpreti: %s

source: private key file "%s" changed during execution
cs: soubor privátního klíèe "%s" byl za chodu zmìnìn
sl: zasebni kljuè "%s" se je med izvajanjem spremenil

source: could not read private key file "%s": %s
cs: nelze èíst soubor privátního klíèe "%s": %s
sl: zasebnega kljuèa "%s" ni bilo mogoèe prebrati: %s

source: certificate does not match private key file "%s": %s
cs: certifikát nesouhlasí se souborem privátního klíèe "%s": %s
sl: certifikat se ne ujema z zasebnim kljuèem "%s": %s

source: could not create SSL context: %s
cs: nelze vytvoøit SSL kontext: %s
sk: nebolo mo¾né vytvori» kontext SSL: %s
sl: SSL konteksta ni bilo mogoèe ustvariti: %s

source: could not read root certificate file "%s": %s
cs: nelze èíst soubor s koøenovým certifikátem "%s": %s
sl: datoteke s korenskimi certifikati "%s" ni bilo mogoèe prebrati: %s

source: certificate could not be validated: %s
cs: certifikát není platný: %s
sk: nebolo mo¾né validova» certifikát: %s
sl: certifikata ni bilo mogoèe potrditi: %s

source: certificate could not be obtained: %s
cs: certifikát nelze obdr¾et: %s
sk: nebolo mo¾né získa» certifikát: %s
sl: certifikata ni bilo mogoèe dobiti: %s

source: unrecognized SSL error code
sk: Neznámy chybový kód SSL

source: could not get information about host (%s): %s
sk: nebolo mo¾né získa» informácie o poèítaèi (%s): %s

source: could not open certificate (%s): %s
sk: nebolo mo¾né otvori» certifikát (%s): %s

source: could not read certificate (%s): %s
sk: nebolo mo¾né naèíta» certifikát (%s): %s

source: certificate present, but not private key (%s)
sk: certifikát je prítomný, ale súkromný kµúè nie je(%s)

source: private key (%s) has wrong permissions
sk: súkromný kµúè (%s) má nesprávne nastavené prístupové právomoci

source: could not open private key file (%s): %s
sk: nebolo mo¾né otvori» súbor so súkromným kµúèom (%s): %s

source: private key (%s) changed during execution
sk: Súkromný kµúè (%s) bol zmenený poèas behu systému

source: could not read private key (%s): %s
sk: nebolo mo¾né naèita» súkromný kµúè (%s): %s

source: certificate/private key mismatch (%s): %s
sk: certifikát/súkromný kµúè sú rozdielne (%s): %s
