Repository: IITDBGroup/perm
Catalog: src/backend/po/*.po
Languages: sk

source: This includes operations such as VACUUM and CREATE INDEX.
sk: Sem patria operácie ako VACUUM a CREATE INDEX.

source: Sets the maximum stack depth, in kilobytes.
sk: Urèí maximálnu håbku zásobníka, v kilobajtoch.

source: Vacuum cost for a page found in the buffer cache.
sk: Náklady na vysávanie stránky, ktorá sa nachádza v cache buffra.

source: Vacuum cost for a page not found in the buffer cache.
sk: Náklady na vysávanie stránky, ktorá sa nenachádza v cache buffra.

source: Vacuum cost for a page dirtied by vacuum.
sk: Náklady na vysávanie stránky za¹pinenej vysávaním

source: Vacuum cost amount available before napping.
sk: Náklady vysávania dostupné pred uspaním.

source: Vacuum cost naptime in milliseconds.
sk: náklady doby uspania v milisekundách.

source: Sets the maximum number of simultaneously open files for each server process.
sk: Urèí maximálnu hodnotu súèasne otvorených súborov pre ka¾dý proces servera.

source: Sets the maximum allowed duration (in milliseconds) of any statement.
sk: Urèí maximálne mo¾né trvanie (v milisekundách) pre µubovoµný príkaz.

source: A value of 0 turns off the timeout.
sk: Hodnota 0 vypne sledovanie vypr¹ania èasu.

source: Sets the maximum number of tables and indexes for which free space is tracked.
sk: Nastaví maximálny poèet tabuliek a indexov, pre ktoré sa sleduje voµný priestor.

source: Sets the maximum number of disk pages for which free space is tracked.
sk: Urèuje maximálny poèet stránok disku, pre ktoré sa sleduje voµný priestor.

source: Sets the maximum number of locks per transaction.
sk: Urèí maximálny poèet uzamknutí pre transakciu.

source: The shared lock table is sized on the assumption that at most max_locks_per_transaction * max_connections distinct objects will need to be locked at any one time.
sk: Tabuµka zdieµaných zámkov má veµkos» urèenú podµa predpokladu, ¾e najviac max_locks_per_transaction * max_connections rôznych objektov bude potrebné uzamknú» v daný èas.

source: Sets the maximum time in seconds to complete client authentication.
sk: Urèuje maximálnu dobu v sekundách potrebnú pre overenie toto¾nosti klienta.

source: Sets the maximum distance in log segments between automatic WAL checkpoints.
sk: Urèuje maximálnu vzdialenos» v segmentoch logu medzi automatickými kontrolnými bodmi WAL.

source: Sets the maximum time in seconds between automatic WAL checkpoints.
sk: Urèuje maximálnu dobu v sekundách medzi automatickými kontrolnými bodmi WAL.

source: Logs if filling of checkpoint segments happens more frequently than this (in seconds).
sk: Loguje, ak naplnenie segmentov kontrolných bodov nastáva èastej¹ie ako je tento èasový interval (v sekundách)

source: Write a message to the server log if checkpoints caused by the filling of checkpoint segment files happens more frequently than this number of seconds. Zero turns off the warning.
sk: Zapí¹e správu do logu servera, ak vytvorenie kontrolného bodu spôsobené naplnením segmentových súborov kontrolných bodov nastáva èastej¹ie ako je tento èasový interval vyjadrený v sekundách. Nula spôsobí vypnutie tohto mechanizmu.

source: Sets the number of disk-page buffers in shared memory for WAL.
sk: Urèuje poèet buffrov diskových stránok v zdieµanej pamäti pre WAL.

source: Sets the delay in microseconds between transaction commit and flushing WAL to disk.
sk: Urèuje oneskorenie v mikrosekundách medzi ukonèením transakcie a výpisom WAL na disk.

source: Sets the minimum concurrent open transactions before performing commit_delay.
sk: Urèuje minimálny poèet súbe¾ných otvorených transakcií pred vykonaním commit_delay.

source: Sets the number of digits displayed for floating-point values.
sk: Urèuje poèet èíslic zobrazených pre hodnoty s pohyblivou rádovou èiarkou.

source: This affects real, double precision, and geometric data types. The parameter value is added to the standard number of digits (FLT_DIG or DBL_DIG as appropriate).
sk: Ovplyvòuje to údajové typy real, double precision a geometrické údajové typy. Hodnota parametra sa pridá k ¹tandardnému poètu èíslic (FLT_DIG, resp. DBL_DIG, podµa situácie).

source: Sets the minimum execution time in milliseconds above which statements will be logged.
sk: Urèuje minimálnu dobu vykonania v milisekundách, nad ktorou sa príkazy logujú.

source: Zero prints all queries. The default is -1 (turning this feature off).
sk: Nula vypí¹e v¹etky dotazy. Implicitná hodnota je -1 (t.j. vlastnos» vypnutá).

source: Interval to report shared buffer status in seconds
sk: Interval pre podávanie správ o stave zdieµaného buffra v sekundách

source: Background writer sleep time between rounds in milliseconds
sk: doba uspania zapisovaèa na pozadí v milisekundách medzi dvoma otáèkami

source: Background writer percentage of dirty buffers to flush per round
sk: percento za¹pinených buffrov zapisovaèa na pozadí, ktoré sa majú vypísa» za otáèku

source: Background writer maximum number of pages to flush per round
sk: maximálny poèet stránok zapisovaèa na pozadí, ktoré sa majú vypísa» za otáèku

source: Shows the maximum number of function arguments
sk: Zobrazí maximálny poèet argumentov funkcií

source: Shows the maximum number of index keys
sk: Zobrazí maximálny poèet kµúèov indexov

source: Shows the maximum identifier length
sk: Zobrazí maximálnu då¾ku identifikátora

source: Shows size of a disk block
sk: Zobrazí veµkos» bloku disku

source: Sets the planner's assumption about size of the disk cache.
sk: Urèuje plánovaèom prepokladanú hodnotu veµkosti cache disku.

source: That is, the portion of the kernel's disk cache that will be used for PostgreSQL data files. This is measured in disk pages, which are normally 8 kB each.
sk: Je to èas» diskovej cache jadra operaèného systému, ktoré sa pou¾ije pre dátové súbory PostgreSQL. Vyjadruje sa to v diskových stránkach, ktoré majú normálne po 8 kB

source: Sets the planner's estimate of the cost of a nonsequentially fetched disk page.
sk: Urèuje odhad plánovaèa pre náklady nesekvenène získanej diskovej stránky.

source: This is measured as a multiple of the cost of a sequential page fetch. A higher value makes it more likely a sequential scan will be used, a lower value makes it more likely an index scan will be used.
sk: Vyjadruje sa to ako násobok nákladov na získanie stránky sekvenène. Vy¹¹ia hodnota znamená, ¾e je pravdepodobnej¹ie, ¾e sa pou¾ije sekvenèné prehµadávanie, ni¾¹ia, ¾e sa pou¾ije indexové prehµadávanie.

source: Sets the planner's estimate of the cost of processing each tuple (row).
sk: Urèuje odhad plánovaèa pre náklady spracovania jednotlivých n-tíc (riadkov).

source: This is measured as a fraction of the cost of a sequential page fetch.
sk: Vyjadruje sa to ako èas» nákladov na sekvenèné získanie stránky.

source: Sets the planner's estimate of processing cost for each index tuple (row) during index scan.
sk: Urèuje odhad plánovaèa pre náklady na spracovanie ka¾dej n-tice (riadku) indexu poèas indexového prehµadávania.

source: Sets the planner's estimate of processing cost of each operator in WHERE.
sk: Nastaví odhad plánovaèa o nákladoch spracovania ka¾dého operátora v klauzule WHERE.

source: GEQO: selective pressure within the population.
sk: GEQO: selektívny tlak v rámci populácie.

source: Sets the seed for random-number generation.
sk: Iniciuje generátor náhodných èísel.

source: WAL archiving command.
sk: povel archivácie WAL.

source: The shell command that will be called to archive a WAL file.
sk: Povel príkazového riadku, ktorý sa pou¾ije pre archiváciu súboru WAL.

source: Sets the client's character set encoding.
sk: Nastaví kódovanie znakovej sady klienta.

source: Sets the message levels that are sent to the client.
sk: Nastaví úrovne výpisov, ktoré sa posielajú klientovi.

source: Valid values are DEBUG5, DEBUG4, DEBUG3, DEBUG2, DEBUG1, LOG, NOTICE, WARNING, and ERROR. Each level includes all the levels that follow it. The later the level, the fewer messages are sent.
sk: Platné hodnoty sú DEBUG5, DEBUG4, DEBUG3, DEBUG2, DEBUG1, INFO, NOTICE, WARNING, ERROR, LOG, FATAL a PANIC. Ka¾dá úroveò obsahuje za òou nasledujúce úrovne.Èím vy¹¹ia úroveò, tým menej správ sa posiela.

source: Sets the message levels that are logged.
sk: Urèuje úroveò výpisov pre log.

source: Valid values are DEBUG5, DEBUG4, DEBUG3, DEBUG2, DEBUG1, INFO, NOTICE, WARNING, ERROR, LOG, FATAL, and PANIC. Each level includes all the levels that follow it.
sk: Platné hodnoty sú DEBUG5, DEBUG4, DEBUG3, DEBUG2, DEBUG1, INFO, NOTICE, WARNING, ERROR, LOG, FATAL a PANIC. Ka¾dá úroveò obsahuje za òou nasledujúce úrovne.

source: Sets the verbosity of logged messages.
sk: Urèuje výreènos» logovaných výpisov.

source: Valid values are "terse", "default", and "verbose".
sk: Platné hodnoty sú "terse" (strohé), "default" (implicitné) a "verbose" (ob¹írne).

source: Sets the type of statements logged.
sk: Urèuje typ príkazov, ktoré sa zapisujú do logu.

source: Valid values are "none", "mod", "ddl", and "all".
sk: Platné hodnoty sú "none" (niè), "mod", "ddl" a "all" (v¹etko).

source: Causes all statements generating error at or above this level to be logged.
sk: Spôsobí, ¾e v¹etky príkazy, ktoré spôsobia chybu na tejto úrovni alebo na iných úrovniach budú zaznamenané do logu.

source: All SQL statements that cause an error of the specified level or a higher level are logged.
sk: V¹etky príkazy SQL, ktoré spôsobujú chybu na urèenej alebo vy¹¹ej úrovni sú zaznamenané.

source: Controls information prefixed to each log line
sk: Urèuje informácie, ktoré sa zapí¹u pred ka¾dý riadok logu.

source: if blank no prefix is used
sk: ak táto hodnota nie je zadaná, nepou¾ije sa ¾iadna predpona

source: Sets the display format for date and time values.
sk: Urèuje formát výpisu pre hodnoty dátumu a èasu.

source: Also controls interpretation of ambiguous date inputs.
sk: Tie¾ riadi interpretáciu nejasných vstupov dátumu.

source: Sets the transaction isolation level of each new transaction.
sk: Nastaví úroveò izolácie transakcie pre ka¾dú novú transakciu.

source: Each SQL transaction has an isolation level, which can be either "read uncommitted", "read committed", "repeatable read", or "serializable".
sk: Ka¾dá transakcia SQL má úroveò izolácie, ktorá mô¾e by» "read uncommited" (èítaj nepotvrdené), "read committed" (èítaj potvrdené), "repeatable read" (opakovateµné èítanie), alebo "serializable" (serializovateµné).

source: Sets the path for dynamically loadable modules.
sk: Nastaví cestu pre dynamicky naèítavané moduly.

source: If a dynamically loadable module needs to be opened and the specified name does not have a directory component (i.e., the name does not contain a slash), the system will search this path for the specified file.
sk: Ak má by» otvorený dynamicky naèítateµný modul a ¹pecifikovaný neobsahuje adresár (t.j. neobsahuje lomku) systém bude prehµadáva» túto cestu, aby na¹iel zadaný súbor.

source: Sets the location of the Kerberos server key file.
sk: Urèí umiestnenie súboru kµúèa servera Kerberos.

source: Sets the Rendezvous broadcast service name.
sk: Nastaví názov slu¾by vysielania rendez-vous.

source: Shows the collation order locale.
sk: Zobrazí lokálne nastavenia abecedného poradia.

source: Shows the character classification and case conversion locale.
sk: Zobrazí lokálne nastavenia pre klasifikáciu znakov a zmenu veµkosti.

source: Sets the language in which messages are displayed.
sk: Nastaví jazyk, v ktorom sa vypí¹u správy.

source: Sets the locale for formatting monetary amounts.
sk: Urèí lokálne nastavenia pre formát peòa¾ných hodnôt.

source: Sets the locale for formatting numbers.
sk: Urèí lokálne nastavenia pre formát èísel.

source: Sets the locale for formatting date and time values.
sk: Urèí lokálne nastavenia pre hodnoty dátumu a èasu.

source: Lists shared libraries to preload into server.
sk: Vypí¹e zoznam zdieµaných kni¾níc, ktoré sa predbe¾ne naèítajú do servera.

source: Sets the regular expression "flavor".
sk: nastaví ¹týl regulárnych výrazov.

source: This can be set to advanced, extended, or basic.
sk: Platné hodnoty sú advanced (pokroèilé), extended (roz¹írené) alebo basic (základné).

source: Sets the schema search order for names that are not schema-qualified.
sk: urèí poradie prehµadávania schém pre názvy, ktoré nemajú urèenú schému.

source: Sets the server (database) character set encoding.
sk: Nastaví kódovanie znakov servera (databázy)

source: Shows the server version.
sk: Zobrazí verziu servera.

source: Sets the session user name.
sk: Nastaví meno u¾ívateµa sedenia.

source: Sets the destination for server log output.
sk: Urèí cieµ výstupu logu servera.

source: Valid values are combinations of stderr, syslog and eventlog, depending on platform.
sk: Platné hodnoty sú kombinácie stderr, syslog a eventlog, v závislosti od platformy.

source: Sets the syslog "facility" to be used when syslog enabled.
sk: Urèuje, ¾e sa pou¾ije mechanizmus syslog, ak je jeho pou¾ívanie povolené.

source: Valid values are LOCAL0, LOCAL1, LOCAL2, LOCAL3, LOCAL4, LOCAL5, LOCAL6, LOCAL7.
sk: Platné hodnoty sú LOCAL0, LOCAL1, LOCAL2, LOCAL3, LOCAL4, LOCAL5, LOCAL6, LOCAL7.

source: Sets the program name used to identify PostgreSQL messages in syslog.
sk: Nastaví názov programu, ktorý sa pou¾íva pre identifikáciu správ PostgreSQL v systémovom logu syslog.

source: Sets the time zone for displaying and interpreting time stamps.
sk: Nastaví èasovú zónu pre zobrazenie a interpretáciu èasových známok.

source: Sets the current transaction's isolation level.
sk: Nastaví úroveò izolácie aktuálnej transakcie.

source: Sets the owning group of the Unix-domain socket.
sk: Nastaví skupinu vlastníka soketu unixových domén.

source: (The owning user of the socket is always the user that starts the server.)
sk: (majiteµ soketu je v¾dy u¾ívateµ, ktorý server spustil.)

source: Sets the directory where the Unix-domain socket will be created.
sk: Urèuje adresár, kde sa vytvorí soket unixovej domény.

source: Sets the host name or IP addresses to listen to.
sk: Nastaví názov poèítaèa alebo IP adresy, na ktorých sa má oèakáva» vstup.

source: Selects the method used for forcing WAL updates out to disk.
sk: Urèí metódu pre násilné aktualizácie WAL na disk.

source: Sets the list of known custom variable classes
sk: Nastaví zoznam známych u¾ívateµom definovaných tried premenných

source: Sets the location of the data directory
sk: Nastaví umiestnenie dátového adresára

source: Sets the location of the "hba" configuration file
sk: Nastaví umiestnenie konfiguraèného súboru "hba"

source: Sets the location of the "ident" configuration file
sk: Nastaví umiestnenie konfiguraèného súboru "ident"

source: Writes the postmaster PID to the specified file
sk: Zapí¹e PID programu postmaster o urèeného súboru

source: unrecognized configuration parameter "%s"
sk: nerozpoznaný konfiguraèný parameter "%s"

source: parameter "%s" cannot be changed
sk: parameter "%s" nie je mo¾né zmeni»

source: parameter "%s" cannot be changed after server start
sk: parameter "%s" nie je mo¾né zmeni» po spustení servera

source: parameter "%s" cannot be changed now
sk: parameter "%s" nie je mo¾né nastavi» teraz

source: parameter "%s" cannot be set after connection start
sk: parameter "%s" nie je mo¾né nastavi» po spustení spojenia

source: permission denied to set parameter "%s"
sk: prístup odmietnutý pre nastavenie parametra "%s"

source: parameter "%s" requires a Boolean value
sk: parameter "%s" vy¾aduje booleovskú hodnotu

source: must be superuser to change this value to false
sk: Musíte by» superu¾ívateµom, ak chcete zmeni» túto hodnotu na false.

source: invalid value for parameter "%s": %d
sk: neplatná hodnota parametra "%s": %d

source: parameter "%s" requires an integer value
sk: parameter "%s" si vy¾aduje celoèíselnú hodnotu

source: %d is outside the valid range for parameter "%s" (%d .. %d)
sk: %d je mimo platný rozsah hodnôt parametra "%s" (%d .. %d)

source: Must be superuser to increase this value or turn it off.
sk: Musíte by» superu¾ívateµom, ak chcete zmeni» alebo vynulova» túto hodnotu.

source: parameter "%s" requires a numeric value
sk: parameter "%s" si vy¾aduje numerickú (numeric) hodnotu

source: %g is outside the valid range for parameter "%s" (%g .. %g)
sk: %g je mimo platný rozsah hodnôt parametra "%s" (%g .. %g)

source: invalid value for parameter "%s": %g
sk: neplatná hodnota parametra "%s": %g

source: Must be superuser to increase this value.
sk: Pre zvý¹enie tejto hodnoty musíte by» superu¾ívateµom

source: invalid value for parameter "%s": "%s"
sk: neplatná hodnota parametra "%s": "%s"

source: SET %s takes only one argument
sk: povel SET %s má iba jeden argument

source: SET requires parameter name
sk: povel SET vy¾aduje zadanie názvu parametra

source: attempt to redefine parameter "%s"
sk: pokus o opätovnú definíciu parametra "%s"

source: could not parse setting for parameter "%s"
sk: nebolo mo¾né preèíta» nastavenie parametra "%s"

source: invalid list syntax for parameter "log_destination"
sk: Neplatná syntax pre parameter "log_destination"

source: unrecognised "log_destination" key word: "%s"
sk: nerozpoznané kµúèové slovo "log_destination": "%s"

source: SET AUTOCOMMIT TO OFF is no longer supported
sk: povel SET AUTOCOMMIT TO OFF u¾ nie je podporovaný

source: illegal syntax for custom_variable_classes "%s"
sk: neplatná syntax pre custom_variable_classes "%s"

source: cannot enable parameter when "log_statement_stats" is true.
sk: nie je mo¾né povoli» parameter ak "log_statement_stats" je kladné.

source: cannot enable "log_statement_stats" when "log_parser_stats", "log_planner_stats", or "log_executor_stats" is true.
sk: nie je mo¾né povoli» "log_statement_stats", ak "log_parser_stats", "log_planner_stats", alebo "log_executor_stats" sú kladné.

source: cannot set transaction read-write mode inside a read-only transaction
sk: vnútri subtransakcie urèenej len na èítanie nie je mo¾né nastavi» re¾im pre èítanie i zápis.

source: syntax error in file "%s" line %u, near token "%s"
sk: Syntaktická chyba v súbore "%s", riadok %u pri tokene "%s"

source: Failed while creating memory context "%s".
sk: Neúspe¹né vytvorenie kontextu pamäti "%s".

source: Failed on request of size %lu.
sk: Splnenie po¾iadavky veµkosti %lu bolo neúspe¹né.

source: cursor "%s" already exists
sk: kurzor "%s" u¾ existuje

source: closing existing cursor "%s"
sk: uzatvára sa existujúci kurzor "%s"

source: could not write block %ld of temporary file: %m
sk: nebolo mo¾né zapísa» blok %ld doèasného súboru: %m

source: Perhaps out of disk space?
sk: Pravdepodobne nastal nedostatok diskového priestoru.

source: could not read block %ld of temporary file: %m
sk: nebolo mo¾né èíta» blok %ld doèasného súboru: %m

source: could not create unique index
sk: nebolo mo¾né vytvori» jedineèný index

source: Table contains duplicated values.
sk: Tabuµka obsahuje duplikáty hodnôt.
