Repository: IITDBGroup/perm
Catalog: src/backend/po/*.po
Languages: sk

source: number of index columns (%d) exceeds limit (%d)
sk: poèet indexových ståpcov (%d) presahuje ohranièenie (%d)

source: index row requires %lu bytes, maximum size is %lu
sk: riadok indexu vy¾aduje %lu bajtov, maximálna veµkos» je %lu

source: number of columns (%d) exceeds limit (%d)
sk: poèet ståpcov (%d) presahuje ohranièenie (%d)

source: unsupported format code: %d
sk: nepodporovaný kód formátu: %d

source: column "%s" cannot be declared SETOF
sk: ståpec "%s" nemô¾e by» deklarovaný ako SETOF

source: number of aliases does not match number of columns
sk: poèet aliasov sa nezhoduje s poètom ståpcov

source: no column alias was provided
sk: nebol zadaný ¾iaden alias ståpca

source: could not determine row description for function returning record
sk: nebolo mo¾né urèi» popis riadku pre funkciu vracajúcu záznam

source: index row size %lu exceeds hash maximum %lu
sk: veµkos» riadku indexu %lu presahuje hash maximum %lu

source: hash indexes do not support whole-index scans
sk: hash indexy nepodporujú celoindexové prehµadávanie

source: out of overflow pages in hash index "%s"
sk: nedostatok stránok preteèenia v hash indexe "%s"

source: hash indexes cannot contain null keys
sk: hash indexy nemô¾u obsahova» nulové kµúèe

source: index "%s" is not a hash index
sk: index "%s" nie je hash index

source: index "%s" has wrong hash version
sk: index "%s" má nesprávnu hash verziu

source: Please REINDEX it.
sk: prosím vykonajte opätovnú indexáciu povelom REINDEX.

source: "%s" is an index
sk: "%s" je index

source: "%s" is a special relation
sk: %s je ¹peciálna relácia

source: "%s" is a composite type
sk: "%s" je zlo¾ený typ

source: row is too big: size %lu, maximum size %lu
sk: Riadok je príli¹ veµký: veµkos» %lu, maximálna veµkos» %lu

source: "%s" is not an index
sk: "%s" nie je index

source: duplicate key violates unique constraint "%s"
sk: Duplicitný kµúè poru¹uje obmedzenie jedineènosti "%s"

source: index row size %lu exceeds btree maximum, %lu
sk: veµkos» %lu riadku indexu prekraèuje maximum pre btree %lu

source: index "%s" is not a btree
sk: Index "%s" nie je btree

source: version mismatch in index "%s": file version %d, code version %d
sk: Nezlúèiteµné èíslo verzie pre index "%s": verzia súboru je %d, verzia kódu %d

source: variable-length rtree keys are not supported
sk: kµúèe rtree s premenlivou då¾kou nie sú podporované

source: index row size %lu exceeds rtree maximum, %lu
sk: veµkos» %lu riadku indexu prekraèuje maximum pre rtree %lu

source: cannot have more than 2^32-1 commands in a transaction
sk: nie je mo¾né ma» viac ako 2^32-1 povelov v jednej transakcii

source: %s cannot run inside a transaction block
sk: nie je mo¾né vykonáva» povel %s v bloku transakcií

source: %s cannot run inside a subtransaction
sk: nie je mo¾né vykonáva» povel %s v subtransakcii

source: %s cannot be executed from a function
sk: povel %s nie je mo¾né vykonáva» z funkcie

source: %s may only be used in transaction blocks
sk: povel %s je mo¾né vykonáva» iba v bloku transakcie

source: there is already a transaction in progress
sk: u¾ prebieha transakcia

source: there is no transaction in progress
sk: ¾iadna transakcia neprebieha

source: no such savepoint
sk: taký bod ulo¾enia neexistuje

source: file "%s" doesn't exist, reading as zeroes
sk: súbor "%s" neexistuje, naèítava sa ako nuly

source: could not access status of transaction %u
sk: nebolo mo¾né zisti» stav transakcie %u

source: could not open file "%s": %m
sk: nebolo mo¾né otvori» súbor "%s": %m

source: could not create file "%s": %m
sk: nebolo mo¾né vytvori» súbor "%s": %m

source: could not seek in file "%s" to offset %u: %m
sk: nebolo mo¾né posunú» èítanie v súbore "%s" do polohy %u: %m

source: could not read from file "%s" at offset %u: %m
sk: nebolo mo¾né èíta» zo súboru "%s" z pozície %u: %m

source: could not write to file "%s" at offset %u: %m
sk: nebolo mo¾né zapisova» do súboru "%s" na pozíciu %u: %m

source: could not fsync file "%s": %m
sk: nebolo mo¾né vykona» operáciu fsync na súbore "%s": %m

source: could not close file "%s": %m
sk: nebolo mo¾né zatvori» súbor "%s": %m

source: could not truncate directory "%s": apparent wraparound
sk: Nebolo mo¾né oreza» adresár "%s": zjavne do¹lo k preteèeniu

source: could not open directory "%s": %m
sk: nebolo mo¾né otvori» adresár "%s": %m

source: removing file "%s/%s"
sk: odstraòuje sa súbor "%s/%s"

source: could not read directory "%s": %m
sk: nebolo mo¾né èíta» z adresára "%s": %m

source: could not create archive status file "%s": %m
sk: nebolo mo¾né vytvori» súbor stavu archívu "%s": %m

source: could not write archive status file "%s": %m
sk: nebolo mo¾né zapisova» do súboru stavu archívu "%s": %m

source: could not close log file %u, segment %u: %m
sk: nebolo mo¾né uzavrie» log súbor %u, segment %u: %m

source: could not seek in log file %u, segment %u to offset %u: %m
sk: nebolo mo¾né presunú» pozíciu èítania v log súbore %u, segment %u na pozíciu %u: %m

source: could not write to log file %u, segment %u at offset %u: %m
sk: nebolo mo¾né zapisova» do log súboru %u, segment %u na pozíciu %u: %m

source: could not open file "%s" (log file %u, segment %u): %m
sk: nebolo mo¾né otvori» súbor "%s" (log súbor %u, segment %u): %m

source: could not write to file "%s": %m
sk: nebolo mo¾né zapisova» do súboru "%s": %m

source: could not read file "%s": %m
sk: nebolo mo¾né èíta» zo súboru "%s": %m

source: insufficient data in file "%s"
sk: nepostaèujúce dáta v súbore "%s"

source: could not link file "%s" to "%s" (initialization of log file %u, segment %u): %m
sk: nebolo mo¾né vytvori» odkaz z "%s" na súbor "%s" (inicializácia log súboru %u, segment %u): %m

source: could not rename file "%s" to "%s" (initialization of log file %u, segment %u): %m
sk: nebolo mo¾né premenova» súbor "%s" na "%s" (inicializácia log súboru %u, segment %u): %m

source: could not stat "%s": %m
sk: nebolo mo¾né pou¾i» povel stat pre "%s": %m

source: could not remove file "%s": %m
sk: nebolo mo¾né odstráni» súbor "%s": %m

source: archive file "%s" has wrong size: %lu instead of %lu
sk: súbor archívu "%s" má nesprávnu veµkos»: %lu namiesto %lu

source: restored log file "%s" from archive
sk: obnovený log súbor "%s" z archívu

source: could not restore "%s" from archive: return code %d
sk: nebolo mo¾né obnovi» log súbor "%s" z archívu: návratový kód %d

source: could not open transaction log directory "%s": %m
sk: nebolo mo¾né otvori» log adresár transakcií "%s": %m

source: recycled transaction log file "%s"
sk: bola vykonaná recyklácia log súboru transakcií "%s"

source: removing transaction log file "%s"
sk: odstraòuje sa log súbor transakcií "%s"

source: could not read transaction log directory "%s": %m
sk: nebolo mo¾né èíta» log adresár transakcií "%s": %m

source: incorrect resource manager data checksum in record at %X/%X
sk: nesprávny kontrolný súèet správcu zdrojov v riadku na pozícii %X/%X

source: incorrect checksum of backup block %d in record at %X/%X
sk: nesprávny kontrolný súèet zálo¾ného bloku %d v zázname na pozícii %X/%X

source: invalid record offset at %X/%X
sk: neplatný posun záznamu na pozícii %X/%X

source: could not read from log file %u, segment %u at offset %u: %m
sk: Nebolo mo¾né èíta» z log súboru %u, segment %u, posun %u: %m

source: contrecord is requested by %X/%X
sk: %X/%X po¾aduje contrecord

source: record with zero length at %X/%X
sk: záznam s nulovou då¾kou na pozícii %X/%X

source: record length %u at %X/%X too long
sk: då¾ka záznamu %u na pozícii %X/%X je príli¹ veµká

source: invalid resource manager ID %u at %X/%X
sk: neplatné id %u správcu zdrojov na pozícii %X/%X

source: could not read from log file %u, segment %u, offset %u: %m
sk: nebolo mo¾né èíta» log súbor %u, segment %u, posun %u: %m

source: there is no contrecord flag in log file %u, segment %u, offset %u
sk: neexistuje príznak contrecord v log súbore %u, segment %u, posun %u

source: invalid contrecord length %u in log file %u, segment %u, offset %u
sk: neplatná då¾ka contrecord %u v log súbore %u, segment %u, posun %u

source: invalid magic number %04X in log file %u, segment %u, offset %u
sk: neplatné magické èíslo %04X v log súbore %u, segment %u, posun %u

source: invalid info bits %04X in log file %u, segment %u, offset %u
sk: neplatné info bity %04X v log súbore %u, segment %u, posun %u

source: WAL file is from different system
sk: Súbor WAL pochádza z iného systému

source: WAL file SYSID is %s, pg_control SYSID is %s
sk: SYSID zo súboru WAL je %s, SYSID z pg_control je %s

source: Incorrect XLOG_SEG_SIZE in page header.
sk: Nesprávna veµkos» XLOG_SEG_SIZE v záhlaví súboru.

source: unexpected pageaddr %X/%X in log file %u, segment %u, offset %u
sk: neoèakávaná hodnota pageaddr %X/%X v log súbore %u, segment %u, posun %u

source: unexpected timeline ID %u in log file %u, segment %u, offset %u
sk: neoèakávaná hodnota ID èasovej postupnosti %u v log súbore %u, segment %u, posun %u

source: out-of-sequence timeline ID %u (after %u) in log file %u, segment %u, offset %u
sk: hodnota ID èasovej postupnosti %u (po %u) v log súbore %u, segment %u, posun %u je mimo postupnos»

source: could not open "%s": %m
sk: nebolo mo¾né otvori» "%s": %m

source: syntax error in history file: %s
sk: syntaktická chyba v súbore histórie: %s

source: Expected a numeric timeline ID.
sk: Oèakáva sa èíselná hodnota ID èasovej postupnosti.

source: invalid data in history file: %s
sk: neplatné dáta v súbore histórie: %s

source: Timeline IDs must be in increasing sequence.
sk: ID hodnoty èasovej postupnosti musia by» usporiadané v rastúcej postupnosti

source: invalid data in history file "%s"
sk: neplatné dáta v súbore histórie: "%s"

source: Timeline IDs must be less than child timeline's ID.
sk: ID èasovej postupnosti musí by» men¹ie ako ID èasovej postupnosti potomka.

source: could not link file "%s" to "%s": %m
sk: nebolo mo¾né vytvori» prepojenie súboru "%s" na "%s": %m

source: could not rename file "%s" to "%s": %m
sk: nebolo mo¾né premenova» súbor "%s" na "%s": %m

source: invalid LC_COLLATE setting
sk: neplatné nastavenie LC_COLLATE

source: invalid LC_CTYPE setting
sk: neplatné nastavenie LC_CTYPE

source: sizeof(ControlFileData) is larger than BLCKSZ; fix either one
sk: sizeof(ControlFileData) je väè¹í ako BLCKSZ; opravte jednu z hodnôt

source: could not create control file "%s": %m
sk: nebolo mo¾né vytvori» riadiaci súbor "%s": %m

source: could not write to control file: %m
sk: nebolo mo¾né zapisova» do riadiaceho súboru: %m

source: could not fsync control file: %m
sk: nebolo mo¾né aplikova» fsync na riadiaci súbor: %m

source: could not close control file: %m
sk: nebolo mo¾né zatvori» riadiaci súbor: %m

source: could not open control file "%s": %m
sk: nebolo mo¾né otvori» riadiaci súbor "%s": %m

source: could not read from control file: %m
sk: nebolo mo¾né èíta» z riadiaceho súboru: %m

source: database files are incompatible with server
sk: súbory databázy sú nekompatibilné so serverom

source: The database cluster was initialized with PG_CONTROL_VERSION %d, but the server was compiled with PG_CONTROL_VERSION %d.
sk: Zoskupenie databází bolo inicializované hodnotou PG_CONTROL_VERSION %d, av¹ak server bol kompilovaný s hodnotou PG_CONTROL_VERSION %d.

source: It looks like you need to initdb.
sk: Zdá sa, ¾e je potrebné spusti» initdb.

source: incorrect checksum in control file
sk: nesprávny kontrolný súèet v riadiacom súbore

source: The database cluster was initialized with CATALOG_VERSION_NO %d, but the server was compiled with CATALOG_VERSION_NO %d.
sk: Zoskupenie databází bolo inicializované s hodnotou CATALOG_VERSION_NO %d, av¹ak server bol kompilovaný s hodnotou CATALOG_VERSION_NO %d.

source: The database cluster was initialized with BLCKSZ %d, but the server was compiled with BLCKSZ %d.
sk: Zoskupenie databází bolo inicializované s hodnotou BLCKSZ %d, av¹ak ale server bol kompilovaný s BLCKSZ %d.

source: It looks like you need to recompile or initdb.
sk: Pravdepodobne potrebujete opätovne vykona» kompiláciu systému alebo spusti» initdb.

source: The database cluster was initialized with RELSEG_SIZE %d, but the server was compiled with RELSEG_SIZE %d.
sk: Zoskupenie databází bolo inicializované s hodnotou RELSEG_SIZE %d,av¹ak server bol kompilovaný s hodnotou RELSEG_SIZE %d.

source: The database cluster was initialized with XLOG_SEG_SIZE %d, but the server was compiled with XLOG_SEG_SIZE %d.
sk: Zoskupenie databází bolo inicializované s hodnotou XLOG_SEG_SIZE %d,av¹ak server bol kompilovaný s hodnotou XLOG_SEG_SIZE %d.

source: The database cluster was initialized with NAMEDATALEN %d, but the server was compiled with NAMEDATALEN %d.
sk: Zoskupenie databází bolo inicializované s hodnotou NAMEDATALEN %d,av¹ak server bol kompilovaný s hodnotou NAMEDATALEN %d.

source: The database cluster was initialized with FUNC_MAX_ARGS %d, but the server was compiled with FUNC_MAX_ARGS %d.
sk: Zoskupenie databází bolo inicializované s hodnotou FUNC_MAX_ARGS %d,av¹ak server bol kompilovaný s hodnotou FUNC_MAX_ARGS %d.

source: The database cluster was initialized without HAVE_INT64_TIMESTAMP but the server was compiled with HAVE_INT64_TIMESTAMP.
sk: Zoskupenie databází bolo inicializované bez prepínaèa HAVE_INT64_TIMESTAMP,av¹ak server bol kompilovaný s prepínaèom HAVE_INT64_TIMESTAMP.

source: The database cluster was initialized with HAVE_INT64_TIMESTAMP but the server was compiled without HAVE_INT64_TIMESTAMP.
sk: Zoskupenie databází bolo inicializované s prepínaèom HAVE_INT64_TIMESTAMP,av¹ak server bol kompilovaný bez prepínaèa HAVE_INT64_TIMESTAMP.

source: The database cluster was initialized with LOCALE_NAME_BUFLEN %d, but the server was compiled with LOCALE_NAME_BUFLEN %d.
sk: Zoskupenie databází bolo inicializované s hodnotou LOCALE_NAME_BUFLEN %d,av¹ak server bol kompilovaný s hodnotou LOCALE_NAME_BUFLEN %d.

source: database files are incompatible with operating system
sk: Súbory databázy nie sú kompatibilné s operaèným systémom

source: The database cluster was initialized with LC_COLLATE "%s", which is not recognized by setlocale().
sk: Zoskupenie databází bolo inicializované s hodnotou LC_COLLATE "%s", èo setlocale() nepozná.

source: It looks like you need to initdb or install locale support.
sk: Pravdepodobne potrebujete opätovne spusti» initdb alebo nain¹talova» podporu lokálneho prostredia.

source: The database cluster was initialized with LC_CTYPE "%s", which is not recognized by setlocale().
sk: Zoskupenie databází bolo inicializované s hodnotou LC_CTYPE "%s",èo setlocale() nepozná.

source: could not write bootstrap transaction log file: %m
sk: nebolo mo¾né zapisova» inicializaèný (bootstrap) log súbor transakcií: %m

source: could not fsync bootstrap transaction log file: %m
sk: nebolo mo¾né pou¾i» fsync na inicializaèný (bootstrap) log súbor transakcií: %m

source: could not close bootstrap transaction log file: %m
sk: nebolo mo¾né zatvori» inicializaèný (bootstrap) súbor logu transakcií: %m

source: could not open recovery command file "%s": %m
sk: nebolo mo¾né otvori» súbor povelu obnovy "%s": %m

source: starting archive recovery
sk: spú¹»am obnovu archívu

source: restore_command = "%s"
sk: restore_command (povel obnovy) = "%s"

source: recovery_target_timeline is not a valid number: "%s"
sk: recovery_target_timeline (èasová postupnos» cieµa obnovy) nie je platné èíslo: "%s"

source: recovery_target_timeline = %u
sk: recovery_target_timeline (èasová postupnos» cieµa obnovy) = %u

source: recovery_target_timeline = latest
sk: recovery_target_timeline (èasová postupnos» cieµa obnovy) = latest (posledné)

source: recovery_target_xid is not a valid number: "%s"
sk: recovery_target_xid (xid cieµa obnovy) nie je platné èíslo: "%s"

source: recovery_target_xid = %u
sk: recovery_target_xid (xid cieµa obnovy) = %u

source: recovery_target_time = %s
sk: recovery_target_time (èas cieµa obnovy) = %s

source: unrecognized recovery parameter "%s"
sk: neznámy parameter obnovy "%s"

source: syntax error in recovery command file: %s
sk: syntaktická chyba v súbore povelu obnovy: %s

source: Lines should have the format parameter = 'value'.
sk: Riadky majú by» v tvare parameter = 'hodnota'.

source: recovery command file "%s" did not specify restore_command
sk: súbor povelu obnovy "%s" neurèil hodnotu restore_command (povel obnovy)

source: recovery_target_timeline %u does not exist
sk: hodnota recovery_target_timeline (èasová postupnos» cieµa obnovy) %u neexistuje

source: archive recovery complete
sk: obnova archívu ukonèená

source: recovery stopping after commit of transaction %u, time %s
sk: obnova zastavená po ukonèení transakcie %u, èas %s

source: recovery stopping before commit of transaction %u, time %s
sk: obnova zastavená pred ukonèením transakcie %u, èas %s

source: recovery stopping after abort of transaction %u, time %s
sk: obnova zastavená po zru¹ení transakcie %u, èas %s

source: recovery stopping before abort of transaction %u, time %s
sk: obnova zastavená pred zru¹ením transakcie %u, èas %s

source: control file contains invalid data
sk: riadiaci súbor obsahuje neplatné údaje

source: database system was shut down at %s
sk: databázový systém bol vypnutý v èase %s

source: database system shutdown was interrupted at %s
sk: vypínanie databázového systému bolo preru¹ené v èase %s

source: database system was interrupted while in recovery at %s
sk: databázový systém bol preru¹ený poèas zotavenia v èase %s

source: This probably means that some data is corrupted and you will have to use the last backup for recovery.
sk: To pravdepodobne znamená, ¾e niektoré bloky dát sú po¹kodené a bude potrebné pou¾i» poslednú zálohu pre obnovu dát.

source: database system was interrupted at %s
sk: databázový systém bol preru¹ený v èase %s

source: requested timeline %u is not a child of database system timeline %u
sk: po¾adovaná èasová postupnos» %u nie je potomkom èasovej postupnosti %u databázy

source: checkpoint record is at %X/%X
sk: záznam kontrolného bodu je %X/%X

source: could not locate required checkpoint record
sk: nebolo mo¾né lokalizova» po¾adovaný záznam kontrolného bodu

source: If you are not restoring from a backup, try removing $PGDATA/backup_label.
sk: Ak nerobíte obnovu zo zálohy, skúste odstráni» $PGDATA/backup_label.

source: using previous checkpoint record at %X/%X
sk: pou¾íva sa predchádzajúci záznam kontrolného bodu na %X/%X

source: could not locate a valid checkpoint record
sk: nebolo mo¾né lokalizova» platný záznam kontrolného bodu

source: redo record is at %X/%X; undo record is at %X/%X; shutdown %s
sk: záznam opakovania (redo) je na %X/%X; záznam obnovy (undo) je na %X/%X; ukonèenie %s

source: next transaction ID: %u; next OID: %u
sk: ID nasledujúcej transakcie: %u; ïal¹ie OID: %u

source: invalid next transaction ID
sk: neplatné ID nasledujúcej transakcie

source: invalid redo in checkpoint record
sk: neplatné redo (opakovanie) v zázname kontrolného bodu

source: invalid redo/undo record in shutdown checkpoint
sk: neplatný záznam opakovania/obnovy (redo/undo) v kontrolnom bode vypnutia

source: automatic recovery in progress
sk: prebieha automatické zotavenie

source: database system was not properly shut down; automatic recovery in progress
sk: databázový systém nebol správne vypnutý; prebieha automatické zotavenie

source: redo starts at %X/%X
sk: opakovanie (redo) zaèína na %X/%X

source: redo done at %X/%X
sk: opakovanie (redo) vykonané na %X/%X

source: redo is not required
sk: opakovanie (redo) nie je potrebné

source: requested recovery stop point is before end time of backup dump
sk: po¾adovaný bod zastavenia obnovy je pred èasom ukonèenia exportu pre vytvorenie zálohy

source: WAL ends before end time of backup dump
sk: WAL konèí pred èasom ukonèenia exportu pre vytvorenie zálohy

source: selected new timeline ID: %u
sk: zvolená nová hodnota èasovej postupnosti ID: %u

source: undo starts at %X/%X
sk: obnovenie (undo) zaèína na %X/%X

source: undo done at %X/%X
sk: opakovanie (undo) konèí na %X/%X

source: undo is not required
sk: undo (obnova) nie je potrebné

source: database system is ready
sk: databázový systém je pripravený

source: invalid primary checkpoint link in control file
sk: neplatný primárny odkaz kontrolného bodu v riadiacom súbore

source: invalid secondary checkpoint link in control file
sk: neplatný sekundárny odkaz kontrolného bodu v riadiacom súbore

source: invalid checkpoint link in backup_label file
sk: neplatný odkaz kontrolného bodu v súbore backup_label (návestie zálohy)

source: invalid primary checkpoint record
sk: neplatný primárny záznam kontrolného bodu

source: invalid secondary checkpoint record
sk: neplatný sekundárny záznam kontrolného bodu

source: invalid checkpoint record
sk: neplatný záznam kontrolného bodu

source: invalid resource manager ID in primary checkpoint record
sk: neplatné ID správcu zdrojov v primárnom zázname kontrolného bodu

source: invalid resource manager ID in secondary checkpoint record
sk: neplatné ID správcu zdrojov v sekundárnom zázname kontrolného bodu

source: invalid resource manager ID in checkpoint record
sk: neplatné ID správcu zdrojov v zázname kontrolného bodu

source: invalid xl_info in primary checkpoint record
sk: neplatné xl_info v primárnom zázname kontrolného bodu

source: invalid xl_info in secondary checkpoint record
sk: neplatné xl_info v primárnom sekundárnom kontrolného bodu

source: invalid xl_info in checkpoint record
sk: neplatné xl_info v zázname kontrolného bodu

source: invalid length of primary checkpoint record
sk: neplatná då¾ka primárneho záznamu kontrolného bodu

source: invalid length of secondary checkpoint record
sk: neplatná då¾ka sekundárneho záznamu kontrolného bodu

source: invalid length of checkpoint record
sk: neplatná då¾ka záznamu kontrolného bodu

source: shutting down
sk: prebieha vypínanie

source: database system is shut down
sk: databázový systém je vypnutý

source: concurrent transaction log activity while database system is shutting down
sk: bola zistená aktivita logu súbe¾ných transakcií poèas vypínania databázového systému

source: unexpected timeline ID %u (after %u) in checkpoint record
sk: neoèakávaná hodnota ID èasovej postupnosti %u (po %u) v zázname kontrolného bodu

source: unexpected timeline ID %u (should be %u) in checkpoint record
sk: neoèakávaná hodnota ID èasovej postupnosti %u (má by» %u) v zázname kontrolného bodu

source: could not fsync log file %u, segment %u: %m
sk: nebolo mo¾né vykona» operáciu fsync na log súbore %u, segment %u: %m

source: could not fdatasync log file %u, segment %u: %m
sk: nebolo mo¾né vykona» operáciu fdatasync na log súbore %u, segment %u: %m

source: must be superuser to run a backup
sk: pre spustenie obnovy zo zálohy musíte by» superu¾ívateµom

source: a backup is already in progress
sk: u¾ prebieha obnova zo zálohy

source: If you're sure there is no backup in progress, remove file "%s" and try again.
sk: Ak ste si istý, ¾e neprebieha ¾iadne obnovenie zo zálohy, odstráòte súbor "%s" a skúste znova.

source: could not write file "%s": %m
sk: nebolo mo¾né zapisova» do súboru "%s": %m

source: a backup is not in progress
sk: ¾iadna obnova zo zálohy neprebieha

source: invalid data in file "%s"
sk: neplatné údaje v súbore "%s"

source: --%s requires a value
sk: --%s vy¾aduje hodnotu

source: -c %s requires a value
sk: -c %s vy¾aduje hodnotu

source: %s does not know where to find the database system data. You must specify the directory that contains the database system either by specifying the -D invocation option or by setting the PGDATA environment variable.
sk: %s nedoká¾e urèi», kde hµada» systémové údaje databázy. Musíte zada» adresár, ktorý obsahuje databázový systém a to buï pou¾itím voµby -D pri spustení alebo nastavením premennej prostredia PGDATA.
