Repository: IITDBGroup/perm
Catalog: src/backend/po/*.po
Languages: sk

source: SSL on
sk: SSL zapnuté

source: SSL off
sk: SSL vypnuté

source: no pg_hba.conf entry for host "%s", user "%s", database "%s"
sk: ®iaden záznam v pg_hba.conf pre poèítaè "%s", u¾ívateµa "%s" a databázu "%s"

source: Kerberos 4 only supports IPv4 connections
sk: Kerberos 4 podporuje iba IPv4 spojenia

source: could not enable credential reception: %m
sk: nebolo mo¾né povoli» prijatie potvrdenia dôveryhodnosti: %m

source: error from underlying PAM layer: %s
sk: chyba od podlo¾enej vrstvy PAM: %s

source: unsupported PAM conversation %d/%s
sk: neznáma konverzácia PAM: %d/%s

source: empty password returned by client
sk: klient vrátil prázdne heslo

source: could not create PAM authenticator: %s
sk: nebolo mo¾né vytvori» autentifikátor PAM: %s

source: pam_set_item(PAM_USER) failed: %s
sk: pam_set_item(PAM_USER) neúspe¹né: %s

source: pam_set_item(PAM_CONV) failed: %s
sk: pam_set_item(PAM_CONV) neúspe¹né: %s

source: pam_authenticate failed: %s
sk: pam_authenticate neúspe¹né: %s

source: pam_acct_mgmt failed: %s
sk: pam_acct_mgmt neúspe¹né: %s

source: could not release PAM authenticator: %s
sk: nebolo mo¾né uvoµni» autentifikátor PAM: %s

source: expected password response, got message type %d
sk: oèakávaná odpoveï bola heslo, získaná v¹ak správa typu %d

source: invalid password packet size
sk: neplatná veµkos» paketu hesla

source: received password packet
sk: získaný paket s heslom

source: SSL SYSCALL error: %m
sk: chyba SSL SYSCALL: %m

source: SSL SYSCALL error: EOF detected
sk: Chyba SSL SYSCALL: bol zistený znak konca súboru (EOF)

source: SSL error: %s
sk: Chyba SSL: %s

source: unrecognized SSL error code %d
sk: Neznámy kód chyby SSL %d

source: SSL renegotiation failure
sk: Chyba obnovenia spojenia SSL

source: SSL failed to send renegotiation request
sk: nebolo mo¾né odosla» ¾iados» o obnovenie spojenia SSL

source: could not create SSL context: %s
sk: nebolo mo¾né vytvori» kontext SSL: %s

source: could not load server certificate file "%s": %s
sk: nebolo mo¾né naèíta» súbor certifikátu servera "%s": %s

source: could not access private key file "%s": %m
sk: nebolo mo¾né pristúpi» k súboru súkromného kµúèa "%s": %m

source: unsafe permissions on private key file "%s"
sk: nastavenie prístupových práv k súboru súkromného kµúèa "%s" nie je bezpeèné

source: File must be owned by the database user and must have no permissions for "group" or "other".
sk: Súbor musí by» vlastnený u¾ívateµom databázy a nesmie ma» nastavené prístupové práva pre skupinu (group) alebo ostatných u¾ívateµov (other).

source: could not load private key file "%s": %s
sk: nebolo mo¾né naèíta» súbor súkromného kµúèa "%s": %s

source: check of private key failed: %s
sk: kontrola súkromného kµúèa neúspe¹ná: %s

source: could not load root certificate file "%s": %s
sk: nebolo mo¾né naèíta» súbor koreòového certifikátu "%s": %s

source: Will not verify client certificates.
sk: Klientské certifikáty nebudú preverené.

source: could not initialize SSL connection: %s
sk: nebolo mo¾né inicializova» spojenie SSL: %s

source: SSL connection from "%s"
sk: SSL spojenie s "%s"

source: cannot use authentication method "crypt" because password is MD5-encrypted
sk: nie je mo¾né pou¾i» metódu overenia toto¾nosti "crypt" lebo heslo je ¹ifrované pomocou MD5

source: authentication file token too long, skipping: "%s"
sk: token súboru overenia toto¾nosti príli¹ dlhý, neuva¾uje sa: "%s"

source: could not open secondary authentication file "@%s" as "%s": %m
sk: nebolo mo¾né druhotný súbor overenia toto¾nosti "@%s" ako "%s": %m

source: invalid IP address "%s" in pg_hba.conf file line %d: %s
sk: neplatná IP adresa "%s" v súbore pg_hba.conf, riadok %d: %s

source: invalid IP mask "%s" in pg_hba.conf file line %d: %s
sk: neplatná IP maska "%s" v súbore pg_hba.conf, riadok %d: %s

source: IP address and mask do not match in pg_hba.conf file line %d
sk: IP adresa a maska sa nezhodujú v súbore pg_hba.conf, riadok %d

source: invalid entry in pg_hba.conf file at line %d, token "%s"
sk: neplatný záznam v súbore pg_hba.conf, riadok %d, polo¾ka "%s"

source: missing field in pg_hba.conf file at end of line %d
sk: chýbajúca polo¾ka v súbore pg_hba.conf na konci riadku %d

source: could not open configuration file "%s": %m
sk: nebolo mo¾né otvori» súbor konfigurácie "%s": %m

source: invalid entry in pg_ident.conf file at line %d, token "%s"
sk: neplatný záznam v súbore pg_ident.conf, riadok %d, polo¾ka "%s"

source: missing entry in pg_ident.conf file at end of line %d
sk: chýbajúca polo¾ka v súbore pg_ident.conf, na konci riadku %d

source: cannot use Ident authentication without usermap field
sk: nie je mo¾né pou¾i» overenie toto¾nosti metódou Ident bez zadania poµa usermap

source: could not open Ident usermap file "%s": %m
sk: nebolo mo¾né otvori» súbor usermap metódy Ident "%s": %m

source: could not create socket for Ident connection: %m
sk: nebolo mo¾né vytvori» soket pre spojenie Ident: %m

source: could not bind to local address "%s": %m
sk: nebolo mo¾né vytvori» väzbu na lokálnu adresu "%s": %m

source: could not connect to Ident server at address "%s", port %s: %m
sk: nebolo mo¾né pripoji» sa na server Ident na adrese "%s", port %s: %m

source: could not send query to Ident server at address "%s", port %s: %m
sk: nebolo mo¾né odosla» dotaz na server Ident na adrese "%s", port %s: %m

source: could not receive response from Ident server at address "%s", port %s: %m
sk: nebolo mo¾né prija» odpoveï od servera Ident na adrese "%s", port %s: %m

source: invalidly formatted response from Ident server: "%s"
sk: nesprávne formátovaná odpoveï od servera Ident "%s"

source: could not get peer credentials: %m
sk: nebolo mo¾né získa» záznamy dôveryhodnosti od okolitých poèítaèov (peer credentials): %m

source: local user with ID %d does not exist
sk: miestny u¾ívateµ s ID %d neexistuje

source: Ident authentication is not supported on local connections on this platform
sk: Overenie toto¾nosti metódou Ident sa nepodporuje na miestnych spojeniach na tejto platforme

source: IDENT code identifies remote user as "%s"
sk: kód IDENT indentifikuje vzdialeného u¾ívateµa ako "%s"

source: could not translate host name "%s", service "%s" to address: %s
sk: nie je mo¾né prelo¾i» názov poèítaèa "%s", slu¾ba "%s" na adresu: %s

source: could not translate service "%s" to address: %s
sk: nie je mo¾né prelo¾i» slu¾bu "%s" na adresu: %s

source: unrecognized address family %d
sk: neznáma rodina adries %d

source: could not create %s socket: %m
sk: nebolo mo¾né vytvori» soket typu %s: %m

source: setsockopt(SO_REUSEADDR) failed: %m
sk: setsockopt(SO_REUSEADDR) neúspe¹né: %m

source: setsockopt(IPV6_V6ONLY) failed: %m
sk: setsockopt(IPV6_V6ONLY) neúspe¹né: %m

source: could not bind %s socket: %m
sk: nebolo mo¾né vytvori» väzbu %s na soket: %m

source: Is another postmaster already running on port %d? If not, remove socket file "%s" and retry.
sk: Be¾í u¾ iný postmaster na porte %d? Ak nie, odstráòte súbor soketu "%s" a skúste to e¹te raz.

source: Is another postmaster already running on port %d? If not, wait a few seconds and retry.
sk: Be¾í u¾ iný postmaster na porte %d? Ak nie, poèkajte niekoµko sekúnd a skúste to e¹te raz.

source: could not listen on %s socket: %m
sk: nebolo mo¾né prijíma» dáta zo soketu typu %s: %m

source: could not set group of file "%s": %m
sk: nebolo mo¾né nastavi» skupinu súboru "%s": %m

source: could not set permissions of file "%s": %m
sk: nebolo mo¾né nastavi» prístupové právomoci súboru "%s": %m

source: could not accept new connection: %m
sk: nebolo mo¾né akceptova» nové spojenie: %m

source: could not receive data from client: %m
sk: nebolo mo¾né prija» dáta od klienta: %m

source: unexpected EOF within message length word
sk: neoèakávaný znak konca súboru (EOF) v slove då¾ky správy

source: invalid message length
sk: neplatná då¾ka správy

source: incomplete message from client
sk: neúplná správa od klienta

source: could not send data to client: %m
sk: nebolo mo¾né odosla» dáta klientovi: %m

source: no data left in message
sk: ¾iadne dáta v správe

source: insufficient data left in message
sk: nepostaèujúce dáta v správe

source: invalid string in message
sk: neplatný re»azec v správe

source: invalid message format
sk: neplatný formát re»azca

source: %s: setsysinfo failed: %s
sk: %s: povel setsysinfo zlyhal: %s

source: %s: WSAStartup failed: %d
sk: %s: povel WSAStartup zlyhal: %d

source: "root" execution of the PostgreSQL server is not permitted. The server must be started under an unprivileged user ID to prevent possible system security compromise. See the documentation for more information on how to properly start the server.
sk: Spustenie servera PostgreSQL u¾ívateµom "root" nie je povolené. Server musí by» spustený neprivilegovaným u¾ívateµom, aby sa predi¹lo mo¾nému oslabeniu systémovej bezpeènosti. Pre detailné informácie o riadnom spustení servera pozri dokumentáciu.

source: %s: real and effective user IDs must match
sk: %s: skutoèné a efektívne ID u¾ívateµov sa musia zhodova»

source: execution of PostgreSQL by a user with administrative permissions is not permitted. The server must be started under an unprivileged user ID to prevent possible system security compromise. See the documentation for more information on how to properly start the server.
sk: Spustenie servera PostgreSQL u¾ívateµom s administratívnymi právomocami nie je povolené. Server musí by» spustený neprivilegovaným u¾ívateµom, aby sa predi¹lo mo¾nému oslabeniu systémovej bezpeènosti. Pre detailné informácie o riadnom spustení servera pozri dokumentáciu.

source: %s: invalid effective UID: %d
sk: %s: neplatné efektívne UID: %d

source: %s: could not determine user name (GetUserName failed)
sk: %s: nebolo mo¾né urèi» meno u¾ívateµa (povel GetUserName zlyhal)

source: no value found for parameter "%s"
sk: nena¹la sa hodnota pre parameter "%s"

source: no value found for parameter %d
sk: nena¹la sa hodnota pre parameter %d

source: SELECT FOR UPDATE is not supported for inheritance queries
sk: povel SELECT FOR UPDATE nie je mo¾né pou¾i» v dotazoch dediènosti

source: UNION JOIN is not implemented
sk: povel UNION JOIN nie je implementovaný

source: SELECT FOR UPDATE cannot be applied to the nullable side of an outer join
sk: povel SELECT FOR UPDATE nie je mo¾né aplikova» na nullovateµnú stranu vonkaj¹ieho spojenia

source: could not identify an equality operator for types %s and %s
sk: nebolo mo¾né identifikova» operátor rovnosti pre typy %s a %s

source: equality operator for types %s and %s should be merge-joinable, but isn't
sk: operátor rovnosti pre typy %s a %s by mal by» spojiteµný zlúèením, av¹ak nie je

source: SELECT FOR UPDATE is not allowed with UNION/INTERSECT/EXCEPT
sk: povel SELECT FOR UPDATE nie je mo¾né pou¾i» s klauzulami UNION/INTERSECT/EXCEPT

source: SELECT FOR UPDATE is not allowed in subqueries
sk: povel SELECT FOR UPDATE nie je povolené pou¾íva» v subdotazoch

source: SQL function "%s" during inlining
sk: funkcia SQL "%s" poèas vkladania na miesto volania (inlining)

source: JOIN/ON clause refers to "%s", which is not part of JOIN
sk: klauzula JOIN/ON odkazuje na "%s", èo nie je súèas» operácie spojenia

source: subquery in FROM must have an alias
sk: poddotaz v klauzule FROM musí ma» alias

source: subquery in FROM may not have SELECT INTO
sk: poddotaz v klauzule FROM nemô¾e ma» klauzulu SELECT INTO

source: subquery in FROM may not refer to other relations of same query level
sk: poddotaz v klauzule FROM nemô¾e odkazova» na iné relácie rovnakej úrovne dotazovania

source: function expression in FROM may not refer to other relations of same query level
sk: výraz funkcie v klauzule FROM nemô¾e odkazova» na iné relácie rovnakej úrovne dotazovania

source: cannot use aggregate function in function expression in FROM
sk: nie je mo¾né pou¾i» agregaènú funkciu vo výraze funkcie v klauzule FROM

source: column name "%s" appears more than once in USING clause
sk: názov ståpca "%s" je uvedený v klauzule USING viac ako raz

source: common column name "%s" appears more than once in left table
sk: názov spoloèného ståpca "%s" je uvedený viac ako raz v µavej tabuµke

source: column "%s" specified in USING clause does not exist in left table
sk: ståpec "%s" uvedený v klauzule USING neexistuje v µavej tabuµke

source: common column name "%s" appears more than once in right table
sk: názov spoloèného ståpca "%s" je uvedený viac ako raz v pravej tabuµke

source: column "%s" specified in USING clause does not exist in right table
sk: ståpec "%s" uvedený v klauzule USING neexistuje v pravej tabuµke

source: column alias list for "%s" has too many entries
sk: zoznam aliasov ståpcov pre "%s" má príli¹ veµa polo¾iek

source: argument of %s must not contain variables
sk: argument %s nesmie obsahova» premenné

source: argument of %s must not contain aggregates
sk: argument %s nesmie obsahova» agregaèné funkcie

source: argument of %s must not contain subqueries
sk: argument %s nesmie obsahova» subdotazy

source: %s "%s" is ambiguous
sk: %s "%s" je neurèité

source: non-integer constant in %s
sk: neceloèíselná kon¹tanta v %s

source: %s position %d is not in select list
sk: %s, pozícia %d nie je v zozname výberu

source: for SELECT DISTINCT, ORDER BY expressions must appear in select list
sk: v prípade klauzúl SELECT DISTINCT, ORDER BY musia výrazy by» uvedené v zozname výberu

source: SELECT DISTINCT ON expressions must match initial ORDER BY expressions
sk: výrazy SELECT DISTINCT ON musia by» zosúladené s pôvodnými výrazmi ORDER BY

source: CREATE VIEW specifies more column names than columns
sk: povel CREATE VIEW urèuje viac názvov ståpcov ako je ståpcov

source: INSERT ... SELECT may not specify INTO
sk: povel INSERT ... SELECT nemô¾e urèova» INTO

source: INSERT has more expressions than target columns
sk: INSERT má viac výrazov ako cieµových ståpcov

source: INSERT has more target columns than expressions
sk: INSERT má viac cieµových ståpcov ako výrazov

source: %s will create implicit sequence "%s" for serial column "%s.%s"
sk: %s vytvorí implicitnú sekvenciu "%s" pre sériový ståpec "%s.%s"

source: conflicting NULL/NOT NULL declarations for column "%s" of table "%s"
sk: protichodné deklarácie NULL/NOT NULL pre ståpec "%s" tabuµky "%s"

source: multiple default values specified for column "%s" of table "%s"
sk: bolo urèených viac implicitných hodnôt pre ståpec "%s" tabuµky "%s"

source: column "%s" appears twice in primary key constraint
sk: ståpec "%s" je uvedený dvakrát v obmedzení primárneho kµúèa

source: column "%s" appears twice in unique constraint
sk: ståpec "%s" je uvedený dvakrát v obmedzení jedineènosti

source: index expression may not return a set
sk: indexový výraz nesmie vráti» mno¾inu

source: rule WHERE condition may not contain references to other relations
sk: podmienka WHERE pravidla nesmie obsahova» odkazy na iné relácie

source: rule WHERE condition may not contain aggregate functions
sk: podmienka WHERE pravidla nesmie obsahova» agregaèné funkcie

source: rules with WHERE conditions may only have SELECT, INSERT, UPDATE, or DELETE actions
sk: pravidlá s podmienkami where mô¾u ma» iba èinnosti SELECT, INSERT, UPDATE alebo DELETE

source: conditional UNION/INTERSECT/EXCEPT statements are not implemented
sk: podmienené príkazy UNION/INTERSECT/EXCEPT nie sú implementované

source: ON SELECT rule may not use OLD
sk: pravidlo ON SELECT nemô¾e pou¾i» OLD

source: ON SELECT rule may not use NEW
sk: pravidlo ON SELECT nemô¾e pou¾i» NEW

source: ON INSERT rule may not use OLD
sk: pravidlo ON INSERT nemô¾e pou¾i» OLD

source: ON DELETE rule may not use NEW
sk: pravidlo ON DELETE nemô¾e pou¾i» NEW

source: ORDER BY on a UNION/INTERSECT/EXCEPT result must be on one of the result columns
sk: klauzula ORDER BY aplikovaná na výsledok UNION/INTERSECT/EXCEPT musí by» jedným z výsledných ståpcov

source: INTO is only allowed on first SELECT of UNION/INTERSECT/EXCEPT
sk: INTO sa povoµuje len na prvú klauzulu z UNION/INTERSECT/EXCEPT

source: UNION/INTERSECT/EXCEPT member statement may not refer to other relations of same query level
sk: èlenský príkaz UNION/INTERSECT/EXCEPT nemô¾e odkazova» na iné relácie rovnakej úrovne dotazovania

source: each %s query must have the same number of columns
sk: ka¾dý dotaz %s musí ma» rovnaký poèet ståpcov

source: CREATE TABLE AS specifies too many column names
sk: povel CREATE TABLE AS urèuje príli¹ veµa názvov ståpcov

source: cannot specify both SCROLL and NO SCROLL
sk: nie je mo¾né pou¾i» súèasne SCROLL aj NO SCROLL

source: wrong number of parameters for prepared statement "%s"
sk: nesprávny poèet parametrov pripraveného príkazu "%s"

source: Expected %d parameters but got %d.
sk: Oèakávalo sa %d parametrov, bolo získaných iba %d.

source: cannot use subquery in EXECUTE parameter
sk: nebolo mo¾né pou¾i» subdotaz v parametri EXECUTE

source: cannot use aggregate function in EXECUTE parameter
sk: nebolo mo¾né pou¾i» agregaènú funkciu v parametri EXECUTE

source: parameter $%d of type %s cannot be coerced to the expected type %s
sk: parameter $%d typu %s nie je mo¾né previes» na po¾adovaný typ %s

source: SELECT FOR UPDATE is not allowed with DISTINCT clause
sk: povel SELECT FOR UPDATE nie je mo¾né pou¾i» s klauzulou DISTINCT

source: SELECT FOR UPDATE is not allowed with GROUP BY clause
sk: povel SELECT FOR UPDATE nie je mo¾né pou¾i» s klauzulou GROUP BY

source: SELECT FOR UPDATE is not allowed with aggregate functions
sk: povel SELECT FOR UPDATE nie je mo¾né pou¾i» s agregaènými funkciami

source: SELECT FOR UPDATE cannot be applied to a join
sk: povel SELECT FOR UPDATE nie je mo¾né pou¾i» na spojenie

source: SELECT FOR UPDATE cannot be applied to NEW or OLD
sk: povel SELECT FOR UPDATE nie je mo¾né aplikova» na NEW alebo OLD

source: SELECT FOR UPDATE cannot be applied to a function
sk: povel SELECT FOR UPDATE nie je mo¾né pou¾i» na funkciu

source: relation "%s" in FOR UPDATE clause not found in FROM clause
sk: nebolo mo¾né nájs» reláciu "%s" uvedenú v klauzule FOR UPDATE v klauzule FROM

source: misplaced DEFERRABLE clause
sk: nesprávne umiestnená klauzula DEFERRABLE

source: multiple DEFERRABLE/NOT DEFERRABLE clauses not allowed
sk: nie je povolené ma» viacero klauzúl DEFERRABLE/NOT DEFERRABLE

source: misplaced NOT DEFERRABLE clause
sk: nesprávne umiestnená klauzula NOT DEFERRABLE

source: constraint declared INITIALLY DEFERRED must be DEFERRABLE
sk: obmedzenie deklarované ako INITIALLY DEFERRED (pôvodne odsunuteµný) musí by» oznaèené ako DEFERRABLE (odsunuteµný)

source: misplaced INITIALLY DEFERRED clause
sk: nesprávne umiestnená klauzula INITIALLY DEFERRED

source: multiple INITIALLY IMMEDIATE/DEFERRED clauses not allowed
sk: nie je povolené ma» viacero klauzúl INITIALLY IMMEDIATE/DEFERRED

source: misplaced INITIALLY IMMEDIATE clause
sk: nesprávne umiestnená klauzula INITIALLY IMMEDIATE

source: CREATE specifies a schema (%s) different from the one being created (%s)
sk: povel CREATE vytvorí schému (%s) odli¹nú od doteraz pou¾ívanej (%s)

source: there is no parameter $%d
sk: neexistuje ¾iaden parameter $%d

source: could not determine data type of parameter $%d
sk: nebolo mo¾né urèi» údajový typ parametra $%d

source: aggregates not allowed in WHERE clause
sk: agregaèné funkcie nie sú povolené v klauzule WHERE

source: aggregates not allowed in JOIN conditions
sk: agregaèné funkcie nie sú povolené v podmienkach klauzuly JOIN (spojenie)

source: aggregates not allowed in GROUP BY clause
sk: agregaèné funkcie nie sú povolené v podmienkach klauzuly GROUP BY

source: column "%s.%s" must appear in the GROUP BY clause or be used in an aggregate function
sk: ståpec "%s.%s" sa musí objavi» v klauzule GROUP BY alebo musí by» pou¾itý v agregaènej funkcii.

source: subquery uses ungrouped column "%s.%s" from outer query
sk: Subdotaz pou¾íva nezoskupený ståpec "%s.%s" z vonkaj¹ieho dotazu

source: inconsistent types deduced for parameter $%d
sk: do¹lo k nekonzistentnej dedukcii typu pre parameter $%d

source: cannot cast type %s to %s
sk: nie je mo¾né zmeni» typ z %s na %s

source: Input has wrong number of columns.
sk: Vstup má nesprávny poèet ståpcov.

source: Cannot cast type %s to %s in column %d.
sk: Nie je mo¾né zmeni» typ z %s na %s v ståpci %d.

source: argument of %s must be type boolean, not type %s
sk: argument %s musí by» booleovského typu, nie typu %s

source: argument of %s must not return a set
sk: argument %s nesmie vráti» mno¾inu

source: argument of %s must be type integer, not type %s
sk: argument %s musí by» typu integer, nie typu %s

source: %s types %s and %s cannot be matched
sk: nie je mo¾né zladi» typy %s a %s pre objekty %s

source: %s could not convert type %s to %s
sk: %s: nebolo mo¾né zmeni» typ z %s na %s

source: arguments declared "anyelement" are not all alike
sk: argumenty definované ako "anyelement" nie sú v¹etky rovnaké

source: arguments declared "anyarray" are not all alike
sk: argumenty definované ako "anyarray" nie sú v¹etky rovnaké

source: argument declared "anyarray" is not an array but type %s
sk: argument deklarovaný ako "anyarray" nie je pole ale je typu %s

source: argument declared "anyarray" is not consistent with argument declared "anyelement"
sk: argument deklarovaný ako "anyarray" nie je konzistentný s argumentom deklarovaným ako "anyelement"

source: could not determine anyarray/anyelement type because input has type "unknown"
sk: nebolo mo¾né urèi» typ anyarray/anyelement, lebo vstup je typu "unknown" (neznámy)

source: could not find array type for data type %s
sk: nebolo mo¾né nájs» typ poµa pre údajový typ %s

source: table reference "%s" is ambiguous
sk: odkaz na tabuµku "%s" nie je jednoznaèný

source: table reference %u is ambiguous
sk: odkaz na tabuµku %u nie je jednoznaèný

source: table name "%s" specified more than once
sk: názov tabuµky "%s" je urèený viackrát

source: column reference "%s" is ambiguous
sk: odkaz na ståpec "%s" je nejednoznaèný

source: table "%s" has %d columns available but %d columns specified
sk: tabuµka "%s" má dostupných %d ståpcov, av¹ak urèených je iba %d

source: a column definition list is only allowed for functions returning "record"
sk: zoznam definície ståpcov je povolený len v prípade funkcií vracajúcich záznam ("record")

source: a column definition list is required for functions returning "record"
sk: zoznam definície ståpcov sa po¾aduje v prípade funkcií vracajúcich záznam ("record")

source: too many column aliases specified for function %s
sk: príli¹ veµa aliasov definovaných pre funkciu %s

source: function "%s" in FROM has unsupported return type
sk: funkcia "%s" v klauzuli FROM má nepodporovaný návratový typ

source: function in FROM has unsupported return type
sk: funkcia v klauzuli FROM má nepodporovaný návratový typ

source: missing FROM-clause entry in subquery for table "%s"
sk: chýbajúci záznam v klauzuli FROM v poddotaze pre tabuµku "%s"

source: missing FROM-clause entry for table "%s"
sk: chýbajúci záznam v klauzuli FROM pre tabuµku "%s"

source: adding missing FROM-clause entry in subquery for table "%s"
sk: pridáva sa chýbajúci záznam v klauzuli FROM v subdotaze pre tabuµku "%s"

source: adding missing FROM-clause entry for table "%s"
sk: pridáva sa chýbajúci záznam v klauzuli FROM pre tabuµku "%s"

source: NULLIF requires = operator to yield boolean
sk: NULLIF po¾aduje, aby operátor = vrátil hodnotu boolean

source: subquery must return a column
sk: poddotaz musí vráti» ståpec

source: subquery must return only one column
sk: poddotaz smie vráti» iba jeden ståpec

source: row comparison cannot use operator %s
sk: porovnanie riadkov nemô¾e pou¾íva» operátor %s

source: subquery has too many columns
sk: poddotaz má príli¹ veµa ståpcov

source: operator %s must return type boolean, not type %s
sk: operátor %s musí vráti» typ boolean, nie typ %s
