Repository: IITDBGroup/perm
Catalog: src/backend/po/*.po
Languages: sk

source: Usage: postgres -boot [OPTION]... DBNAME -c NAME=VALUE set run-time parameter -d 1-5 debug level -D datadir data directory -F turn off fsync -o file send debug output to file -x num internal use
sk: Pou¾itie: postgres -boot [PREPÍNAÈ]... NÁZOV_DATABÁZY -c NÁZOV=HODNOTA nastavenie parametrov behu systému -d 1-5 úroveò ladenia -D adresár dátový adresár -F vypnutie fsync -o súbor zapísa» ladiaci výstup do súboru -x èíslo interné pou¾itie

source: cannot drop %s because other objects depend on it
sk: nie je mo¾né vymaza» objekt %s, lebo sú na òom závislé iné objekty

source: Use DROP ... CASCADE to drop the dependent objects too.
sk: Pou¾ite zápis DROP ... CASCADE, ak chcete vymaza» aj závislé objekty.

source: failed to drop all objects depending on %s
sk: Nepodarilo sa vymaza» v¹etky objekty závislé od objektu %s

source: cannot drop %s because it is required by the database system
sk: Nie je mo¾né vymaza» objekt %s, lebo ho potrebuje databázový systém

source: cannot drop %s because %s requires it
sk: Nie je mo¾né vymaza» objekt %s, lebo ho potrebuje objekt %s

source: You may drop %s instead.
sk: Namiesto toho mô¾ete vymaza» objekt %s.

source: drop auto-cascades to %s
sk: operácia vymazania (drop) automaticky kaskádne prechádza na objekt %s

source: %s depends on %s
sk: %s závisí od %s

source: drop cascades to %s
sk: operácia vymazania (drop) kaskádne prechádza na %s

source: column %s
sk: ståpec %s

source: function %s
sk: funkcia %s

source: type %s
sk: typ %s

source: cast from %s to %s
sk: pretypovanie z %s na %s

source: constraint %s on
sk: obmedzenie %s pre

source: constraint %s
sk: obmedzenie %s

source: conversion %s
sk: konverzia %s

source: default for %s
sk: implicitné pre %s

source: language %s
sk: jazyk %s

source: operator %s
sk: operátor %s

source: operator class %s for %s
sk: trieda operátorov %s pre %s

source: rule %s on
sk: pravidlo %s pre

source: trigger %s on
sk: trigger %s pre

source: schema %s
sk: schéma %s

source: table %s
sk: tabuµka %s

source: special system relation %s
sk: ¹peciálna systémová relácia %s

source: sequence %s
sk: sekvencia %s

source: uncataloged table %s
sk: nekatalógovaná tabuµka %s

source: toast table %s
sk: tabuµka toast %s

source: view %s
sk: pohµad %s

source: composite type %s
sk: zlo¾ený typ %s

source: relation %s
sk: relácia %s

source: grant options can only be granted to individual users
sk: nastavenia pridelenia právomocí je mo¾né prideli» iba jednotlivým pou¾ívateµom

source: invalid privilege type %s for table
sk: Neplatný typ právomoci %s pre tabuµku

source: no privileges were granted
sk: neboli urèené právomoci

source: not all privileges were granted
sk: neboli urèené v¹etky právomoci

source: no privileges could be revoked
sk: nebolo mo¾né zru¹i» ¾iadne právomoci

source: not all privileges could be revoked
sk: nebolo mo¾né zru¹i» v¹etky právomoci

source: invalid privilege type %s for database
sk: Neplatný typ právomoci %s pre databázu

source: database "%s" does not exist
sk: databáza "%s" neexistuje

source: invalid privilege type %s for function
sk: neplatný typ právomoci %s pre funkciu

source: invalid privilege type %s for language
sk: neplatný typ právomoci %s pre jazyk

source: language "%s" does not exist
sk: jazyk "%s" neexistuje

source: language "%s" is not trusted
sk: jazyk "%s" nie je dôveryhodný

source: invalid privilege type %s for schema
sk: neplatný typ právomoci %s pre schému

source: schema "%s" does not exist
sk: Schéma "%s" neexistuje

source: invalid privilege type %s for tablespace
sk: Neplatný typ právomoci %s pre tabuµkový priestor

source: tablespace "%s" does not exist
sk: tabuµkový priestor "%s" neexistuje

source: group "%s" does not exist
sk: skupina "%s" neexistuje

source: permission denied for relation %s
sk: prístup odmietnutý pre reláciu %s

source: permission denied for database %s
sk: prístup odmietnutý pre databázu %s

source: permission denied for function %s
sk: prístup odmietnutý pre funkciu %s

source: permission denied for operator %s
sk: prístup odmietnutý pre operátor %s

source: permission denied for type %s
sk: prístup odmietnutý pre typ %s

source: permission denied for language %s
sk: prístup odmietnutý pre jazyk %s

source: permission denied for schema %s
sk: prístup odmietnutý pre schému %s

source: permission denied for operator class %s
sk: prístup odmietnutý pre triedu operátorov %s

source: permission denied for conversion %s
sk: prístup odmietnutý pre konverziu %s

source: permission denied for tablespace %s
sk: prístup odmietnutý pre tabuµkový priestor %s

source: must be owner of relation %s
sk: musíte by» vlastníkom relácie %s

source: must be owner of database %s
sk: musíte by» vlastníkom databázy %s

source: must be owner of function %s
sk: musíte by» vlastníkom funkcie %s

source: must be owner of operator %s
sk: musíte by» vlastníkom operátora %s

source: must be owner of type %s
sk: musíte by» vlastníkom typu %s

source: must be owner of language %s
sk: musíte by» vlastníkom jazyka %s

source: must be owner of schema %s
sk: musíte by» vlastníkom schémy %s

source: must be owner of operator class %s
sk: musíte by» vlastníkom triedy operátorov %s

source: must be owner of conversion %s
sk: musíte by» vlastníkom konverzie %s

source: must be owner of tablespace %s
sk: musíte by» vlastníkom tabuµkového priestoru %s

source: user with ID %u does not exist
sk: Pou¾ívateµ s ID %u neexistuje

source: relation with OID %u does not exist
sk: Relácia s OID %u neexistuje

source: database with OID %u does not exist
sk: Databáza s OID %u neexistuje

source: function with OID %u does not exist
sk: Funkcia s OID %u neexistuje

source: language with OID %u does not exist
sk: Jazyk s OID %u neexistuje

source: schema with OID %u does not exist
sk: Schéma s OID %u neexistuje

source: tablespace with OID %u does not exist
sk: Tabuµkový priestor s OID %u neexistuje

source: type with OID %u does not exist
sk: Typ s OID %u neexistuje

source: operator with OID %u does not exist
sk: Operátor s OID %u neexistuje

source: operator class with OID %u does not exist
sk: Trieda operátorov s OID %u neexistuje

source: conversion with OID %u does not exist
sk: konverzia s OID %u neexistuje

source: cannot determine transition data type
sk: nebolo mo¾né urèi» prechodný údajový typ

source: An aggregate using "anyarray" or "anyelement" as transition type must have one of them as its base type.
sk: Agregaèná funkcia, ktorá pou¾íva "anyarray" alebo "anyelement" ako prechodný typ musí ma» jeden z nich uvedený ako jej základný typ.

source: return type of transition function %s is not %s
sk: Návratový typ prechodnej funkcie %s nie je %s

source: must not omit initial value when transition function is strict and transition type is not compatible with input type
sk: nesmiete vynecha» poèiatoènú hodnotu v prípade, ak je prechodová funkcia prísna a prechodový typ nie je kompatibilný so vstupným typom

source: cannot determine result data type
sk: nie je mo¾né urèi» údajový typ vrátenej hodnoty

source: An aggregate returning "anyarray" or "anyelement" must have one of them as its base type.
sk: Agregaèná funkcia, ktorá vracia "anyarray" alebo "anyelement" musí ma» jeden z nich uvedený ako jej základný typ.

source: function %s does not exist
sk: Funkcia %s neexistuje

source: function %s returns a set
sk: Funkcia %s vracia mno¾inu

source: function %s requires run-time type coercion
sk: Funkcia %s vy¾aduje prevod typu poèas vykonávania

source: permission denied to create "%s.%s"
sk: prístup odmietnutý pre vytvorenie "%s.%s"

source: System catalog modifications are currently disallowed.
sk: Zmeny systémového katalógu sú momentálne zakázané.

source: tables can have at most %d columns
sk: Tabuµka mô¾e ma» maximálne %d ståpcov

source: column name "%s" conflicts with a system column name
sk: názov ståpca "%s" je v konflikte s u¾ existujúcim systémovým ståpcom

source: column name "%s" is duplicated
sk: názov ståpca "%s" je duplikátny

source: column "%s" has type "unknown"
sk: typ ståpca "%s" je "neznámy"

source: Proceeding with relation creation anyway.
sk: Vytváranie relácie beztak pokraèuje.

source: column "%s" has pseudo-type %s
sk: typ ståpca "%s" je pseudo-typ %s

source: relation "%s" already exists
sk: Relácia "%s" u¾ existuje

source: only table "%s" can be referenced in check constraint
sk: Iba relácia "%s" mô¾e by» referencovaná v kontrolnom obmedzení

source: cannot use subquery in check constraint
sk: nie je mo¾né pou¾i» poddotaz vo výraze kontrolného obmedzenia

source: cannot use aggregate function in check constraint
sk: nie je mo¾né pou¾i» agregaènú funkciu v kontrolnom obmedzení

source: constraint "%s" for relation "%s" already exists
sk: Obmedzenie "%s" pre reláciu "%s" u¾ existuje

source: check constraint "%s" already exists
sk: Kontrolné obmedzenie "%s" u¾ existuje

source: cannot use column references in default expression
sk: nie je mo¾né pou¾i» referencie ståpcov v implicitnom výraze

source: default expression must not return a set
sk: implicitný výraz nesmie vráti» mno¾inu

source: cannot use subquery in default expression
sk: nie je mo¾né pou¾i» poddotaz v implicitnom výraze

source: cannot use aggregate function in default expression
sk: nie je mo¾né pou¾i» agregaènú funkciu v implicitnom výraze

source: column "%s" is of type %s but default expression is of type %s
sk: Ståpec "%s" je typu %s, av¹ak implicitný výraz je typu %s

source: You will need to rewrite or cast the expression.
sk: Budete musie» prepísa» alebo pretypova» výraz.

source: cannot truncate a table referenced in a foreign key constraint
sk: nie je mo¾né oreza» tabuµku, ktorá je referencovaná v obmedzení cudzieho kµúèa

source: Table "%s" references "%s" via foreign key constraint "%s".
sk: Tabuµka "%s" odkazuje na "%s" prostredníctvom obmedzenia cudzieho kµúèa "%s".

source: user-defined indexes on system catalog tables are not supported
sk: na tabuµkách systémových katalógov nie sú podporované pou¾ívateµom definované indexy

source: shared indexes cannot be created after initdb
sk: po operácii initdb nie je mo¾né vytvori» zdieµané indexy

source: shared index "%s" can only be reindexed in stand-alone mode
sk: zdieµaný index "%s" je mo¾né opätovne indexova» iba v samostatnom (stand-alone) re¾ime

source: cross-database references are not implemented: "%s.%s.%s"
sk: krí¾ové odkazy medzi databázami nie sú implementované: "%s.%s.%s"

source: relation "%s.%s" does not exist
sk: relácia "%s.%s" neexistuje

source: relation "%s" does not exist
sk: relácia "%s" neexistuje

source: temporary tables may not specify a schema name
sk: doèasné tabuµky nemô¾u urèova» názov schémy

source: no schema has been selected to create in
sk: nevybrali ste schému, v ktorej má dôjs» k vytvoreniu

source: cross-database references are not implemented: %s
sk: krí¾ové odkazy medzi databázami nie sú implementované: %s

source: improper qualified name (too many dotted names): %s
sk: nesprávny kvalifikovaný názov (príli¹ veµa bodkovaných názvov): %s

source: improper relation name (too many dotted names): %s
sk: nesprávny názov relácie (príli¹ veµa bodkovaných názvov): %s

source: permission denied to create temporary tables in database "%s"
sk: prístup odmietnutý pre vytvorenie doèasných tabuliek v databáze "%s"

source: large object %u does not exist
sk: veµký objekt %u neexistuje

source: conversion "%s" already exists
sk: Konverzia "%s" u¾ existuje

source: default conversion for %s to %s already exists
sk: implicitná konverzia z %s na %s u¾ existuje

source: conversion "%s" does not exist
sk: konverzia "%s" neexistuje

source: schema "%s" already exists
sk: schéma "%s" u¾ existuje

source: "%s" is not a valid operator name
sk: "%s" nie je platný názov operátora

source: at least one of leftarg or rightarg must be specified
sk: musíte urèi» aspoò jeden µavý alebo pravý argument

source: only binary operators can have commutators
sk: iba binárne operátory mô¾u ma» komutátory

source: only binary operators can have join selectivity
sk: selektívnos» spojení mô¾ete urèi» len u binárnych operátorov

source: only binary operators can hash
sk: operáciu hash mô¾ete definova» len u binárnych operátorov

source: only binary operators can merge join
sk: iba binárne operátory mô¾u vykona» spojenie zlúèením

source: operator %s already exists
sk: operátor %s u¾ existuje

source: operator cannot be its own negator or sort operator
sk: operátor nemô¾e by» vlastným negátorom alebo triediacim operátorom

source: functions cannot have more than %d arguments
sk: funkcie nemô¾u ma» viac ako %d argumentov

source: A function returning "anyarray" or "anyelement" must have at least one argument of either type.
sk: Funkcia, ktorá vracia "anyarray" alebo "anyelement" musí ma» jeden argument takého typu.

source: "%s" is already an attribute of type %s
sk: "%s" je u¾ atribútom typu %s

source: function "%s" already exists with same argument types
sk: funkcia "%s" u¾ existuje s rovnakými typmi argumentov

source: cannot change return type of existing function
sk: nie je mo¾né zmeni» návratový typ existujúcej funkcie

source: Use DROP FUNCTION first.
sk: Najprv pou¾ite operáciu DROP FUNCTION.

source: function "%s" is an aggregate
sk: funkcia "%s" je agregaènou funkciou

source: function "%s" is not an aggregate
sk: funkcia "%s" nie je agregaènou funkciou

source: return type mismatch in function declared to return %s
sk: Konflikt návratových typov vo funkcii, ktorej návratový typ je deklarovaný ako %s

source: Function's final statement must be a SELECT.
sk: Závereèný príkaz funkcie musí by» SELECT.

source: Function's final statement must not be a SELECT.
sk: Závereèný príkaz funkcie nesmie by» SELECT.

source: Final SELECT must return exactly one column.
sk: Závereèný SELECT musí vráti» presne jeden ståpec.

source: Actual return type is %s.
sk: Skutoèný návratový typ je %s.

source: Final SELECT returns too many columns.
sk: Závereèný SELECT vracia príli¹ mnoho ståpcov.

source: Final SELECT returns %s instead of %s at column %d.
sk: Závereèný SELECT vracia %s namiesto %s v prípade ståpca %d.

source: Final SELECT returns too few columns.
sk: Závereèný SELECT vracia príli¹ málo ståpcov.

source: return type %s is not supported for SQL functions
sk: návratový typ %s nepodporujú funkcie v jazyku SQL

source: there is no built-in function named "%s"
sk: neexistuje ¾iadna vstavaná funkcia s názvom "%s"

source: SQL functions cannot return type %s
sk: Funkcie jazyka SQL nemô¾u vraca» typ %s

source: SQL functions cannot have arguments of type %s
sk: Funkcie jazyka SQL nemô¾u ma» argumenty typu %s

source: SQL function "%s"
sk: funkcia jazyka SQL "%s"

source: invalid type internal size %d
sk: neplatná interná veµkos» typu %d

source: internal size %d is invalid for passed-by-value type
sk: interná veµkos» %d je neplatná pre typ, ktorý sa odovzdáva hodnotou

source: fixed-size types must have storage PLAIN
sk: typy s kon¹tantnou veµkos»ou musia ma» ukladanie definované ako PLAIN (jednoduché)

source: type "%s" already exists
sk: typ "%s" u¾ existuje

source: type "%s" does not exist
sk: typ "%s" neexistuje

source: aggregate attribute "%s" not recognized
sk: atribút "%s" agregaènej funkcie nebol rozpoznaný

source: aggregate basetype must be specified
sk: musíte urèi» základný typ (basetype) agregaènej funkcie

source: aggregate stype must be specified
sk: musíte urèi» stype agregaènej funkcie

source: aggregate sfunc must be specified
sk: musíte urèi» sfunc agregaènej funkcie

source: aggregate transition data type cannot be %s
sk: prechodový údajový typ agregaènej funkcie nemô¾e by» %s

source: function %s(*) already exists in schema "%s"
sk: funkcia %s(*) u¾ existuje v schéme "%s"

source: function %s already exists in schema "%s"
sk: funkcia %s u¾ existuje v schéme "%s"

source: must be superuser to change owner
sk: pre zmenu vlastníka musíte by» superu¾ívateµom

source: skipping "%s" --- only table or database owner can analyze it
sk: vynecháva sa "%s" --- analýzu mô¾e vykonáva» iba vlastník tabuµky èi databázy

source: skipping "%s" --- cannot analyze indexes, views, or special system tables
sk: vynecháva sa "%s" --- nie je mo¾né vykona» analýzu indexov, pohµadov alebo ¹peciálnych systémových tabuliek

source: analyzing "%s.%s"
sk: analyzuje sa "%s.%s"

source: "%s": scanned %d of %u pages, containing %.0f live rows and %.0f dead rows; %d rows in sample, %.0f estimated total rows
sk: "%s": prehµadávanie vykonané na %d stránkach z %u, obsahujúcich %.0f ¾ivých riadkov a %.0f màtvych riadkov, %d riadkov vo vzorke, odhad celkového poètu riadkov %.0f

source: there is no previously clustered index for table "%s"
sk: neexistuje u¾ zoskupený (klastrovaný) index pre tabuµku "%s"

source: index "%s" for table "%s" does not exist
sk: index "%s" tabuµky "%s" neexistuje

source: "%s" is not an index for table "%s"
sk: "%s" nie je index tabuµky "%s"

source: cannot cluster on partial index
sk: nie je mo¾né vykona» zoskupenie (klastrovanie) na èiastoènom indexe

source: cannot cluster when index access method does not handle null values
sk: nie je mo¾né vykona» zoskupenie (klastrovanie) ak prístupová metóda indexov nedoká¾e pracova» s hodnotami null

source: You may be able to work around this by marking column "%s" NOT NULL.
sk: Tento problém mô¾ete vyrie¹i» oznaèením ståpca "%s" ako NOT NULL.

source: cannot cluster on expressional index when index access method does not handle null values
sk: nie je mo¾né vykona» zoskupenie (klastrovanie) na výrazovom indexe (expressional index) ak prístupová metóda indexov nedoká¾e pracova» s hodnotami null

source: "%s" is a system catalog
sk: "%s" je systémový katalóg

source: cannot cluster temporary tables of other sessions
sk: nie je mo¾né vykona» operáciu zoskupenia (klastrovania) na doèasných tabuµkách iných sedení

source: source encoding "%s" does not exist
sk: Zdrojové kódovanie "%s" neexistuje

source: destination encoding "%s" does not exist
sk: Cieµové kódovanie "%s" neexistuje

source: conversion "%s" already exists in schema "%s"
sk: Konverzia "%s" u¾ existuje v schéme "%s"

source: "%s" is not a sequence
sk: "%s" nie je sekvencia

source: "%s" is not a table
sk: "%s" nie je tabuµka

source: "%s" is not a view
sk: "%s" nie je pohµad

source: column "%s" of relation "%s" does not exist
sk: Ståpec "%s" relácie "%s" neexistuje

source: database name may not be qualified
sk: nie je mo¾né kvalifikova» názov databázy

source: database comments may only be applied to the current database
sk: komentáre databázy je mo¾né aplikova» len pre aktuálnu databázu

source: schema name may not be qualified
sk: nie je mo¾né kvalifikova» názov schémy

source: rule "%s" does not exist
sk: pravidlo "%s" neexistuje

source: there are multiple rules named "%s"
sk: Existuje viacero pravidiel s názvom "%s"

source: Specify a relation name as well as a rule name.
sk: Zadajte názov relácie a tie¾ názov pravidla.

source: rule "%s" for relation "%s" does not exist
sk: pravidlo "%s" pre reláciu "%s" neexistuje

source: trigger "%s" for table "%s" does not exist
sk: Trigger "%s" tabuµky "%s" neexistuje

source: table "%s" has multiple constraints named "%s"
sk: tabuµka "%s" má viacero obmedzení s názvom "%s"

source: constraint "%s" for table "%s" does not exist
sk: obmedzenie "%s" tabuµky "%s" neexistuje

source: language name may not be qualified
sk: nie je mo¾né kvalifikova» názov jazyka

source: must be superuser to comment on procedural language
sk: pre vytvorenie komentára procedurálneho jazyka musíte by» superu¾ívateµom

source: access method "%s" does not exist
sk: Prístupová metóda "%s" neexistuje

source: operator class "%s" does not exist for access method "%s"
sk: trieda operátorov "%s" neexistuje pre prístupovú metódu "%s"

source: source data type %s does not exist
sk: zdrojový údajový typ %s neexistuje

source: target data type %s does not exist
sk: cieµový údajový typ %s neexistuje

source: cast from type %s to type %s does not exist
sk: pretypovanie z typu %s na typ %s neexistuje

source: must be owner of type %s or type %s
sk: musíte by» vlastníkom typu %s alebo typu %s

source: conflicting or redundant options
sk: konfliktné alebo nadbytoèné nastavenia

source: LOCATION is not supported anymore
sk: LOCATION nie je ïalej podporované

source: Consider using tablespaces instead.
sk: Skúste pou¾i» tabuµkové priestory.

source: %d is not a valid encoding code
sk: %d nie je platným kódom kódovania

source: %s is not a valid encoding name
sk: %s nie je platným názvom kódovania

source: permission denied to create database
sk: prístup odmietnutý pre vytvorenie databázy

source: must be superuser to create database for another user
sk: ak chcete vytvori» databázu pre iného u¾ívateµa, musíte by» superu¾ívateµom

source: database "%s" already exists
sk: databáza "%s" u¾ existuje

source: template database "%s" does not exist
sk: ¹ablóna databázy "%s" neexistuje

source: permission denied to copy database "%s"
sk: prístup odmietnutý pre kopírovanie databázy "%s"

source: source database "%s" is being accessed by other users
sk: zdrojovú databázu "%s" práve pou¾ívajú iný u¾ívatelia

source: invalid server encoding %d
sk: neplatné kódovanie servera %d

source: could not initialize database directory
sk: nebolo mo¾né inicializova» adresár databázy

source: Directory "%s" already exists.
sk: Adresár "%s" u¾ existuje

source: Failing system command was: %s
sk: Systémový povel, ktorý neuspel bol: %s

source: Look in the postmaster's stderr log for more information.
sk: Viac informácií nájdete v stderr logu programu postmaster.

source: cannot drop the currently open database
sk: nie je mo¾né vymaza» práve otvorenú databázu

source: cannot drop a template database
sk: nie je mo¾né vymaza» ¹ablónu databáz

source: database "%s" is being accessed by other users
sk: databázu "%s" práve pou¾ívajú iný u¾ívatelia

source: current database may not be renamed
sk: aktuálnu databázu nie je mo¾né premenova»

source: permission denied to rename database
sk: prístup odmietnutý pre premenovanie databázy

source: could not remove database directory "%s"
sk: nebolo mo¾né odstráni» adresár databázy "%s"

source: COPY BINARY is not supported to stdout or from stdin
sk: povel COPY BINARY nepracuje s výstupom na stdout alebo so vstupom z stdin

source: could not write to COPY file: %m
sk: nebolo mo¾né zapisova» do súboru povelu COPY: %m

source: connection lost during COPY to stdout
sk: Spojenie bolo preru¹ené poèas operácie COPY smerujúcej na stdout

source: unexpected EOF on client connection
sk: neoèakávaný znak EOF pri spojení s klientom

source: COPY from stdin failed: %s
sk: èítanie z stdin u povelu COPY bolo neúspe¹né: %s

source: unexpected message type 0x%02X during COPY from stdin
sk: Neoèakávaný typ správy 0x%02X poèas operácie COPY zo ¹tandardného vstupu

source: cannot specify DELIMITER in BINARY mode
sk: v binárnom (BINARY) re¾ime nie je mo¾né urèi» oddeµovaèe (DELIMITER)

source: cannot specify CSV in BINARY mode
sk: v binárnom (BINARY) re¾ime nie je mo¾né urèi» re¾im CSV

source: cannot specify NULL in BINARY mode
sk: v binárnom (BINARY) re¾ime nie je mo¾né urèi» NULL hodnoty

source: COPY delimiter must be a single character
sk: Oddeµovaè operácie COPY musí by» jeden znak

source: COPY quote available only in CSV mode
sk: Úvodzovky pre povel COPY sú dostupné iba v re¾ime CSV

source: COPY quote must be a single character
sk: Úvodzovka operácie COPY musí by» jeden znak

source: COPY escape available only in CSV mode
sk: Únikový znak pre povel COPY je dostupný iba v re¾ime CSV

source: COPY escape must be a single character
sk: Únikový znak operácie COPY musí by» jeden znak

source: COPY force quote available only in CSV mode
sk: hodnoty povinne uzavreté do úvodzoviek (force quote) povelu COPY sú dostupné iba v re¾ime CSV
