Repository: IITDBGroup/perm
Catalog: src/backend/po/*.po
Languages: sk

source: The operator of a quantified predicate subquery must return type boolean.
sk: Operátor subdotazu kvantifikovaného poddotazu musí vráti» typ boolean.

source: operator %s must not return a set
sk: operátor %s nesmie vráti» mno¾inu

source: subquery has too few columns
sk: poddotaz má príli¹ málo ståpcov

source: unequal number of entries in row expression
sk: nerovnaký poèet záznamov vo výraze riadku

source: operator %s is not supported for row expressions
sk: operátor %s nie je podporovaný pre výrazy riadkov

source: IS DISTINCT FROM requires = operator to yield boolean
sk: klauzula IS DISTINCT FROM po¾aduje, aby operátor = vrátil hodnotu boolean

source: cannot pass more than %d arguments to a function
sk: nie je mo¾né odovzda» viac ne¾ %d argumentov funkcii

source: %s(*) specified, but %s is not an aggregate function
sk: %s(*) bolo urèené, av¹ak %s nie je agregaènou funkciou

source: DISTINCT specified, but %s is not an aggregate function
sk: DISTINCT bolo urèené, av¹ak %s nie je agregaènou funkciou

source: function %s is not unique
sk: funkcia %s nie je jedineèná

source: Could not choose a best candidate function. You may need to add explicit type casts.
sk: Nebolo mo¾né vybra» najviac vyhovujúcu funkciu-kandidáta. Skúste pou¾i» explicitné operátory pretypovania.

source: No function matches the given name and argument types. You may need to add explicit type casts.
sk: Nebolo mo¾né nájs» funkciu s daným názvom a typmi argumentov. Skúste pou¾i» explicitné operátory pretypovania.

source: aggregates may not return sets
sk: agregaèné funkcie nesmú vráti» mno¾inu

source: column %s.%s does not exist
sk: Ståpec %s.%s neexistuje

source: column "%s" not found in data type %s
sk: ståpec "%s" nebolo mo¾né nájs» v dátovom type %s

source: could not identify column "%s" in record data type
sk: nebolo mo¾né identifikova» ståpec "%s" v údajovom type záznam

source: column notation .%s applied to type %s, which is not a composite type
sk: zápis ståpca .%s aplikovaný na typ %s, ktorý nie je zlo¾eným typom

source: aggregate %s(*) does not exist
sk: agregaèná funkcia %s(*) neexistuje

source: aggregate %s(%s) does not exist
sk: agregaèná funkcia %s(%s) neexistuje

source: function %s(%s) is not an aggregate
sk: funkcia %s(%s) nie je agregaèná funkcia

source: cannot subscript type %s because it is not an array
sk: nie je mo¾né pou¾i» operáciu vyhµadania prvku pre typ %s, lebo nie je poµom

source: array subscript must have type integer
sk: èíslo prvku poµa musí by» celé èíslo (integer)

source: array assignment requires type %s but expression is of type %s
sk: priradenie poµa vy¾aduje typ %s, ale výraz je typu %s

source: operator does not exist: %s
sk: operátor neexistuje: %s

source: could not identify an equality operator for type %s
sk: nebolo mo¾né nájs» operátor rovnosti pre typ %s

source: could not identify an ordering operator for type %s
sk: nebolo mo¾né nájs» operátor porovnania pre typ %s

source: Use an explicit ordering operator or modify the query.
sk: Pou¾ite explicitný operátor porovnania alebo zmeòte dotaz.

source: operator requires run-time type coercion: %s
sk: operátor si vy¾aduje pretypovanie poèas behu: %s

source: operator is not unique: %s
sk: operátor nie je jedineèný: %s

source: Could not choose a best candidate operator. You may need to add explicit type casts.
sk: Nebolo mo¾né vybra» najviac vyhovujúceho kandidáta-operátor. Skúste pou¾i» explicitné operátory pretypovania.

source: No operator matches the given name and argument type(s). You may need to add explicit type casts.
sk: Nebolo mo¾né nájs» operátor daného mena a daných typov argumentov. Skúste pou¾i» explicitné operátory pretypovania.

source: op ANY/ALL (array) requires array on right side
sk: operátor ANY/ALL (pole) vy¾aduje pole na pravej strane

source: op ANY/ALL (array) requires operator to yield boolean
sk: operátor ANY/ALL (pole) vy¾aduje, aby operátor vrátil hodnotu boolean

source: op ANY/ALL (array) requires operator not to return a set
sk: operátor ANY/ALL (pole) vy¾aduje, aby operátor nevrátil mno¾inu

source: cannot assign to system column "%s"
sk: nie je mo¾né priradi» hodnotu systémovému ståpcu "%s"

source: cannot set an array element to DEFAULT
sk: nie je mo¾né nastavi» prvok poµa na DEFAULT

source: cannot set a subfield to DEFAULT
sk: nie je mo¾né nastavi» subprvok na DEFAULT

source: column "%s" is of type %s but expression is of type %s
sk: ståpec "%s" je typu %s, av¹ak výraz je typu %s

source: cannot assign to a column of type %s because it is not a composite type
sk: nie je mo¾né vykona» priradenie k ståpcu typu %s, lebo to nie je zlo¾ený typ

source: array assignment to "%s" requires type %s but expression is of type %s
sk: priradenie poµa k "%s" po¾aduje typ %s, ale výraz je typu %s

source: subfield "%s" is of type %s but expression is of type %s
sk: subprvok "%s" je typu %s, ale výraz je typu %s

source: SELECT * with no tables specified is not valid
sk: povel SELECT * bez zadania tabuliek je neplatný

source: improper %%TYPE reference (too few dotted names): %s
sk: nesprávny odkaz %%TYPE (príli¹ málo názvov s bodkami): %s

source: improper %%TYPE reference (too many dotted names): %s
sk: nesprávny odkaz %%TYPE (príli¹ veµa názvov s bodkami): %s

source: type reference %s converted to %s
sk: odkaz na typ %s prevedený na %s

source: type "%s" is only a shell
sk: typ "%s" je iba obal

source: invalid type name "%s"
sk: neplatný názov typu "%s"

source: identifier "%s" will be truncated to "%.*s"
sk: identifikátor "%s" sa ore¾e na "%.*s"

source: unterminated /* comment
sk: neukonèený komentár /*

source: unterminated bit string literal
sk: neukonèený literál bitového re»azca

source: unterminated hexadecimal string literal
sk: neukonèený literál hexadecimálneho re»azca

source: unterminated quoted string
sk: neukonèený re»azec v úvodzovkách

source: unterminated dollar-quoted string
sk: neukonèený re»azec v znakoch dolára

source: zero-length delimited identifier
sk: identifikátor nulovej då¾ky oddelený oddeµovaèmi

source: unterminated quoted identifier
sk: neukonèený identifikátor v úvodzovkách

source: %s at end of input
sk: %s na konci vstupu

source: %s at or near "%s"
sk: %s pri alebo v blízkosti "%s"

source: syntax error: cannot back up
sk: syntaktická chyba: nie je mo¾né vytvori» zálohu

source: time zone interval must be HOUR or HOUR TO MINUTE
sk: interval èasovej zóny musí by» HOUR alebo HOUR TO MINUTE

source: INTERVAL(%d) precision must not be negative
sk: presnos» INTERVAL(%d) musí by» kladné èíslo

source: INTERVAL(%d) precision reduced to maximum allowed, %d
sk: presnos» INTERVAL(%d) zní¾ená na maximálne povolenú hodnotu, %d

source: MATCH PARTIAL not yet implemented
sk: MATCH PARTIAL e¹te nie je implementovaný

source: CREATE TABLE AS may not specify INTO
sk: povel CREATE TABLE AS nesmie pou¾i» klauzulu INTO

source: CREATE ASSERTION is not yet implemented
sk: CREATE ASSERTION nie je implementované

source: DROP ASSERTION is not yet implemented
sk: DROP ASSERTION nie je implementované

source: CREATE FUNCTION / OUT parameters are not implemented
sk: CREATE FUNCTION / OUT parametre nie sú implementované

source: CREATE FUNCTION / INOUT parameters are not implemented
sk: CREATE FUNCTION / INOUT parametre nie sú implementované

source: missing argument
sk: chýbajúci argument

source: Use NONE to denote the missing argument of a unary operator.
sk: Pou¾ite NONE pre oznaèenie chýbajúceho argumentu unárneho operátora.

source: column name list not allowed in CREATE TABLE / AS EXECUTE
sk: pou¾itie zoznamu názvov ståpcov nie je povolené v povele CREATE TABLE / AS EXECUTE

source: LIMIT #,# syntax is not supported
sk: syntax LIMIT #,# nie je podporovaná

source: Use separate LIMIT and OFFSET clauses.
sk: Pou¾ite samostatné klauzuly LIMIT a OFFSET.

source: For example, FROM (SELECT ...) [AS] foo.
sk: Napríklad FROM (SELECT ...) [AS] blabla.

source: precision for type float must be at least 1 bit
sk: presnos» pre typ float musí by» aspoò 1 bit

source: precision for type float must be less than 54 bits
sk: presnos» pre typ float smie by» nanajvý¹ 54 bitov

source: NUMERIC precision %d must be between 1 and %d
sk: presnos» NUMERIC %d musí by» medzi 1 a %d

source: NUMERIC scale %d must be between 0 and precision %d
sk: ¹kála NUMERIC %d musí by» medzi 0 a presnos»ou %d

source: DECIMAL precision %d must be between 1 and %d
sk: presnos» DECIMAL %d musí by» medzi 1 a %d

source: DECIMAL scale %d must be between 0 and precision %d
sk: ¹kála DECIMAL %d musí by» medzi 0 a presnos»ou %d

source: length for type %s must be at least 1
sk: Då¾ka typu %s musí by» aspoò 1

source: length for type %s cannot exceed %d
sk: då¾ka typu %s nesmie prekroèi» %d

source: TIMESTAMP(%d)%s precision must not be negative
sk: presnos» TIMESTAMP (%d)%s nesmie by» záporná

source: TIMESTAMP(%d)%s precision reduced to maximum allowed, %d
sk: presnos» TIMESTAMP(%d)%s zní¾ená na maximálne povolenú hodnotu, %d

source: TIME(%d)%s precision must not be negative
sk: presnos» TIME(%d)%s nesmie by» záporná

source: TIME(%d)%s precision reduced to maximum allowed, %d
sk: presnos» TIME(%d)%s zní¾ená na maximálne povolenú hodnotu, %d

source: UNIQUE predicate is not yet implemented
sk: UNIQUE predikát e¹te nie je implementovaný

source: CURRENT_TIME(%d) precision must not be negative
sk: presnos» CURRENT_TIME(%d) nesmie by» záporná

source: CURRENT_TIME(%d) precision reduced to maximum allowed, %d
sk: presnos» CURRENT_TIME(%d) zní¾ená na maximálne povolenú hodnotu, %d

source: CURRENT_TIMESTAMP(%d) precision must not be negative
sk: presnos» CURRENT_TIMESTAMP(%d) nesmie by» záporná

source: CURRENT_TIMESTAMP(%d) precision reduced to maximum allowed, %d
sk: presnos» CURRENT_TIMESTAMP(%d) zní¾ená na maximálne povolenú hodnotu, %d

source: LOCALTIME(%d) precision must not be negative
sk: presnos» LOCALTIME(%d) nesmie by» záporná

source: LOCALTIME(%d) precision reduced to maximum allowed, %d
sk: presnos» LOCALTIME(%d) zní¾ená na maximálne povolenú hodnotu, %d

source: LOCALTIMESTAMP(%d) precision must not be negative
sk: presnos» LOCALTIMESTAMP(%d) nesmie by» záporná

source: LOCALTIMESTAMP(%d) precision reduced to maximum allowed, %d
sk: presnos» LOCALTIMESTAMP(%d) zní¾ená na maximálne povolenú hodnotu, %d

source: OLD used in query that is not in a rule
sk: OLD sa pou¾íva v dotaze, ktorý nie je v pravidle

source: NEW used in query that is not in a rule
sk: NEW sa pou¾íva v dotaze, ktorý nie je v pravidle

source: syntax error; also virtual memory exhausted
sk: syntaktická chyba; aj virtuálna pamä» je vyèerpaná

source: syntax error
sk: syntaktická chyba

source: parser stack overflow
sk: preteèenie zásobníka syntaktického analyzátora

source: wrong number of parameters on left side of OVERLAPS expression
sk: nesprávny poèet parametrov na µavej strane výrazu OVERLAPS

source: wrong number of parameters on right side of OVERLAPS expression
sk: nesprávny poèet parametrov na pravej strane výrazu OVERLAPS

source: multiple ORDER BY clauses not allowed
sk: nie je povolené ma» viacero klauzúl ORDER BY

source: multiple FOR UPDATE clauses not allowed
sk: nie je povolené ma» viacero klauzúl FOR UPDATE

source: multiple OFFSET clauses not allowed
sk: nie je povolené ma» viacero klauzúl OFFSET

source: multiple LIMIT clauses not allowed
sk: nie je povolené ma» viacero klauzúl LIMIT

source: failed to create signal listener pipe: %d. Retrying.
sk: neúspe¹né vytvorenie rúry pre oèakávanie signálov: %d. Opakujem pokus.

source: failed to create signal dispatch thread: %d
sk: nebolo mo¾né vytvori» dispeèerské vlákno signálov: %d

source: failed to open process token: %d
sk: nepodarilo sa otvori» token procesu: %d

source: failed to get token information: %d
sk: nepodarilo sa získa» informácie o tokene: %d

source: failed to get SID for Administrators group: %d
sk: nepodarilo sa získa» SID pre skupinu administrátorov (Administrators): %d

source: failed to get SID for PowerUsers group: %d
sk: nepodarilo sa získa» SID pre skupinu PowerUsers: %d

source: could not create semaphores: %m
sk: nebolo mo¾né vytvori» semafory: %m

source: Failed system call was semget(%lu, %d, 0%o).
sk: Neúspe¹ným systémovým volaním bolo semget(%lu, %d, 0%o).

source: This error does *not* mean that you have run out of disk space. It occurs when either the system limit for the maximum number of semaphore sets (SEMMNI), or the system wide maximum number of semaphores (SEMMNS), would be exceeded. You need to raise the respective kernel parameter. Alternatively, reduce PostgreSQL's consumption of semaphores by reducing its max_connections parameter (currently %d). The PostgreSQL documentation contains more information about configuring your system for PostgreSQL.
sk: Táto chyba *neznamená*, ¾e máte nedostatok diskového priestoru. Nastáva vtedy, keï sa prekroèí systémové ohranièenie maximálneho poètu mno¾ín semaforov (SEMMNI) alebo celosystémový poèet semaforov (SEMMNS). Zvý¹te príslu¹ný parameter jadra operaèného systému, alebo zní¾te spotrebu semaforov v PostgreSQL zní¾ením parametra max_connections (aktuálna hodnota: %d). Dokumentácia PostgreSQL obsahuje detailnej¹ie informácie o konfigurácii systému pre pou¾itie s PostgreSQL.

source: You possibly need to raise your kernel's SEMVMX value to be at least %d. Look into the PostgreSQL documentation for details.
sk: Pravdepodobne potrebujete zvý¹i» hodnotu SEMVMX jadra operaèného systému aspoò na %d. Detaily sú uvedené v dokumentácii PostgreSQL.

source: could not create shared memory segment: %m
sk: nebolo mo¾né vytvori» segment zdieµanej pamäte: %m

source: Failed system call was shmget(key=%lu, size=%u, 0%o).
sk: Neúspe¹ným systémovým volaním bolo shmget(kµúè=%lu, veµkos»=%u, 0%o).

source: This error usually means that PostgreSQL's request for a shared memory segment exceeded your kernel's SHMMAX parameter. You can either reduce the request size or reconfigure the kernel with larger SHMMAX. To reduce the request size (currently %u bytes), reduce PostgreSQL's shared_buffers parameter (currently %d) and/or its max_connections parameter (currently %d). If the request size is already small, it's possible that it is less than your kernel's SHMMIN parameter, in which case raising the request size or reconfiguring SHMMIN is called for. The PostgreSQL documentation contains more information about shared memory configuration.
sk: Táto chyba väè¹inou znamená, ¾e potreba systému PostgreSQL zdieµaných pamä»ových segmentov prekroèila parameter SHMMAX jadra operaèného systému. Mô¾ete buï zní¾i» spotrebu alebo prekonfigurova» jadro s väè¹ím SHMMAX. Pre zní¾enie spotreby (momentálne %u bajtov), zní¾te hodnotu parametra shared_buffers (momentálne %d) systému PostgreSQL a/alebo hodnotu parametra max_connections (momentálne %d). Ak je spotreba malá, je mo¾né, ¾e je men¹ia ako parameter SHMMIN jadra. V tomto prípade zvý¹te spotrebu alebo prekonfigurujte jadro s iným SHMMIN. Dokumentácia PostgreSQL obsahuje detailnej¹ie informácie o konfigurácii zdieµanej pamäte.

source: This error usually means that PostgreSQL's request for a shared memory segment exceeded available memory or swap space. To reduce the request size (currently %u bytes), reduce PostgreSQL's shared_buffers parameter (currently %d) and/or its max_connections parameter (currently %d). The PostgreSQL documentation contains more information about shared memory configuration.
sk: Táto chyba väè¹inou znamená, ¾e potreba systému PostgreSQL zdieµaných pamä»ových segmentov prekroèila mno¾stvo dostupnej pamäte alebo swap priestoru. Pre zní¾enie spotreby (momentálne %u bajtov), zní¾te hodnotu parametra shared_buffers (momentálne %d) systému PostgreSQL a/alebo hodnotu parametra max_connections (momentálne %d). Dokumentácia PostgreSQL obsahuje detailnej¹ie informácie o konfigurácii zdieµanej pamäte.

source: This error does *not* mean that you have run out of disk space. It occurs either if all available shared memory IDs have been taken, in which case you need to raise the SHMMNI parameter in your kernel, or because the system's overall limit for shared memory has been reached. If you cannot increase the shared memory limit, reduce PostgreSQL's shared memory request (currently %u bytes), by reducing its shared_buffers parameter (currently %d) and/or its max_connections parameter (currently %d). The PostgreSQL documentation contains more information about shared memory configuration.
sk: Táto chyba *neznamená*, ¾e máte nedostatok diskového priestoru. Nastáva vtedy, keï u¾ v¹etky ID èísla zdieµanej pamäte sú vydané. V takom prípade potrebujete zvý¹i» parameter SHMMNI jadra operaèného systému. Mô¾e to nasta» aj vtedy, ak bol prekroèený celkový limit systému pre zdieµanú pamä». Ak nemô¾ete zvý¹i» limit zdieµanej pamäte, zní¾te spotrebu zdieµanej pamäte PostgreSQL (momentálne %u bajtov), zní¾te hodnotu parametra shared_buffers (momentálne %d) systému PostgreSQL a/alebo hodnotu parametra max_connections (momentálne %d). Dokumentácia PostgreSQL obsahuje detailnej¹ie informácie o konfigurácii zdieµanej pamäte.

source: %s: assert checking is not compiled in
sk: %s: kontrola asercií nie je prelo¾ená do kódu

source: Try "%s --help" for more information.
sk: Zadajte '%s --help' pre detailnej¹ie informácie.

source: %s: invalid argument: "%s"
sk: %s: neplatný argument: "%s"

source: %s does not know where to find the database system data. This should be specified as "pgdata" in %s%s.
sk: %s nevie, kde nájs» systémové dáta databázy. Mali by ste to urèi» ako "pgdata" v %s%s.

source: %s could not write to external pid file %s
sk: %s: nebolo mo¾né zapisova» do externého súboru pid: %s

source: %s: the number of buffers (-B) must be at least twice the number of allowed connections (-N) and at least 16
sk: %s: poèet bufrov (-B) musí by» aspoò dvakrát taký veµký ako poèet povolených spojení (-N) a minimálne 16

source: %s: superuser_reserved_connections must be less than max_connections
sk: %s: hodnota superuser_reserved_connections (spojenia rezervované pre superu¾ívateµa) musí by» men¹ia ako max_connections (maximálny poèet spojení)

source: %s: invalid datetoken tables, please fix
sk: %s: neplatné tabuµky tokenov dátumov, prosím napravte ich

source: %s: could not locate matching postgres executable
sk: %s: nebolo mo¾né nájs» vhodný spustiteµný súbor postgres

source: could not create listen socket for "%s"
sk: nebolo mo¾né vytvori» vstupný soket pre "%s"

source: could not create Unix-domain socket
sk: nebolo mo¾né vytvori» soket unixových domén

source: no socket created for listening
sk: ¾iaden vstupný soket nebol vytvorený

source: %s does not know where to find the database system data. You must specify the directory that contains the database system or configuration files by either specifying the -D invocation option or by setting the PGDATA environment variable.
sk: %s nedoká¾e urèi», kde hµada» systémové údaje databázy. Musíte zada» adresár, ktorý obsahuje databázový systém a to buï pou¾itím voµby -D pri spustení alebo nastavením premennej prostredia PGDATA.

source: data or configuration location "%s" does not exist
sk: umiestnenie dát alebo konfigurácie "%s" neexistuje

source: could not read permissions of "%s": %m
sk: nebolo mo¾né èíta» prístupové práva pre "%s": %m

source: data directory "%s" has group or world access
sk: dátový adresár "%s" má nastavené prístupové práva pre skupinu alebo svet

source: Permissions should be u=rwx (0700).
sk: Prístupové práva majú by» u=rwx (0700).

source: %s: could not find the database system Expected to find it in the directory "%s", but could not open file "%s": %s
sk: %s nebolo mo¾né nájs» databázový systém Oèakávané bolo umiestnenie v adresári "%s", nebolo v¹ak mo¾né otvori» súbor "%s": %s

source: %s: could not fork background process: %s
sk: %s: nebolo mo¾né vetvi» (fork) proces pozadia: %s

source: %s: could not dissociate from controlling TTY: %s
sk: %s: nebolo mo¾né zru¹i» zdru¾enie s riadiacim TTY: %s

source: %s is the PostgreSQL server.
sk: %s je server PostgreSQL.

source: Usage: %s [OPTION]...
sk: Pou¾itie: %s [VO¥BA]...

source: Options:
sk: Voµby:

source: -A 1|0 enable/disable run-time assert checking
sk: -A 1|0 zapni/vypni kontrolu asercií poèas behu

source: -B NBUFFERS number of shared buffers
sk: -B BUFFRE poèet zdieµaných buffrov

source: -c NAME=VALUE set run-time parameter
sk: -c NÁZOV=HODNOTA nastav parameter behu programu

source: -d 1-5 debugging level
sk: -d 1-5 úroveò ladenia

source: -D DATADIR database directory
sk: -D ADRESÁR adresár databázy

source: -F turn fsync off
sk: -F vypni pou¾itie operácie fsync

source: -h HOSTNAME host name or IP address to listen on
sk: -h POÈÍTAÈ názov poèítaèa alebo IP adresa, na ktorej sa má oèakáva» vstup

source: -i enable TCP/IP connections
sk: -i povoli» spojenia TCP/IP

source: -k DIRECTORY Unix-domain socket location
sk: -k ADRESÁR umiestnenie soketov unixových domén

source: -l enable SSL connections
sk: -l povoli» spojenia SSL

source: -N MAX-CONNECT maximum number of allowed connections
sk: -N MAX-SPOJENIA maximálny poèet povolených spojení

source: -o OPTIONS pass "OPTIONS" to each server process
sk: -o VO¥BY odovzda» "VO¥BY" ka¾dému procesu servera

source: -p PORT port number to listen on
sk: -p PORT èíslo portu, na ktorý sa má systém napoji»

source: -S silent mode (start in background without logging output)
sk: -S tichý re¾im (spusti» na pozadí bez výstupu do logu)

source: --help show this help, then exit
sk: --help zobrazi» túto nápovedu, potom ukonèi» èinnos»

source: --version output version information, then exit
sk: --version zobrazi» informácie o verzii, potom koniec

source: Developer options:
sk: voµby pre vývojárov:

source: -n do not reinitialize shared memory after abnormal exit
sk: -n nevykonaj opätovnú inicializáciu zdieµanej pamäti po ukonèení èinnosti

source: -s send SIGSTOP to all backend servers if one dies
sk: -s po¹li SIGSTOP v¹etkým serverom na pozadí, ak jeden odumrie

source: Please read the documentation for the complete list of run-time configuration settings and how to set them on the command line or in the configuration file. Report bugs to <pgsql-bugs@postgresql.org>.
sk: Prosím, preèítajte si dokumentáciu pre prehµad úplného zoznamu konfiguraèných nastavení a ako je mo¾né ich nastavi» cez povelový riadok alebo v konfiguraènom súbore. Chyby hláste na adresu <pgsql-bugs@postgresql.org>

source: select() failed in postmaster: %m
sk: povel select() neúspe¹ný v programe postmaster: %m

source: incomplete startup packet
sk: neúplný paket spustenia

source: invalid length of startup packet
sk: neplatná då¾ka paketu spustenia

source: failed to send SSL negotiation response: %m
sk: nebolo mo¾né posla» odpoveï rokovania SSL:%m

source: unsupported frontend protocol %u.%u: server supports %u.0 to %u.%u
sk: neznámy protokol frontendu %u.%u: server podporuje %u.0 a¾ %u.%u

source: invalid startup packet layout: expected terminator as last byte
sk: neplatné rozlo¾enie paketu spustenia: oèakáva sa terminátor ako posledný bajt

source: no PostgreSQL user name specified in startup packet
sk: v pakete spustenia nebolo urèené meno u¾ívateµa PostgreSQL

source: the database system is starting up
sk: databázový systém sa spú¹»a

source: the database system is shutting down
sk: databázový systém sa vypína

source: the database system is in recovery mode
sk: databázový systém je v re¾ime obnovy

source: sorry, too many clients already
sk: je mi µúto, je u¾ príli¹ veµa klientov

source: received SIGHUP, reloading configuration files
sk: bol prijatý signál SIGHUP, prebieha opätovné naèítanie konfiguraèných súborov

source: received smart shutdown request
sk: bola prijatá po¾iadavka pre múdre zastavenie

source: received fast shutdown request
sk: bola prijatá po¾iadavka pre rýchle zastavenie

source: aborting any active transactions
sk: ukonèujú sa v¹etky aktívne transakcie
