Repository: IITDBGroup/perm
Catalog: src/backend/po/*.po
Languages: sk

source: multiple SET TABLESPACE subcommands are not valid
sk: viacero podpovelov SET TABLESPACE je neplatných

source: cannot move system relation "%s"
sk: nie je mo¾né presunú» systémovú reláciu "%s"

source: cannot move temporary tables of other sessions
sk: nie je mo¾né presunú» doèasné tabuµky iných sedení

source: shared tables cannot be toasted after initdb
sk: na zdieµané tabuµky nie je mo¾né aplikova» operáciu toast po povele initdb

source: table "%s" already has a TOAST table
sk: tabuµka "%s" u¾ má tabuµku TOAST

source: table "%s" does not need a TOAST table
sk: tabuµka "%s" nevy¾aduje tabuµku TOAST

source: could not determine referenced table for constraint "%s"
sk: nebolo mo¾né urèi» odkazovanú tabuµku v prípade obmedzenia "%s"

source: multiple INSERT events specified
sk: bolo urèených viacero udalostí INSERT

source: multiple DELETE events specified
sk: bolo urèených viacero udalostí DELETE

source: multiple UPDATE events specified
sk: bolo urèených viacero udalostí UPDATE

source: trigger "%s" for relation "%s" already exists
sk: trigger "%s" definovaný pre reláciu "%s" u¾ existuje

source: changing return type of function %s from "opaque" to "trigger"
sk: zmena návratového typu funkcie %s z "opaque" na "trigger"

source: function %s must return type "trigger"
sk: funkcia %s musí vráti» typ "trigger"

source: trigger function %u returned null value
sk: funkcia %u triggra vrátila hodnotu null

source: BEFORE STATEMENT trigger cannot return a value
sk: trigger typu BEFORE STATEMENT nemô¾e vráti» hodnotu

source: could not serialize access due to concurrent update
sk: nebolo mo¾né serializova» prístup z dôvodu súbe¾nej aktualizácie

source: unnamed constraints cannot be set explicitly
sk: nepomenované obmedzenia nie je mo¾né explicitne nastavi»

source: constraint "%s" is not deferrable
sk: obmedzenie "%s" nie odkloniteµné (deferrable)

source: type names must be %d characters or less
sk: názvy typov mô¾u ma» då¾ku %d znakov alebo menej

source: array element type cannot be %s
sk: typ prvku poµa nemô¾e by» %s

source: alignment "%s" not recognized
sk: zarovnanie "%s" nebolo rozpoznané

source: storage "%s" not recognized
sk: spôsob ukladania "%s" nebol rozpoznaný

source: type attribute "%s" not recognized
sk: atribút typu "%s" nebol rozpoznaný

source: type input function must be specified
sk: musíte urèi» vstupnú funkciu typu

source: type output function must be specified
sk: musíte urèi» výstupnú funkciu typu

source: changing return type of function %s from "opaque" to %s
sk: zmena návratového typu funkcie %s z "opaque" na %s

source: type input function %s must return type %s
sk: vstupná funkcia typu %s musí vráti» typ %s

source: changing return type of function %s from "opaque" to "cstring"
sk: zmena návratového typu funkcie %s z "opaque" na "cstring"

source: type output function %s must return type "cstring"
sk: výstupná funkcia typu %s musí vráti» typ "cstring"

source: type receive function %s must return type %s
sk: prijímajúca funkcia typu %s musí vráti» typ %s

source: type send function %s must return type "bytea"
sk: vysielajúca funkcia typu %s musí vráti» typ "bytea"

source: domain names must be %d characters or less
sk: názvy domén musia ma» då¾ku %d znakov alebo menej

source: "%s" is not a valid base type for a domain
sk: "%s" nie je platným základným typom domény

source: foreign key constraints not possible for domains
sk: obmedzenia cudzích kµúèov nie sú povolené pre domény

source: multiple default expressions
sk: viaceré implicitné výrazy

source: conflicting NULL/NOT NULL constraints
sk: konflikt medzi obmedzeniami NULL/NOT NULL

source: unique constraints not possible for domains
sk: obmedzenie jedineènosti nie je povolené pre domény

source: primary key constraints not possible for domains
sk: obmedzenie primárneho kµúèa nie je povolené pre domény

source: specifying constraint deferrability not supported for domains
sk: urèenie odkloniteµnosti obmedzení nie je podporované v prípade domén

source: "%s" is not a domain
sk: "%s" nie je doména

source: changing argument type of function %s from "opaque" to "cstring"
sk: zmena typu argumentu funkcie %s z "opaque" na "cstring"

source: changing argument type of function %s from "opaque" to %s
sk: zmena typu argumentu funkcie %s z "opaque" na %s

source: type analyze function %s must return type "boolean"
sk: funkcia analýzy typu %s musí vráti» typ "boolean"

source: composite type must have at least one attribute
sk: zlo¾ený typ musí ma» aspoò jeden atribút

source: column "%s" of table "%s" contains null values
sk: ståpec "%s" tabuµky "%s" obsahuje hodnoty null

source: column "%s" of table "%s" contains values that violate the new constraint
sk: ståpec "%s" tabuµky "%s" obsahuje hodnoty, ktoré poru¹ujú nové obmedzenie

source: constraint "%s" for domain "%s" already exists
sk: obmedzenie "%s" domény "%s" u¾ existuje

source: cannot use table references in domain check constraint
sk: nie je mo¾né pou¾i» odkazy na tabuµky v obmedzení kontroly domény

source: cannot use aggregate in check constraint
sk: nie je mo¾né pou¾i» agregaènú funkciu v kontrolnom obmedzení

source: "%s" is a table's row type
sk: "%s" je typ riadku tabuµky

source: could not write to temporary file "%s": %m
sk: nebolo mo¾né zapisova» do doèasného súboru "%s": %m

source: invalid group name "%s"
sk: neplatný názov skupiny "%s"

source: invalid user name "%s"
sk: neplatné meno u¾ívateµa "%s"

source: invalid user password "%s"
sk: neplatné heslo u¾ívateµa "%s"

source: user ID must be positive
sk: ID u¾ívateµa musí by» kladné èíslo

source: must be superuser to create users
sk: pre vytvorenie iného u¾ívateµa musíte by» superu¾ívateµom

source: user name "%s" is reserved
sk: meno u¾ívateµa "%s" je rezervované

source: user "%s" already exists
sk: u¾ívateµ "%s" u¾ existuje

source: user ID %d is already assigned
sk: ID u¾ívateµa %d je u¾ vydané

source: user "%s" does not exist
sk: u¾ívateµ "%s" neexistuje

source: must be superuser to drop users
sk: musíte by» superu¾ívateµom pre vymazanie u¾ívateµov

source: current user cannot be dropped
sk: aktuálny u¾ívateµ nemô¾e by» zru¹ený

source: session user cannot be dropped
sk: u¾ívateµa sedenia nie je mo¾né zru¹i»

source: user "%s" cannot be dropped
sk: u¾ívateµa "%s" nie je mo¾né zru¹i»

source: The user owns database "%s".
sk: U¾ívateµ vlastní databázu "%s".

source: session user may not be renamed
sk: u¾ívateµa sedenia nie je mo¾né premenova»

source: must be superuser to rename users
sk: pre premenovanie u¾ívateµov musíte by» superu¾ívateµom

source: MD5 password cleared because of user rename
sk: Heslo MD5 vymazané z dôvodu premenovania u¾ívateµa

source: before using passwords you must revoke privileges on %s
sk: pred pou¾itím hesiel musíte zru¹i» právomoci na %s

source: This restriction is to prevent unprivileged users from reading the passwords.
sk: Toto obmedzenie bráni neprivilegovaným u¾ívateµom v èítaní hesiel.

source: Try REVOKE ALL ON "%s" FROM PUBLIC.
sk: Skúste povel REVOKE ALL ON "%s" FROM PUBLIC.

source: group ID must be positive
sk: ID skupiny musí by» kladné èíslo

source: must be superuser to create groups
sk: pre vytvorenie skupín musíte by» superu¾ívateµom

source: group name "%s" is reserved
sk: názov skupiny "%s" je rezervovaný

source: group "%s" already exists
sk: skupina "%s" u¾ existuje

source: group ID %d is already assigned
sk: ID skupiny %d sa u¾ pou¾íva

source: must be superuser to alter groups
sk: pre zmenu skupiny musíte by» superu¾ívateµom

source: group "%s" does not have any members
sk: skupina "%s" nemá ¾iadnych èlenov

source: user "%s" is not in group "%s"
sk: u¾ívateµ "%s" nie je v skupine "%s"

source: must be superuser to drop groups
sk: pre zru¹enie skupín musíte by» superu¾ívateµom

source: must be superuser to rename groups
sk: pre premenovanie skupín musíte by» superu¾ívateµom

source: oldest xmin is far in the past
sk: najstar¹ia hodnota xmin je u¾ dávno minulos»ou

source: Close open transactions soon to avoid wraparound problems.
sk: Rýchlo uzavrite otvorené transakcie, aby ste predi¹li problémom preteèenia.

source: some databases have not been vacuumed in over 2 billion transactions
sk: niektoré databázy neboli povysávané po dosiahnutí 2 miliárd transakcií

source: You may have already suffered transaction-wraparound data loss.
sk: U¾ ste pravdepodobne utrpeli stratu dát pre preteèenie èísel transakcií.

source: some databases have not been vacuumed in over 1 billion transactions
sk: niektoré databázy neboli povysávané po dosiahnutí 1 miliárd transakcií

source: Better vacuum them soon, or you may have a wraparound failure.
sk: Rýchlo ich povysávajte, aby ste predi¹li problémom preteèenia.

source: some databases have not been vacuumed in %d transactions
sk: niektoré databázy neboli povysávané po dosiahnutí %d transakcií

source: Better vacuum them within %d transactions, or you may have a wraparound failure.
sk: Povysávajte ich do %d transakcií, aby ste predi¹li problémom preteèenia.

source: skipping "%s" --- only table or database owner can vacuum it
sk: vynecháva sa "%s" --- iba majiteµ tabuµky alebo databázy ju mô¾e povysáva»

source: skipping "%s" --- cannot vacuum indexes, views, or special system tables
sk: vynecháva sa "%s" --- nie je mo¾né povysáva» indexy, pohµady alebo ¹peciálne systémové tabuµky

source: vacuuming "%s.%s"
sk: vysáva sa "%s.%s"

source: relation "%s" page %u is uninitialized --- fixing
sk: relácia "%s", stránka %u nebola inicializovaná --- vykonáva sa oprava

source: relation "%s" TID %u/%u: InsertTransactionInProgress %u --- can't shrink relation
sk: relácia "%s" TID %u/%u: InsertTransactionInProgress %u --- nie je mo¾né zmr¹ti» reláciu

source: relation "%s" TID %u/%u: DeleteTransactionInProgress %u --- can't shrink relation
sk: relácia "%s" TID %u/%u: DeleteTransactionInProgress %u --- nie je mo¾né zmr¹ti» reláciu

source: "%s": found %.0f removable, %.0f nonremovable row versions in %u pages
sk: "%s": nájdených %.0f odstrániteµných, %.0f neodstrániteµných verzií riadkov na %u stránkach

source: %.0f dead row versions cannot be removed yet. Nonremovable row versions range from %lu to %lu bytes long. There were %.0f unused item pointers. Total free space (including removable row versions) is %.0f bytes. %u pages are or will become empty, including %u at the end of the table. %u pages containing %.0f free bytes are potential move destinations. %s
sk: %.0f màtvych verzií riadkov e¹te nie je mo¾né odstráni». Neodstrániteµné verzie riadkov majú %lu a¾ %lu bajtov. Na¹lo sa %.0f nepou¾itých smerníkov na polo¾ky. Celkový voµný priestor (vrátane odstrániteµných verzií riadkov) je %.0f bajtov. %u stránok je alebo bude vyprázdnených, vrátane %u na konci tabuµky. %u stránok obsahujúcich %.0f voµných bajtov je potenciálnym cieµom presunu. %s

source: "%s": moved %u row versions, truncated %u to %u pages
sk: "%s": presunutých %u verzií riadkov, orezaných %u na %u stránok

source: "%s": truncated %u to %u pages
sk: "%s": orezaných %u na %u stránok

source: index "%s" now contains %.0f row versions in %u pages
sk: index "%s" teraz obsahuje %.0f verzií riadkov na %u stránkach

source: %u index pages have been deleted, %u are currently reusable. %s
sk: %u stránok indexu bolo vymazaných, %u je mo¾né aktuálne opätovne pou¾i». %s

source: index "%s" contains %.0f row versions, but table contains %.0f row versions
sk: index "%s" obsahuje %.0f verzií riadkov, av¹ak tabuµka obsahuje %.0f verzií riadkov

source: Rebuild the index with REINDEX.
sk: Pretvorte index pou¾itím povelu REINDEX

source: %.0f index row versions were removed. %u index pages have been deleted, %u are currently reusable. %s
sk: %.0f verzií indexových riadkov bolo odstránených. %u indexových stránok bolo vymazaných, %u je momentálne pou¾iteµných. %s

source: %.0f dead row versions cannot be removed yet. There were %.0f unused item pointers. %u pages are entirely empty. %s
sk: %.0f màtvych verzií riadkov e¹te nie je mo¾né odstráni». Na¹lo sa %.0f nepou¾itých smerníkov na polo¾ky. %u stránok je úplne prázdnych. %s

source: "%s": removed %d row versions in %d pages
sk: "%s": bolo odstránených %d verzií riadkov na %d stránkach

source: invalid list syntax for parameter "datestyle"
sk: neplatná syntax zoznamu pre parameter "datestyle" (¹týl dátumu)

source: unrecognized "datestyle" key word: "%s"
sk: neznáme kµúèové slovo "datestyle" (¹týl dátumu): "%s"

source: conflicting "datestyle" specifications
sk: protichodné ¹pecifikácie "datestyle" (¹týl dátumu)

source: invalid interval value for time zone: month not allowed
sk: neplatná hodnota intervalu èasovej zóny: mesiace nie sú povolené

source: unrecognized time zone name: "%s"
sk: neznámy názov èasovej zóny: "%s"

source: time zone "%s" appears to use leap seconds
sk: èasová zóna "%s" zjavne pou¾íva prechodné sekundy

source: PostgreSQL does not support leap seconds.
sk: PostgreSQL nepodporuje prechodné sekundy.

source: SET TRANSACTION ISOLATION LEVEL must be called before any query
sk: pred ka¾dým dotazom treba pou¾i» povel SET TRANSACTION ISOLATION LEVEL

source: SET TRANSACTION ISOLATION LEVEL must not be called in a subtransaction
sk: povel SET TRANSACTION ISOLATION LEVEL nesmie by» pou¾itý v subtransakcii

source: conversion between %s and %s is not supported
sk: konverzia medzi %s a %s sa nepodporuje

source: view must have at least one column
sk: pohµad musí ma» aspoò jeden ståpec

source: cannot change number of columns in view
sk: nie je mo¾né zmeni» poèet ståpcov pohµadu

source: cannot change name of view column "%s"
sk: nie je mo¾né zmeni» názov ståpca pohµadu "%s"

source: cannot change data type of view column "%s"
sk: nie je mo¾né zmeni» údajový typ ståpca pohµadu "%s"

source: could not create directory "%s": %m
sk: nebolo mo¾né vytvori» adresár "%s": %m

source: could not stat directory "%s": %m
sk: nebolo mo¾né pou¾i» povel stat v adresári "%s": %m

source: "%s" exists but is not a directory
sk: "%s" existuje ale nie je adresárom

source: permission denied to create tablespace "%s"
sk: prístup odmietnutý pre vytvorenie tabuµkového priestoru "%s"

source: Must be superuser to create a tablespace.
sk: Pre vytvorenie tabuµkového priestoru musíte by» superu¾ívateµom.

source: tablespace location may not contain single quotes
sk: umiestnenie tabuµkového priestoru nemô¾e obsahova» apostrofy

source: tablespace location must be an absolute path
sk: umiestnenie tabuµkového priestoru musí by» absolútna cesta

source: tablespace location "%s" is too long
sk: re»azec umiestnenia tabuµkového priestoru "%s" je príli¹ dlhý

source: unacceptable tablespace name "%s"
sk: neprijateµný názov tabuµkového priestoru "%s"

source: The prefix "pg_" is reserved for system tablespaces.
sk: Predpona "pg_" je rezervovaná pre systémové tabuµkové priestory.

source: tablespace "%s" already exists
sk: tabuµkový priestor "%s" u¾ existuje

source: could not set permissions on directory "%s": %m
sk: nebolo mo¾né nastavi» prístupové práva pre adresár "%s": %m

source: directory "%s" is not empty
sk: adresár "%s" nie je prázdny

source: could not create symbolic link "%s": %m
sk: nebolo mo¾né vytvori» symbolický odkaz "%s": %m

source: tablespaces are not supported on this platform
sk: tabuµkové priestory nie sú na tejto platforme podporované

source: tablespace "%s" is not empty
sk: tabuµkový priestor "%s" nie je prázdny

source: could not delete directory "%s": %m
sk: nebolo mo¾né vymaza» adresár "%s": %m

source: could not unlink file "%s": %m
sk: nebolo mo¾né zru¹i» prepojenie súboru "%s": %m

source: could not unlink symbolic link "%s": %m
sk: nebolo mo¾né zru¹i» symbolické prepojenie "%s": %m

source: cannot change sequence "%s"
sk: nebolo mo¾né zmeni» sekvenciu "%s"

source: cannot change TOAST relation "%s"
sk: nebolo mo¾né zmeni» reláciu TOAST "%s"

source: cannot change view "%s"
sk: nebolo mo¾né zmeni» pohµad "%s"

source: null value in column "%s" violates not-null constraint
sk: hodnota null v ståpci "%s" poru¹uje obmedzenie pre nie null hodnoty

source: new row for relation "%s" violates check constraint "%s"
sk: nový riadok v relácii "%s" poru¹uje kontrolné obmedzenie "%s"

source: number of array dimensions (%d) exceeds the maximum allowed (%d)
sk: poèet rozmerov poµa (%d) prekraèuje maximálnu povolenú hodnotu (%d)

source: functions and operators can take at most one set argument
sk: funkcie a operátory mô¾u ma» maximálne jeden mno¾inový argument

source: set-valued function called in context that cannot accept a set
sk: do¹lo k volaniu funkcie mno¾inových hodnôt v kontexte, ktorý neprijíma mno¾iny

source: function returning row cannot return null value
sk: funkcia vracajúca riadok nemô¾e vráti» hodnotu null

source: table-function protocol for materialize mode was not followed
sk: do¹lo k poru¹eniu protokolu tabuµkových funkcií pre re¾im materializácie

source: unrecognized table-function returnMode: %d
sk: neznáma hodnota returnMode tabuµkovej funkcie: %d

source: IS DISTINCT FROM does not support set arguments
sk: klauzula IS DISTINCT FROM nepodporuje mno¾inové argumenty

source: op ANY/ALL (array) does not support set arguments
sk: operácia ANY/ALL (pole) nepodporuje mno¾inové argumenty

source: cannot merge incompatible arrays
sk: nie je mo¾né zlúèi» nekompatibilné polia

source: Array with element type %s cannot be included in ARRAY construct with element type %s.
sk: pole s typom prvkov %s nie je mo¾né vlo¾i» do kon¹trukcie ARRAY s typom prvkov %s.

source: multidimensional arrays must have array expressions with matching dimensions
sk: viacrozmerné polia musia ma» výrazy polí, ktoré súhlasia s rozmermi.

source: NULLIF does not support set arguments
sk: NULLIF nepodporuje mno¾inové argumenty

source: domain %s does not allow null values
sk: doména %s nepovoµuje hodnoty null

source: value for domain %s violates check constraint "%s"
sk: hodnota z domény %s poru¹uje kontrolné obmedzenie "%s"

source: aggregate function calls may not be nested
sk: volania agregaèných funkcií sa nesmú vnára» do seba

source: could not determine actual result type for function declared to return type %s
sk: nebolo mo¾né urèi» skutoèný typ výsledku funkcie, ktorá má deklarovaný návratový typ %s

source: could not determine actual type of argument declared %s
sk: nebolo mo¾né urèi» skutoèný typ argumentu deklarovaného ako %s

source: SQL function "%s" statement %d
sk: funkcia SQL "%s", príkaz %d

source: SQL function "%s" during startup
sk: funkcia SQL "%s" poèas spustenia

source: aggregate %u needs to have compatible input type and transition type
sk: agregaèná funkcia %u musí ma» kompatibilné vstupné a prechodné typy

source: query-specified return row and actual function return row do not match
sk: návratový riadok urèený dotazom a skutoèný riadok vrátený funkciou sa nezhodujú

source: could not read from hash-join temporary file: %m
sk: nebolo mo¾né èíta» z doèasného súboru hash spojení: %m

source: could not rewind hash-join temporary file: %m
sk: nebolo mo¾né presunú» èítanie na zaèiatok doèasného súboru hash spojení: %m

source: could not write to hash-join temporary file: %m
sk: nebolo mo¾né zapisova» do doèasného súboru hash spojení: %m

source: transaction left non-empty SPI stack
sk: transakcia nechala SPI zásobník neprázdny

source: Check for missing "SPI_finish" calls
sk: Preverte, èi ste nepozabudli na chýbajúce volania "SPI_finish"

source: subtransaction left non-empty SPI stack
sk: subtransakcia nechala zásobník SPI neprázdny

source: cannot open multi-query plan as cursor
sk: nie je mo¾né otvori» plán viacerých dotazov ako kurzor

source: cannot open non-SELECT query as cursor
sk: nie je mo¾né otvori» dotaz iný ako SELECT ako kurzor

source: cannot open SELECT INTO query as cursor
sk: nie je mo¾né otvori» dotaz iný ako SELECT INTO ako kurzor

source: SQL query "%s"
sk: dotaz SQL "%s"

source: RIGHT JOIN is only supported with merge-joinable join conditions
sk: pravé spojenie (RIGHT JOIN) je mo¾né pou¾i» iba v prípade podmienok vhodných pre pou¾itie spojenia zlúèením (merge join)

source: FULL JOIN is only supported with merge-joinable join conditions
sk: úplné spojenie (FULL JOIN) je mo¾né pou¾i» iba v prípade podmienok vhodných pre pou¾itie spojenia zlúèením (merge join)

source: more than one row returned by a subquery used as an expression
sk: poddotaz pou¾itý ako výraz vrátil viac ako jeden riadok

source: invalid large-object descriptor: %d
sk: neplatný deskriptor veµkého objektu: %d

source: must be superuser to use server-side lo_import()
sk: pre pou¾itie povelu lo_import() na strane servera musíte by» superu¾ívateµom

source: Anyone can use the client-side lo_import() provided by libpq.
sk: Ktokoµvek mô¾e pou¾i» lo_import() na strane klienta poskytovaný kni¾nicou libpq

source: could not open server file "%s": %m
sk: nebolo mo¾né otvori» súbor servera "%s": %m

source: could not read server file "%s": %m
sk: nebolo mo¾né èíta» zo súboru servera "%s": %m

source: must be superuser to use server-side lo_export()
sk: pre pou¾itie povelu lo_export() na strane servera musíte by» superu¾ívateµom

source: Anyone can use the client-side lo_export() provided by libpq.
sk: Ktokoµvek mô¾e pou¾i» lo_export() na strane klienta poskytovaný kni¾nicou libpq

source: could not create server file "%s": %m
sk: nebolo mo¾né vytvori» súbor servera "%s": %m

source: could not write server file "%s": %m
sk: nebolo mo¾né zapisova» do súboru servera "%s": %m

source: Kerberos error: %s
sk: Chyba systému Kerberos: %s

source: unexpected Kerberos protocol version received from client (received "%s", expected "%s")
sk: neoèakávaná verzia protokolu Kerberos získaná od klienta (získané: "%s", oèakávané "%s")

source: unexpected Kerberos user name received from client (received "%s", expected "%s")
sk: neoèakávané meno u¾ívateµa systému Kerberos získaná od klienta (získané: "%s", oèakávané "%s")

source: Kerberos 4 not implemented on this server
sk: Systém Kerberos 4 nie je implementovaný na tomto serveri

source: Kerberos initialization returned error %d
sk: Inicializácia systému Kerberos vrátila hodnotu %d

source: Kerberos keytab resolving returned error %d
sk: Výpoèet tabuµky kµúèov systému Kerberos vrátil hodnotu %d

source: Kerberos sname_to_principal("%s") returned error %d
sk: Funkcia sname_to_principal("%s") systému Kerberos vrátila hodnotu %d

source: Kerberos recvauth returned error %d
sk: povel recvauth systému Kerberos vrátil hodnotu %d

source: Kerberos unparse_name returned error %d
sk: povel unparse_name systému Kerberos vrátil hodnotu %d

source: Kerberos 5 not implemented on this server
sk: Systém Kerberos 5 nie je implementovaný na tomto serveri

source: Rejected host: authentication failed for user "%s"
sk: Odmietnutý poèítaè: autentifikácia zlyhala u u¾ívateµa "%s"

source: Kerberos4 authentication failed for user "%s"
sk: autentifikácia Kerberos4 zlyhala u u¾ívateµa "%s"

source: Kerberos5 authentication failed for user "%s"
sk: autentifikácia Kerberos5 zlyhala u u¾ívateµa "%s"

source: Trusted authentication failed for user "%s"
sk: autentifikácia dôverou zlyhala u u¾ívateµa "%s"

source: IDENT authentication failed for user "%s"
sk: autentifikácia IDENT zlyhala u u¾ívateµa "%s"

source: Password authentication failed for user "%s"
sk: autentifikácia heslom zlyhala u u¾ívateµa "%s"

source: PAM authentication failed for user "%s"
sk: autentifikácia PAM zlyhala u u¾ívateµa "%s"

source: Unknown auth method: authentication failed for user "%s"
sk: Neznámy spôsob autentifikácie: autentifikácia zlyhala u u¾ívateµa "%s"

source: missing or erroneous pg_hba.conf file
sk: chýbajúci alebo po¹kodený súbor pg_hba.conf

source: See server log for details.
sk: Pre detailnej¹ie informácie pozri log servera.

source: no pg_hba.conf entry for host "%s", user "%s", database "%s", %s
sk: ®iaden záznam v pg_hba.conf pre poèítaè "%s", u¾ívateµa "%s" a databázu "%s", %s
