Repository: IITDBGroup/perm
Catalog: src/backend/po/*.po
Languages: sk

source: COPY force quote only available using COPY TO
sk: hodnoty povinne uzavreté do úvodzoviek (force quote) povelu COPY sú dostupné iba pri pou¾ití COPY TO

source: COPY force not null available only in CSV mode
sk: povinne nie null hodnoty povelu COPY sú dostupné iba v re¾ime CSV

source: COPY force not null only available using COPY FROM
sk: povinne nie null hodnoty v povele COPY sú dostupné iba pri pou¾ití COPY FROM

source: COPY delimiter must not appear in the NULL specification
sk: Oddeµovaè operácie COPY sa nesmie vyskytova» v ¹pecifikácii NULL

source: CSV quote character must not appear in the NULL specification
sk: Znak úvodzovky CSV sa nesmie vyskytova» v ¹pecifikácii NULL

source: transaction is read-only
sk: transakcia je urèená iba na èítanie

source: must be superuser to COPY to or from a file
sk: pre pou¾itie operácie COPY do alebo zo súboru musíte by» superu¾ívateµom

source: Anyone can COPY to stdout or from stdin. psql's \copy command also works for anyone.
sk: Ktokoµvek mô¾e pou¾i» operáciu COPY na ¹tandardný výstup alebo zo ¹tandardného vstupu. povel \copy programu psql mô¾e tie¾ pou¾íva» ktokoµvek.

source: table "%s" does not have OIDs
sk: Tabuµka "%s" nemá OID hodnoty

source: FORCE QUOTE column "%s" not referenced by COPY
sk: Ståpec FORCE QUOTE (hodnoty povinne uzavreté do úvodzoviek) "%s" nebol referencovaný povelom COPY

source: FORCE NOT NULL column "%s" not referenced by COPY
sk: Ståpec FORCE NOT NULL (povinne nie null) "%s" nebol referencovaný povelom COPY

source: cannot copy to view "%s"
sk: Nie je mo¾né kopírova» do pohµadu "%s"

source: cannot copy to sequence "%s"
sk: Nie je mo¾né kopírova» do sekvencie "%s"

source: cannot copy to non-table relation "%s"
sk: Nie je mo¾né kopírova» do relácie, ktorá nie je tabuµkou "%s"

source: could not open file "%s" for reading: %m
sk: nebolo mo¾né otvori» súbor "%s" pre èítanie: %m

source: "%s" is a directory
sk: "%s" je adresár

source: cannot copy from view "%s"
sk: Nie je mo¾né kopírova» z pohµadu "%s"

source: cannot copy from sequence "%s"
sk: Nie je mo¾né kopírova» zo sekvencie "%s"

source: cannot copy from non-table relation "%s"
sk: Nie je mo¾né kopírova» z relácie, ktorá nie je tabuµkou "%s"

source: relative path not allowed for COPY to file
sk: Relatívna cesta nie je povolená pri pou¾ití operácie COPY v súvislosti so súbormi

source: could not open file "%s" for writing: %m
sk: nebolo mo¾né otvori» súbor "%s" pre zápis: %m

source: COPY %s, line %d, column %s
sk: COPY %s, riadok %d, ståpec %s

source: COPY %s, line %d
sk: COPY %s, riadok %d

source: COPY %s, line %d, column %s: "%s"
sk: COPY %s, riadok %d, ståpec %s: "%s"

source: COPY %s, line %d: "%s"
sk: COPY %s, riadok %d: "%s"

source: COPY file signature not recognized
sk: COPY: podpis súboru nebol rozpoznaný

source: invalid COPY file header (missing flags)
sk: neplatné záhlavie súboru pri operácii COPY (chýbajúce príznaky)

source: unrecognized critical flags in COPY file header
sk: nerozpoznané kritické príznaky v hlavièke súboru pri operácii COPY

source: invalid COPY file header (missing length)
sk: neplatné záhlavie súboru pri operácii COPY (neurèená då¾ka)

source: invalid COPY file header (wrong length)
sk: neplatné záhlavie súboru pri operácii COPY (nesprávna då¾ka)

source: null OID in COPY data
sk: null OID v údajoch operácie COPY

source: invalid OID in COPY data
sk: neplatné OID v dátach pri operácii COPY

source: missing data for column "%s"
sk: chýbajúce dáta ståpca "%s"

source: unterminated CSV quoted field
sk: neukonèená polo¾ka v úvodzovkách v re¾ime CSV

source: extra data after last expected column
sk: dodatoèné dáta po poslednom oèakávanom ståpci

source: row field count is %d, expected %d
sk: poèet polí riadku je %d, oèakáva sa %d

source: literal carriage return found in data
sk: v dátach bol nájdený literál návratu vozíka (znak CR)

source: Use "\r" to represent carriage return.
sk: Pou¾ite "\r" pre reprezentáciu znaku návratu vozíka (CR)

source: literal newline found in data
sk: v dátach bol nájdený literál nový riadok

source: Use "\n" to represent newline.
sk: Pou¾ite "\n" pre reprezentáciu znaku nového riadku.

source: end-of-copy marker does not match previous newline style
sk: Znaèka konca kopírovania nesúhlasí s predchádzajúcim ¹týlom nového riadku

source: end-of-copy marker corrupt
sk: Znaèka konca kopírovania je poru¹ená

source: unexpected EOF in COPY data
sk: neoèakávaný znak EOF v dátach operácie COPY

source: invalid field size
sk: neplatná veµkos» poµa

source: incorrect binary data format
sk: nesprávny údajový formát binárnych dát

source: column "%s" specified more than once
sk: ståpec "%s" urèený viac ako raz

source: SQL function cannot return shell type %s
sk: SQL funkcia nemô¾e vráti» obalový typ (shell typ) %s

source: return type %s is only a shell
sk: Návratový typ %s je iba obal

source: type "%s" is not yet defined
sk: typ "%s" nie je definovaný

source: Creating a shell type definition.
sk: Vytvára sa definícia obalového typu.

source: SQL function cannot accept shell type %s
sk: Funkcia jazyka SQL nemô¾e akceptova» obalový typ %s

source: argument type %s is only a shell
sk: typ argumentu %s je iba obal

source: type %s does not exist
sk: typ %s neexistuje

source: functions cannot accept set arguments
sk: funkcie nemô¾u ma» argumenty mno¾inového typu

source: no function body specified
sk: nebolo urèené telo funkcie

source: no language specified
sk: nebol urèený jazyk

source: unrecognized function attribute "%s" ignored
sk: nerozpoznaný atribút funkcie "%s" vynechaný

source: only one AS item needed for language "%s"
sk: pre jazyk "%s" je potrebný iba jeden prvok AS

source: You need to use "createlang" to load the language into the database.
sk: Pre naèítanie jazyka do databázy pou¾ite povel "createlang".

source: "%s" is an aggregate function
sk: "%s" je agregaèná funkcia

source: Use DROP AGGREGATE to drop aggregate functions.
sk: Pou¾ite povel DROP AGGREGATE pre vyhodenie agregaèných funkcií.

source: removing built-in function "%s"
sk: odstraòuje sa zabudovaná funkcia "%s"

source: Use ALTER AGGREGATE to rename aggregate functions.
sk: Pou¾ite povel ALTER AGGREGATE pre premenovanie agregaèných funkcií.

source: Use ALTER AGGREGATE to change owner of aggregate functions.
sk: Pou¾ite povel ALTER AGGREGATE pre zmenu vlastníka agregaèných funkcií.

source: source data type %s is only a shell
sk: zdrojový údajový typ %s je iba obal

source: target data type %s is only a shell
sk: cieµový údajový typ %s je iba obal

source: source data type %s is a pseudo-type
sk: zdrojový údajový typ %s je iba pseudo-typ

source: target data type %s is a pseudo-type
sk: cieµový údajový typ %s je iba pseudo-typ

source: cast function must take one to three arguments
sk: funkcia pretypovania musí ma» jeden a¾ tri argumenty

source: argument of cast function must match source data type
sk: argument funkcie pretypovania sa musí zhodova» so zdrojovým údajovým typom

source: second argument of cast function must be type integer
sk: druhý argument funkcie pretypovania musí ma» celoèíselný typ (integer)

source: third argument of cast function must be type boolean
sk: tretí argument funkcie pretypovania musí by» booleovského typu

source: return data type of cast function must match target data type
sk: návratový údajový typ funkcie pretypovania musí by» zhodný s cieµovým údajovým typom

source: cast function must not be volatile
sk: funkcia pretypovania nesmie by» volatilná

source: cast function must not be an aggregate function
sk: funkcia pretypovania nesmie by» agregaèná funkcia

source: cast function must not return a set
sk: funkcia pretypovania nesmie vráti» mno¾inu

source: must be superuser to create a cast WITHOUT FUNCTION
sk: musíte by» superu¾ívateµom pre vytvorenie pretypovania WITHOUT FUNCTION (bez funkcie)

source: source and target data types are not physically compatible
sk: zdrojový a cieµový údajový typ nie sú fyzicky kompatibilné

source: source data type and target data type are the same
sk: zdrojový údajový typ a cieµový údajový typ nie sú toto¾né

source: cast from type %s to type %s already exists
sk: pretypovanie z typu %s na typ %s u¾ existuje

source: %s requires a parameter
sk: %s si vy¾aduje parameter

source: %s requires a numeric value
sk: %s si vy¾aduje numerickú hodnotu

source: %s does not take a parameter
sk: %s si nevy¾aduje parameter

source: argument of %s must be a name
sk: argument objektu %s musí by» názov

source: argument of %s must be a type name
sk: argument objektu %s musí by» názov typu

source: %s requires an integer value
sk: %s si vy¾aduje celoèíselnú hodnotu

source: invalid argument for %s: "%s"
sk: neplatný argument pre %s: "%s"

source: must be superuser to create an operator class
sk: musíte by» superu¾ívateµom pre vytvorenie triedy operátorov

source: invalid operator number %d, must be between 1 and %d
sk: neplatné èíslo operátora %d, musí by» z intervalu 1 a¾ %d

source: invalid procedure number %d, must be between 1 and %d
sk: neplatné èíslo procedúry %d, musí by» z intervalu 1 a¾ %d

source: storage type specified more than once
sk: typ ukladania urèený viac ako raz

source: storage type may not be different from data type for access method "%s"
sk: typ ukladania nemô¾e by» odli¹ný od údajového typu pre metódu prístupu "%s"

source: operator class "%s" for access method "%s" already exists
sk: trieda operátorov "%s" pre metódu prístupu "%s" u¾ existuje

source: could not make operator class "%s" be default for type %s
sk: nebolo mo¾né uèini» triedu operátorov "%s" ako implicitnú pre typ %s

source: Operator class "%s" already is the default.
sk: Trieda operátorov "%s" je u¾ urèená ako implicitná.

source: btree operators must be binary
sk: operátory na B-stromoch (btree) musia by» binárne

source: btree operators must return boolean
sk: operátory na B-stromoch (btree) musia vráti» booleovskú hodnotu

source: btree operators must have index type as left input
sk: operátory na B-stromoch (btree) musia ma» typ indexu ako µavý vstup

source: btree procedures must have two arguments
sk: procedúry B-stromov (btree) musia ma» dva argumenty

source: btree procedures must return integer
sk: procedúry B-stromov (btree) musia vráti» celoèíselnú hodnotu (integer)

source: btree procedures must have index type as first input
sk: procedúry na B-stromoch (btree) musia ma» typ indexu ako µavý vstup

source: procedure number %d appears more than once
sk: èíslo procedúry %d vystupuje viac ako raz

source: operator number %d appears more than once
sk: èíslo operátora %d vystupuje viac ako raz

source: operator class "%s" for access method "%s" already exists in schema "%s"
sk: trieda operátorov "%s" pre prístupovú metódu "%s" u¾ existuje v schéme "%s"

source: must specify at least one column
sk: musíte urèi» aspoò jeden ståpec

source: cannot use more than %d columns in an index
sk: nie je mo¾né pou¾i» viac ako %d ståpcov v indexe

source: access method "%s" does not support unique indexes
sk: prístupová metóda "%s" nepodporuje jedineèné indexy

source: access method "%s" does not support multicolumn indexes
sk: prístupová metóda "%s" nepodporuje viacståpcové indexy

source: index expressions and predicates may refer only to the table being indexed
sk: indexové výrazy a predikáty mô¾u odkazova» len na tabuµku, ktorej indexácia prebieha

source: multiple primary keys for table "%s" are not allowed
sk: tabuµka "%s" nemô¾e ma» viacero primárnych kµúèov

source: primary keys cannot be expressions
sk: primárne kµúèe nemô¾u by» výrazy

source: column "%s" named in key does not exist
sk: ståpec "%s" uvedený v kµúèi neexistuje

source: %s %s will create implicit index "%s" for table "%s"
sk: %s %s vytvorí implicitný index "%s" pre tabuµku "%s"

source: cannot use subquery in index predicate
sk: v indexovom predikáte nie je mo¾né pou¾i» poddotaz

source: cannot use aggregate in index predicate
sk: v indexovom predikáte nie je mo¾né pou¾i» agregaènú funkciu

source: functions in index predicate must be marked IMMUTABLE
sk: funkcie v indexovom predikáte musia by» oznaèené ako IMMUTABLE

source: column "%s" does not exist
sk: Ståpec "%s" neexistuje

source: cannot use subquery in index expression
sk: v indexovom výraze nie je mo¾né pou¾i» poddotaz

source: cannot use aggregate function in index expression
sk: v indexovom výraze nie je mo¾né pou¾i» agregaènú funkciu

source: functions in index expression must be marked IMMUTABLE
sk: funkcie v indexovom výraze musia by» oznaèené ako IMMUTABLE

source: data type %s has no default operator class for access method "%s"
sk: údajový typ %s nemá implicitnú triedu operátorov pre prístupovú metódu "%s"

source: You must specify an operator class for the index or define a default operator class for the data type.
sk: Pre daný index musíte definova» triedu operátorov alebo definova» implicitnú triedu operátorov pre daný údajový typ.

source: operator class "%s" does not accept data type %s
sk: trieda operátorov "%s" neakceptuje údajový typ %s

source: there are multiple default operator classes for data type %s
sk: pre údajový typ %s existuje viacero implicitných tried operátorov

source: shared table "%s" can only be reindexed in stand-alone mode
sk: zdieµanú tabuµku "%s" je mo¾né reindexova» iba samostatnom re¾ime (stand-alone mode)

source: table "%s" has no indexes
sk: tabuµka "%s" nemá indexy

source: can only reindex the currently open database
sk: reindexácia mô¾e by» vykonaná iba na aktuálne otvorenej databáze

source: table "%s" was reindexed
sk: tabuµka "%s" bola reindexovaná

source: setof type not allowed for operator argument
sk: typ setof nie je povolený ako argument operátora

source: operator attribute "%s" not recognized
sk: atribút operátora "%s" nebol rozpoznaný

source: operator procedure must be specified
sk: musíte urèi» procedúru operácie

source: invalid cursor name: must not be empty
sk: neplatný názov kurzora: nesmie by» prázdny

source: DECLARE CURSOR may not specify INTO
sk: v povele DECLARE CURSOR nemô¾ete pou¾i» INTO

source: DECLARE CURSOR ... FOR UPDATE is not supported
sk: povel DECLARE CURSOR ... FOR UPDATE nie je podporovaný

source: Cursors must be READ ONLY.
sk: Kurzory smú by» len èítané (READ-ONLY).

source: cursor "%s" does not exist
sk: kurzor "%s" neexistuje

source: portal "%s" cannot be run
sk: portál "%s" nie je mo¾né spusti»

source: could not reposition held cursor
sk: nebolo mo¾né opätovne urèi» pozíciu zadr¾aného kurzora

source: invalid statement name: must not be empty
sk: neplatný názov príkazu: nesmie by» prázdny

source: utility statements cannot be prepared
sk: pomocné príkazy nie je mo¾né vopred pripravi»

source: prepared statement is not a SELECT
sk: pripravý príkaz nie je SELECT

source: prepared statement "%s" already exists
sk: pripravený príkaz "%s" u¾ existuje

source: prepared statement "%s" does not exist
sk: Pripravený príkaz "%s" neexistuje

source: permission denied for sequence %s
sk: prístup odmietnutý pre sekvenciu %s

source: nextval: reached maximum value of sequence "%s" (%s)
sk: nextval: dosiahnutá maximálna hodnota sekvencie "%s" (%s)

source: nextval: reached minimum value of sequence "%s" (%s)
sk: nextval: dosiahnutá minimálna hodnota sekvencie "%s" (%s)

source: currval of sequence "%s" is not yet defined in this session
sk: aktuálna hodnota (currval) sekvencie "%s" e¹te v tomto sedení nebola definovaná

source: setval: value %s is out of bounds for sequence "%s" (%s..%s)
sk: setval: hodnota %s je mimo povolený interval pre sekvenciu "%s" (%s..%s)

source: out of memory
sk: nedostatok pamäti

source: INCREMENT must not be zero
sk: INCREMENT nesmie ma» nulovú hodnotu

source: MINVALUE (%s) must be less than MAXVALUE (%s)
sk: MINVALUE (%s) musí by» men¹ie ako MAXVALUE (%s)

source: START value (%s) can't be less than MINVALUE (%s)
sk: hodnota START (%s) nesmie by» men¹ia ako hodnota MINVALUE (%s)

source: START value (%s) can't be greater than MAXVALUE (%s)
sk: hodnota START (%s) nesmie by» väè¹ia ako hodnota MAXVALUE (%s)

source: CACHE (%s) must be greater than zero
sk: CACHE (%s) musí by» väè¹ie ako nula

source: must be superuser to create procedural language
sk: pre vytvorenie procedurálneho jazyka musíte by» superu¾ívateµom

source: language "%s" already exists
sk: jazyk "%s" u¾ existuje

source: changing return type of function %s from "opaque" to "language_handler"
sk: zmena návratového typu funkcie %s z "opaque" na "language_handler"

source: function %s must return type "language_handler"
sk: funkcia %s musí vráti» typ "language_handler"

source: must be superuser to drop procedural language
sk: pre zru¹enie procedurálneho jazyka musíte by» superu¾ívateµom

source: must be superuser to rename procedural language
sk: pre premenovanie procedurálneho jazyka musíte by» superu¾ívateµom

source: permission denied
sk: prístup odmietnutý

source: "%s" is not a superuser, so cannot create a schema for "%s"
sk: "%s" nie je superu¾ívateµom, nemô¾e vytvori» schému pre "%s"

source: unacceptable schema name "%s"
sk: neprijateµný názov schémy "%s"

source: The prefix "pg_" is reserved for system schemas.
sk: Predpona "pg_" je rezervovaná pre systémové schémy.

source: ON COMMIT can only be used on temporary tables
sk: ON COMMIT mô¾ete pou¾i» len pre doèasné tabuµky

source: duplicate check constraint name "%s"
sk: duplicitný názov kontrolného obmedzenia "%s"

source: permission denied: "%s" is a system catalog
sk: prístup zamietnutý: "%s" je systémový katalóg

source: cannot truncate system relation "%s"
sk: nie je mo¾né oreza» systémovú reláciu "%s"

source: cannot truncate temporary tables of other sessions
sk: nie je mo¾né oreza» doèasné tabuµky iných sedení

source: column "%s" duplicated
sk: ståpec "%s" je duplicitný

source: inherited relation "%s" is not a table
sk: zdedená relácia "%s" nie je tabuµka

source: cannot inherit from temporary relation "%s"
sk: nebolo mo¾né dedi» od doèasnej tabuµky "%s"

source: inherited relation "%s" duplicated
sk: duplicitná zdedená relácia "%s"

source: merging multiple inherited definitions of column "%s"
sk: zlúèenie viacerých zdedených definícii ståpca "%s"

source: inherited column "%s" has a type conflict
sk: zdedený ståpec "%s" spôsobuje typový konflikt

source: merging column "%s" with inherited definition
sk: zlúèenie ståpca "%s" so zdedenou definíciou

source: column "%s" has a type conflict
sk: ståpec "%s" spôsobuje typový konflikt

source: column "%s" inherits conflicting default values
sk: ståpec "%s" zdedil konfliktné implicitné hodnoty

source: To resolve the conflict, specify a default explicitly.
sk: Pre vyrie¹enie konfliktu explicitne urète implicitnú hodnotu.

source: inherited column "%s" must be renamed in child tables too
sk: zdedený ståpec "%s" musí by» premenovaný aj v tabuµkách potomkov

source: cannot rename system column "%s"
sk: nie je mo¾né premenova» systémový ståpec "%s"

source: cannot rename inherited column "%s"
sk: nie je mo¾né premenova» zdedený ståpec "%s"

source: column "%s" of relation "%s" already exists
sk: Ståpec "%s" relácie "%s" u¾ existuje

source: cannot rewrite system relation "%s"
sk: nie je mo¾né prepísa» systémovú reláciu "%s"

source: cannot rewrite temporary tables of other sessions
sk: nie je mo¾né prepísa» doèasné tabuµky iných sedení

source: check constraint "%s" is violated by some row
sk: kontrolné obmedzenie "%s" bolo poru¹ené niektorým z riadkov

source: column "%s" contains null values
sk: ståpec "%s" obsahuje null hodnoty

source: "%s" is not a table or view
sk: "%s" nie je tabuµka èi pohµad

source: cannot alter table "%s" because column "%s"."%s" uses its rowtype
sk: nebolo mo¾né zmeni» tabuµku "%s", lebo ståpec "%s"."%s" pou¾íva typ jeho riadku

source: column must be added to child tables too
sk: ståpec musí by» pridaný aj do tabuliek potomkov

source: child table "%s" has different type for column "%s"
sk: Tabuµka potomka "%s" má urèený iný typ ståpca "%s"

source: merging definition of column "%s" for child "%s"
sk: zlúèenie definície ståpca "%s" v potomkovi "%s"

source: cannot alter system column "%s"
sk: nie je mo¾né prida» systémový ståpec "%s"

source: column "%s" is in a primary key
sk: ståpec "%s" je súèas»ou primárneho kµúèa

source: "%s" is not a table or index
sk: "%s" nie je tabuµka èi index

source: statistics target %d is too low
sk: ¹tatistický cieµ %d je príli¹ nízky

source: lowering statistics target to %d
sk: zní¾enie ¹tatistického cieµa na %d

source: invalid storage type "%s"
sk: neplatný typ ulo¾enia "%s"

source: column data type %s can only have storage PLAIN
sk: údajový typ %s ståpca mô¾e ma» ako typ uskladnenia urèené len PLAIN

source: cannot drop system column "%s"
sk: nie je mo¾né vymaza» systémový ståpec "%s"

source: cannot drop inherited column "%s"
sk: nie je mo¾né vymaza» zdedený ståpec "%s"

source: referenced relation "%s" is not a table
sk: referencovaná relácia "%s" nie je tabuµka

source: cannot reference temporary table from permanent table constraint
sk: nie je mo¾né odkazova» na doèasnú tabuµku z obmedzenia stálej tabuµky

source: cannot reference permanent table from temporary table constraint
sk: nie je mo¾né odkazova» na stálu tabuµku z obmedzenia doèasnej tabuµky

source: number of referencing and referenced columns for foreign key disagree
sk: poèet odkazujúcich a odkazovaných ståpcov cudzieho kµúèa je odli¹ný

source: foreign key constraint "%s" cannot be implemented
sk: obmedzenie cudzieho kµúèa "%s" nie je mo¾né implementova»

source: Key columns "%s" and "%s" are of incompatible types: %s and %s.
sk: Kµúèové ståpce "%s" a "%s" majú nekompatibilné typy: %s a %s.

source: foreign key constraint "%s" will require costly sequential scans
sk: obmedzenie cudzieho kµúèa "%s" si bude vy¾adova» nároèné sekvenèné prehµadávania

source: Key columns "%s" and "%s" are of different types: %s and %s.
sk: Kµúèové ståpce "%s" a "%s" majú rôzne typy: %s a %s.

source: column "%s" referenced in foreign key constraint does not exist
sk: ståpec "%s", na ktorý sa odkazuje v obmedzení cudzieho kµúèa, neexistuje

source: cannot have more than %d keys in a foreign key
sk: cudzí kµúè nemô¾e obsahova» viac ako %d kµúèov

source: there is no primary key for referenced table "%s"
sk: neexistuje primárny kµúè pre odkazovanú tabuµku "%s"

source: there is no unique constraint matching given keys for referenced table "%s"
sk: neexistuje jedineèné obmedzenie, ktoré by súhlasilo so zadaným kµúèom pre referencovanú tabuµku "%s"

source: constraint "%s" does not exist
sk: obmedzenie "%s" neexistuje

source: multiple constraints named "%s" were dropped
sk: viaceré obmedzenia s názvom "%s" boli vymazané

source: cannot alter inherited column "%s"
sk: nie je mo¾né zmeni» zdedený ståpec "%s"

source: transform expression must not return a set
sk: výraz transformácie nesmie vráti» mno¾inu

source: cannot use subquery in transform expression
sk: v transformaènom výraze nie je mo¾né pou¾i» poddotaz

source: cannot use aggregate function in transform expression
sk: v transformaènom výraze nie je mo¾né pou¾i» agregaènú funkciu

source: column "%s" cannot be cast to type "%s"
sk: ståpec "%s" nie je mo¾né pretypova» na typ "%s"

source: type of inherited column "%s" must be changed in child tables too
sk: typ zdedeného ståpca "%s" musí by» zmenený aj v tabuµkách potomkov

source: cannot alter type of column "%s" twice
sk: nie je mo¾né zmeni» typ ståpca "%s" dvakrát

source: default for column "%s" cannot be cast to type "%s"
sk: implicitnú hodnotu pre ståpec "%s" nie je mo¾né previes» na typ "%s"

source: cannot alter type of a column used by a view or rule
sk: nie je mo¾né zmeni» typ ståpca, ktorý pou¾íva pohµad alebo pravidlo

source: %s depends on column "%s"
sk: %s závisí od ståpca "%s"

source: "%s" is not a table, TOAST table, index, view, or sequence
sk: "%s" nie je tabuµka, tabuµka TOAST, index, pohµad, èi sekvencia
