Repository: IITDBGroup/perm
Catalog: src/backend/po/*.po
Languages: sk

source: received immediate shutdown request
sk: bola prijatá po¾iadavka pre okam¾ité zastavenie

source: startup process
sk: proces spú¹»ania

source: aborting startup due to startup process failure
sk: koniec spustenia pre chybu v procese spustenia

source: background writer process
sk: proces zapisujúci na pozadí

source: archiver process
sk: archivaèný proces

source: statistics collector process
sk: proces zberu ¹tatistiky

source: all server processes terminated; reinitializing
sk: v¹etky procesy servera ukonèené, prebieha opätovná inicializácia

source: server process
sk: proces servera

source: terminating any other active server processes
sk: ukonèujú sa ostatné aktívne procesy servera

source: %s (PID %d) exited with exit code %d
sk: %s (PID %d) ukonèil èinnos» s kódom %d

source: %s (PID %d) was terminated by signal %d
sk: %s (PID %d) bol ukonèený signálom %d

source: %s (PID %d) exited with unexpected status %d
sk: %s (PID %d) ukonèil èinnos» s neoèakávaným stavom %d

source: could not fork new process for connection: %m
sk: nebolo mo¾né vetvi» (fork) nový proces pre spojenie: %m

source: could not fork new process for connection:
sk: nebolo mo¾né vetvi» (fork) nový proces pre spojenie:

source: getnameinfo_all() failed: %s
sk: getnameinfo_all() neúspe¹né: %s

source: connection received: host=%s port=%s
sk: prijaté spojenie: poèítaè=%s port=%s

source: connection authorized: user=%s database=%s
sk: spojenie autorizované: u¾ívateµ=%s databáza=%s

source: could not exec backend process "%s": %m
sk: nebolo mo¾né vykona» (exec) proces backendu "%s": %m

source: could not fork startup process: %m
sk: nebolo mo¾né vetvi» (fork) proces spustenia: %m

source: could not fork background writer process: %m
sk: nebolo mo¾né vetvi» (fork) proces zapisujúci na pozadí: %m

source: could not fork process: %m
sk: nebolo mo¾né vetvi» (fork) proces: %m

source: could not read from backend variables file "%s": %m
sk: nebolo mo¾né èíta» zo súboru premenných backendu "%s": %m

source: ERROR: failed to wait on child process handle: %d
sk: CHYBA: èakanie neúspe¹né v prípade rukoväte procesu potomka: %d

source: could not resolve "localhost": %s
sk: nebolo mo¾né nájs» "localhost": %s

source: could not create socket for statistics collector: %m
sk: nebolo mo¾né vytvori» soket pre zber ¹tatistických údajov: %m

source: could not bind socket for statistics collector: %m
sk: nebolo mo¾né vytvori» väzbu na soket pre zber ¹tatistických údajov: %m

source: could not get address of socket for statistics collector: %m
sk: nebolo mo¾né zisti» adresu soketu pre zber ¹tatistických údajov: %m

source: could not connect socket for statistics collector: %m
sk: nebolo mo¾né pripoji» soket pre zber ¹tatistických údajov: %m

source: could not send test message on socket for statistics collector: %m
sk: nebolo mo¾né odosla» testovaciu správu cez soket pre zber ¹tatistických údajov: %m

source: select() failed in statistics collector: %m
sk: select() neúspe¹né v mechanizme zberu ¹tatistických údajov: %m

source: test message did not get through on socket for statistics collector
sk: testovacia správa nepre¹la soketom pre zber ¹tatistických údajov

source: could not receive test message on socket for statistics collector: %m
sk: nebolo mo¾né prija» testovaciu správu cez soket pre zber ¹tatistických údajov: %m

source: incorrect test message transmission on socket for statistics collector
sk: nesprávny prenos testovej správy cez soket pre zber ¹tatistických údajov

source: disabling statistics collector for lack of working socket
sk: vypínam zber ¹tatistických údajov pre nedostupnos» funkèného soketu

source: could not set statistics collector socket to nonblocking mode: %m
sk: nebolo mo¾né nastavi» soket zberu ¹tatistických údajov na neblokovací re¾im: %m

source: statistics collector startup skipped
sk: spustenie zberu ¹tatistických údajov preskoèené

source: could not fork statistics buffer: %m
sk: nebolo mo¾né vetvi» (fork) buffer ¹tatistických údajov: %m

source: must be superuser to reset statistics counters
sk: musíte by» superu¾ívateµom pre vynulovanie ¹tatistických poèítadiel

source: could not create pipe for statistics buffer: %m
sk: nebolo mo¾né vytvori» rúru pre buffer ¹tatistiky: %m

source: could not fork statistics collector: %m
sk: nebolo mo¾né vetvi» (fork) zber ¹tatistických údajov: %m

source: out of memory in statistics collector --- abort
sk: nedostatok pamäte v mechanizme zberu ¹tatistických údajov --- koniec

source: could not read from statistics collector pipe: %m
sk: nebolo mo¾né èíta» z rúry zberu ¹tatistických údajov: %m

source: invalid statistics message length
sk: neplatná då¾ka správy ¹tatistiky

source: could not set statistics collector pipe to nonblocking mode: %m
sk: nebolo mo¾né nastavi» rúru zberu ¹tatistických údajov na neblokovací re¾im: %m

source: statistics buffer is full
sk: buffer ¹tatistiky je plný

source: select() failed in statistics buffer: %m
sk: povel select() neúspe¹ný v buffri ¹tatistiky: %m

source: could not read statistics message: %m
sk: nebolo mo¾né èíta» správu ¹tatistiky: %m

source: could not write to statistics collector pipe: %m
sk: nebolo mo¾né zapisova» do rúry zberu ¹tatistických údajov: %m

source: invalid server process ID %d
sk: neplatné ID èíslo procesu servera %d

source: could not open temporary statistics file "%s": %m
sk: nebolo mo¾né otvori» doèasný súbor ¹tatistiky "%s": %m

source: database hash table corrupted during cleanup --- abort
sk: hash tabuµka databázy sa po¹kodila poèas èistenia --- koniec

source: tables hash table for database %u corrupted during cleanup --- abort
sk: hash tabuµka databázy pre databázu %u sa po¹kodila poèas èistenia --- koniec

source: could not close temporary statistics file "%s": %m
sk: nebolo mo¾né zatvori» doèasný súbor ¹tatistiky "%s": %m

source: could not rename temporary statistics file "%s" to "%s": %m
sk: nebolo mo¾né premenova» doèasný súbor ¹tatistiky z "%s" na "%s": %m

source: dead-server-process hash table corrupted during cleanup --- abort
sk: hash tabuµka màtvych procesov servera sa po¹kodila poèas èistenia --- koniec

source: corrupted pgstat.stat file
sk: po¹kodený súbor pgstat.stat

source: checkpoints are occurring too frequently (%d seconds apart)
sk: kontrolné body nastávajú príli¹ èasto (v %d sekundových intervaloch)

source: Consider increasing the configuration parameter "checkpoint_segments".
sk: Pokúste sa zvý¹i» konfiguraèný parameter "checkpoint_segments".

source: insufficient shared memory for bgwriter
sk: Nedostatoèná veµkos» zdieµanej pamäte pre bgwriter

source: checkpoint request failed
sk: ¾iados» o kontrolný bod neúspe¹ná

source: Consult the postmaster log for details.
sk: Viac informácií nájdete v logu programu postmaster.

source: could not fork archiver: %m
sk: nebolo mo¾né vetvi» (fork) archivaèný proces: %m

source: transaction log file "%s" could not be archived
sk: nebolo mo¾né archivova» log súbor transakcií "%s"

source: archive command "%s" failed: return code %d
sk: archivaèný povel "%s" bol neúspe¹ný: návratový kód %d

source: archived transaction log file "%s"
sk: archivovaný log súbor transakcií "%s"

source: could not open archive status directory "%s": %m
sk: nebolo mo¾né otvori» stavový adresár archívu "%s": %m

source: could not read archive status directory "%s": %m
sk: nebolo mo¾né èíta» stavový adresár archívu "%s": %m

source: rule "%s" for relation "%s" already exists
sk: u¾ existuje pravidlo "%s" pre reláciu "%s"

source: rule actions on OLD are not implemented
sk: úkony pravidiel na OLD nie sú implementované

source: Use views or triggers instead.
sk: Pou¾ite rad¹ej pohµady alebo triggre.

source: rule actions on NEW are not implemented
sk: úkony pravidiel na NEW nie sú implementované

source: Use triggers instead.
sk: Pou¾ite rad¹ej triggre.

source: INSTEAD NOTHING rules on SELECT are not implemented
sk: pravidlá INSTEAD NOTHING nie sú implementované pre povely SELECT

source: Use views instead.
sk: Rad¹ej pou¾ite pohµady.

source: multiple actions for rules on SELECT are not implemented
sk: viaceré úkony pre pravidlá na poveloch SELECT nie sú implementované

source: rules on SELECT must have action INSTEAD SELECT
sk: pravidlá na poveloch SELECT musia ma» úkon INSTEAD SELECT

source: event qualifications are not implemented for rules on SELECT
sk: kvalifikácie udalostí nie sú implementované pre pravidlá na poveloch SELECT

source: SELECT rule's target list has too many entries
sk: zoznam cieµov pravidla SELECT má príli¹ veµa polo¾iek

source: cannot convert relation containing dropped columns to view
sk: nie je mo¾né konvertova» reláciu obsahujúcu vymazané ståpce na pohµad

source: SELECT rule's target entry %d has different column name from "%s"
sk: Polo¾ka cieµa %d pravidla SELECT má odli¹ný názov ako ståpec "%s"

source: SELECT rule's target entry %d has different type from column "%s"
sk: Polo¾ka cieµa %d pravidla SELECT má odli¹ný typ ako ståpec "%s"

source: SELECT rule's target entry %d has different size from column "%s"
sk: Polo¾ka cieµa %d pravidla SELECT má odli¹nú veµkos» ako ståpec "%s"

source: SELECT rule's target list has too few entries
sk: zoznam cieµov pravidla SELECT má príli¹ málo polo¾iek

source: "%s" is already a view
sk: "%s" je u¾ pohµad

source: view rule for "%s" must be named "%s"
sk: pravidlo pohµadu pre "%s" musí by» pomenované "%s"

source: could not convert table "%s" to a view because it is not empty
sk: nebolo mo¾né konvertova» tabuµku "%s" na pohµad, lebo nie je prázdna

source: could not convert table "%s" to a view because it has triggers
sk: nebolo mo¾né konvertova» tabuµku "%s" na pohµad, lebo má triggre

source: In particular, the table may not be involved in any foreign key relationships.
sk: Tabuµka nesmie by» súèas»ou ¾iadneho vz»ahu cudzieho kµúèa.

source: could not convert table "%s" to a view because it has indexes
sk: nebolo mo¾né konvertova» tabuµku "%s" na pohµad, lebo má indexy

source: could not convert table "%s" to a view because it has child tables
sk: nebolo mo¾né konvertova» tabuµku "%s" na pohµad, lebo má tabuµky-potomkov

source: multiple assignments to same column "%s"
sk: viaceré priradenia k rovnakému ståpcu "%s"

source: infinite recursion detected in rules for relation "%s"
sk: bola zistená nekoneèná rekurzia v pravidlách pre reláciu "%s"

source: cannot insert into a view
sk: nie je mo¾né vlo¾i» dáta do pohµadu

source: You need an unconditional ON INSERT DO INSTEAD rule.
sk: Potrebujete nepodmienené pravidlo ON INSERT DO INSTEAD.

source: cannot update a view
sk: nie je mo¾né aktualizova» pohµad

source: You need an unconditional ON UPDATE DO INSTEAD rule.
sk: Potrebujete nepodmienené pravidlo ON UPDATE DO INSTEAD.

source: cannot delete from a view
sk: z pohµadu nie je mo¾né vymaza» dáta

source: You need an unconditional ON DELETE DO INSTEAD rule.
sk: Potrebujete nepodmienené pravidlo ON DELETE DO INSTEAD.

source: conditional utility statements are not implemented
sk: podmienené pomocné príkazy nie sú implementované

source: out of shared memory
sk: nedostatok zdieµanej pamäte

source: invalid page header in block %u of relation "%s"; zeroing out page
sk: neplatné záhlavie stránky v bloku %u relácie "%s". Stránka sa nuluje.

source: invalid page header in block %u of relation "%s"
sk: neplatné záhlavie stránky v bloku %u relácie "%s"

source: could not write block %u of %u/%u/%u
sk: nebolo mo¾né zapísa» blok %u z %u/%u/%u

source: Multiple failures --- write error may be permanent.
sk: Viaceré chyby --- chyba zápisu mô¾e by» trvalá.

source: writing block %u of relation %u/%u/%u
sk: zapisuje sa blok %u relácie %u/%u/%u

source: no empty local buffer available
sk: nie je dostupný ¾iaden prázdny miestny buffer

source: insufficient file descriptors available to start server process
sk: nie sú dostupné dostatoèné deskriptory súborov pre spustenie procesu servera

source: System allows %d, we need at least %d.
sk: Systém umo¾òuje %d, potrebujeme minimálne %d.

source: out of file descriptors: %m; release and retry
sk: nedostatok deskriptorov súborov: %m. Uvoµnite ich a pokúste sa e¹te raz

source: insufficient shared memory for free space map
sk: nedostatoèné mno¾stvo zdieµanej pamäte pre mapovanie voµného priestoru

source: max_fsm_pages must exceed max_fsm_relations * %d
sk: hodnota max_fsm_pages musí by» väè¹ia ako max_fsm_relations * %d

source: max_fsm_pages is too large
sk: hodnota max_fsm_pages je príli¹ veµká

source: free space map: %d relations, %d pages stored; %.0f total pages needed
sk: mapa voµného priestoru: %d relácií, %d stránok ulo¾ený, %.0f celkovo potrebných stránok

source: Allocated FSM size: %d relations + %d pages = %.0f kB shared memory.
sk: Alokovaná veµkos» FSM: %d relácií + %d stránok = %.0f kB zdieµanej pamäte.

source: could not allocate shared memory segment "%s"
sk: Nebolo mo¾né alokova» zdieµaný pamä»ový segment "%s"

source: Process %d waits for %s on transaction %u; blocked by process %d.
sk: Proces %d èaká na %s v transakcii %u, blokovaný procesom %d.

source: Process %d waits for %s on relation %u of database %u; blocked by process %d.
sk: Proces %d èaká na %s v pre reláciu %u databázy %u, blokovaný procesom %d.

source: deadlock detected
sk: bol zistený deadlock

source: You may need to increase max_locks_per_transaction.
sk: Mo¾no potrebujete zvý¹i» hodnotu max_locks_per_transaction.

source: corrupted page pointers: lower = %u, upper = %u, special = %u
sk: po¹kodené ukazovatele stránok: ni¾¹ie = %u, vy¹¹ie = %u, ¹peciálne = %u

source: corrupted item pointer: %u
sk: po¹kodený ukazovateµ stránky: %u

source: corrupted item lengths: total %u, available space %u
sk: po¹kodené då¾ky prvkov: celkom %u, dostupný priestor %u

source: corrupted item pointer: offset = %u, size = %u
sk: po¹kodený ukazovateµ stránky: ofset = %u, veµkos» = %u

source: could not open relation %u/%u/%u: %m
sk: nebolo mo¾né otvori» reláciu %u/%u/%u: %m

source: could not fsync segment %u of relation %u/%u/%u: %m
sk: nebolo mo¾né aplikova» fsync na segment %u relácie %u/%u/%u: %m

source: could not open segment %u of relation %u/%u/%u (target block %u): %m
sk: nebolo mo¾né otvori» segment %u relácie %u/%u/%u (cieµový blok %u): %m

source: could not close relation %u/%u/%u: %m
sk: nebolo mo¾né zatvori» reláciu %u/%u/%u: %m

source: could not create relation %u/%u/%u: %m
sk: nebolo mo¾né vytvori» reláciu %u/%u/%u: %m

source: could not unlink relation %u/%u/%u: %m
sk: nebolo mo¾né zru¹i» prepojenie relácie %u/%u/%u: %m

source: could not extend relation %u/%u/%u: %m
sk: nebolo mo¾né roz¹íri» reláciu %u/%u/%u: %m

source: Check free disk space.
sk: Preverte mno¾stvo voµného diskového priestoru.

source: could not read block %u of relation %u/%u/%u: %m
sk: nebolo mo¾né èíta» blok %u relácie %u/%u/%u: %m

source: could not write block %u of relation %u/%u/%u: %m
sk: nebolo mo¾né zapísa» blok %u relácie %u/%u/%u: %m

source: could not count blocks of relation %u/%u/%u: %m
sk: nebolo mo¾né spoèíta» bloky relácie %u/%u/%u: %m

source: could not truncate relation %u/%u/%u to %u blocks: %m
sk: nebolo mo¾né oreza» reláciu %u/%u/%u na %u blokov: %m

source: could not sync relation %u/%u/%u: %m
sk: nebolo mo¾né aplikova» sync na reláciu %u/%u/%u: %m

source: invalid argument size %d in function call message
sk: neplatná veµkos» %d argumentu v správe volania funkcie

source: current transaction is aborted, commands ignored until end of transaction block
sk: aktuálna transakcia sa ru¹í, povely sa ignorujú do konca bloku transakcií

source: function call message contains %d arguments but function requires %d
sk: správa volania funkcie obsahuje %d argumentov, av¹ak funkcia si vy¾aduje %d

source: function call message contains %d argument formats but %d arguments
sk: správa volania funkcie obsahuje %d formátov argumentov a %d argumentov

source: incorrect binary data format in function argument %d
sk: nesprávny binárny formát údajov v argumente %d funkcie

source: invalid frontend message type %d
sk: nesprávny typ %d správy frontendu

source: statement: %s
sk: príkaz: %s

source: duration: %ld.%03ld ms
sk: trvanie: %ld.%03ld ms

source: duration: %ld.%03ld ms statement: %s
sk: trvanie: %ld.%03ld ms príkaz: %s

source: cannot insert multiple commands into a prepared statement
sk: do pripraveného príkazu nie mo¾né vlo¾i» viacero povelov

source: bind message has %d parameter formats but %d parameters
sk: správa väzby má %d formátov parametrov ale %d parametrov

source: unnamed prepared statement does not exist
sk: nepomenovaný pripravený príkaz neexistuje

source: bind message supplies %d parameters, but prepared statement "%s" requires %d
sk: správa väzby obsahuje %d parametrov ale pripravený príkaz "%s" si vy¾aduje %d

source: incorrect binary data format in bind parameter %d
sk: nesprávny binárny údajový formát parametra %d väzby

source: portal "%s" does not exist
sk: portál "%s" neexistuje

source: terminating connection because of crash of another server process
sk: ukonèuje sa spojenie, lebo sa zrútil iný proces servera

source: The postmaster has commanded this server process to roll back the current transaction and exit, because another server process exited abnormally and possibly corrupted shared memory.
sk: Postmaster nariadil tomuto procesu servera, aby vrátil aktuálnu transakciu a ukonèil èinnos», lebo iný proces servera abnormálne ukonèil èinnos» a pravdepodobne po¹kodil obsah zdieµanej pamäte.

source: In a moment you should be able to reconnect to the database and repeat your command.
sk: Za chvíµu sa budete môc» opä» pripoji» k databáze a zopakova» povel.

source: floating-point exception
sk: výnimka operácie s èíslom v pohyblivej rádovej èiarke

source: An invalid floating-point operation was signaled. This probably means an out-of-range result or an invalid operation, such as division by zero.
sk: Bola signalizovaná neplatná operácia s èíslom s pohyblivou rádovou èiarkou. To pravdepodobne znamená preteèený výsledok alebo neplatnú operáciu, ako napr. delenie nulou.

source: terminating connection due to administrator command
sk: ukonèuje sa spojenie na povel administrátora

source: canceling query due to user request
sk: zru¹enie dotazu na ¾iados» u¾ívateµa

source: stack depth limit exceeded
sk: prekroèený limit håbky zásobníka

source: Increase the configuration parameter "max_stack_depth".
sk: Zvý¹te konfiguraèný parameter "max_stack_depth"

source: %s is the PostgreSQL stand-alone backend. It is not intended to be used by normal users.
sk: %s je samostatný backend systému PostgreSQL. Nie je urèený pre pou¾itie obyèajnými u¾ívateµmi.

source: Usage: %s [OPTION]... [DBNAME]
sk: Pou¾itie: %s [VO¥BA] [DATABÁZA]

source: -d 0-5 debugging level (0 is off)
sk: -d 0-5 úroveò ladenia (0 znamená vypnuté)

source: -e use European date input format (DMY)
sk: -e pou¾i» európsky formát dátumu (deò, mesiac, rok)

source: -E echo query before execution
sk: -E vypí¹ dotaz pred vykonaním

source: -N do not use newline as interactive query delimiter
sk: -N nepou¾íva» znak nového riadku ako interaktívny oddeµovaè dotazov.

source: -o FILENAME send stdout and stderr to given file
sk: -o SÚBOR presmerova» stdout a stderr do daného súboru

source: -P disable system indexes
sk: -P zakáza» systémové indexy

source: -s show statistics after each query
sk: -s zobrazi» ¹tatistiku po ka¾dom dotaze

source: -S WORK-MEM set amount of memory for sorts (in kbytes)
sk: -S PAMÄ« urèi» mno¾stvo pamäte pou¾ívané pre triedenie (v kB)

source: --describe-config describe configuration parameters, then exit
sk: --describe-config popísa» konfiguraèné parametre, potom koniec

source: -f s|i|n|m|h forbid use of some plan types
sk: -f s|i|n|m|h zakáza» pou¾ívanie niektorých typov plánov

source: -i do not execute queries
sk: -i nevykonáva» dotazy

source: -O allow system table structure changes
sk: -O umo¾ní zmenu ¹truktúry systémových tabuliek

source: -t pa|pl|ex show timings after each query
sk: -t pa|pl|ex zobrazi» èasovanie po ka¾dom dotaze

source: -W NUM wait NUM seconds to allow attach from a debugger
sk: -W NUM poèka» NUM sekúnd pre umo¾nenie pripojenia sa z ladiaceho programu

source: Report bugs to <pgsql-bugs@postgresql.org>.
sk: Chyby hláste na adresu <pgsql-bugs@postgresql.org>.

source: assert checking is not compiled in
sk: kontrola asercií nebola vlo¾ená do systému poèas kompilácie

source: invalid command-line arguments for server process
sk: nesprávne argumenty povelového riadku pre proces servera

source: Try "%s --help" for more information.
sk: Zadajte "%s --help" pre detailnej¹ie informácie.

source: %s: invalid command-line arguments
sk: %s: nesprávne argumenty povelového riadku

source: %s: no database nor user name specified
sk: %s: nebol urèený názov databázy ani meno u¾ívateµa

source: invalid CLOSE message subtype %d
sk: neplatný podtyp správy CLOSE: %d

source: invalid DESCRIBE message subtype %d
sk: neplatný podtyp správy DESCRIBE: %d

source: disconnection: session time: %s%s%s%s%s
sk: odpojenie: èas sedenia: %s%s%s%s%s

source: bind message has %d result formats but query has %d columns
sk: správa väzby má %d výsledných formátov, ale dotaz má iba %d ståpcov

source: cursor can only scan forward
sk: kurzor mô¾e prehµadáva» iba dopredu

source: Declare it with SCROLL option to enable backward scan.
sk: Deklarujte ho s voµbou SCROLL pre umo¾nenie prehµadávania dozadu.

source: table "%s" does not exist
sk: tabuµka "%s" neexistuje

source: Use DROP TABLE to remove a table.
sk: Pou¾ite povel DROP TABLE pre odstránenie tabuµky.

source: sequence "%s" does not exist
sk: sekvencia "%s" neexistuje

source: Use DROP SEQUENCE to remove a sequence.
sk: Pou¾ite povel DROP SEQUENCE pre odstránenie sekvencie.

source: view "%s" does not exist
sk: pohµad "%s" neexistuje

source: Use DROP VIEW to remove a view.
sk: Pou¾ite povel DROP VIEW pre odstránenie pohµadu.

source: index "%s" does not exist
sk: index "%s" neexistuje

source: Use DROP INDEX to remove an index.
sk: Pou¾ite povel DROP INDEX pre odstránenie indexu.

source: "%s" is not a type
sk: "%s" nie je typ

source: Use DROP TYPE to remove a type.
sk: Pou¾ite povel DROP TYPE pre odstránenie typu.

source: must be superuser to do CHECKPOINT
sk: musíte by» superu¾ívateµom pre vykonanie povelu CHECKPOINT

source: could not determine input data types
sk: nebolo mo¾né urèi» vstupné údajové typy

source: neither input type is an array
sk: ani vstupný typ nie je pole

source: argument must be empty or one-dimensional array
sk: argument musí by» prázdny alebo jednorozmerné pole

source: cannot concatenate incompatible arrays
sk: nie je mo¾né zre»azi» nekompatibilné polia

source: Arrays of %d and %d dimensions are not compatible for concatenation.
sk: Polia o rozmeroch %d a %d nie sú súce na zre»azenie.

source: Arrays with element types %s and %s are not compatible for concatenation.
sk: Polia s typmi prvkov %s a %s nie sú súce na zre»azenie.

source: Arrays with differing element dimensions are not compatible for concatenation.
sk: Polia s odli¹nými rozmermi prvkov nie sú súce na zre»azenie.

source: Arrays with differing dimensions are not compatible for concatenation.
sk: Polia s odli¹nými rozmermi nie sú súce na zre»azenie.

source: invalid array element type OID: %u
sk: neplatné OID typu prvku poµa: %u

source: invalid number of dimensions: %d
sk: neplatné poèet rozmerov: %d

source: identifier too long
sk: identifikátor príli¹ dlhý

source: Identifier must be less than %d characters.
sk: Identifikátor musí ma» menej ako %d znakov.

source: unrecognized key word: "%s"
sk: Neznáme kµúèové slovo: "%s"

source: ACL key word must be "group" or "user".
sk: Kµúèové slovo ACL musí by» "group" (skupina) alebo "user" (u¾ívateµ).

source: missing name
sk: chýbajúci názov

source: A name must follow the "group" or "user" key word.
sk: Za kµúèovým slovom "group" (skupina) alebo "user" (u¾ívateµ) musí nasledova» názov.
