Repository: IITDBGroup/perm
Catalog: src/backend/po/*.po
Languages: sk

source: negative substring length not allowed
sk: záporná då¾ka èasti re»azca nie je povolená

source: index %d out of valid range, 0..%d
sk: index %d je mimo platný rozsah 0..%d

source: new bit must be 0 or 1
sk: nový bit musí by» 0 alebo 1

source: field position must be greater than zero
sk: pozícia prvku musí by» väè¹ia ako nula.

source: input of anonymous composite types is not implemented
sk: vstup anonymných zlo¾ených typov nie je implementovaný

source: malformed record literal: "%s"
sk: nesprávne vytvorený literál záznamu: "%s"

source: Missing left parenthesis.
sk: Chýba µavá okrúhla zátvorka

source: Too few columns.
sk: Príli¹ málo ståpcov.

source: Unexpected end of input.
sk: Neoèakávaný koniec vstupu.

source: Too many columns.
sk: Príli¹ mnoho ståpcov.

source: Junk after right parenthesis.
sk: Zbytoèné znaky po pravej okrúhlej zátvorke.

source: wrong number of columns: %d, expected %d
sk: nesprávny poèet ståpcov: %d, oèakáva sa %d

source: wrong data type: %u, expected %u
sk: nesprávny údajový typ: %u, oèakáva sa %u

source: improper binary format in record column %d
sk: nesprávny binárny formát ståpca %d záznamu

source: type %s is only a shell
sk: typ %s je iba obal

source: no input function available for type %s
sk: neexistuje vstupná funkcia pre typ %s

source: no output function available for type %s
sk: neexistuje výstupná funkcia pre typ %s

source: could not create relation-cache initialization file "%s": %m
sk: nebolo mo¾né vytvori» inicializaèný súbor pre cache relácie"%s": %m

source: Continuing anyway, but there's something wrong.
sk: Pokraèujem, aj keï nieèo nie je v poriadku.

source: type %s is not composite
sk: typ %s nie je zlo¾ený

source: record type has not been registered
sk: typ záznamu nebol registrovaný

source: could not reopen file "%s" as stderr: %m
sk: nebolo mo¾né opätovne otvori» súbor "%s" ako stderr: %m

source: could not reopen file "%s" as stdout: %m
sk: nebolo mo¾né opätovne otvori» súbor "%s" ako stdout: %m

source: [unknown]
sk: [neznámy]

source: missing error text
sk: chýbajúci text chyby

source: at character %d
sk: pri znaku %d

source: HINT:
sk: POMÔCKA:

source: QUERY:
sk: DOTAZ:

source: CONTEXT:
sk: KONTEXT:

source: LOCATION: %s, %s:%d
sk: UMIESTNENIE: %s, %s:%d

source: LOCATION: %s:%d
sk: UMIESTNENIE: %s:%d

source: STATEMENT:
sk: PRÍKAZ:

source: operating system error %d
sk: chyba operaèného systému %d

source: DEBUG
sk: LADENIE

source: INFO
sk: INFORMÁCIE

source: NOTICE
sk: POZNÁMKA

source: WARNING
sk: POZOR

source: ERROR
sk: CHYBA

source: FATAL
sk: FATÁLNE

source: PANIC
sk: PANIKA

source: TRAP: ExceptionalCondition: bad arguments
sk: PASCA: ExceptionalCondition: nesprávne argumenty

source: TRAP: %s("%s", File: "%s", Line: %d)
sk: PASCA: %s("%s", Súbor: "%s", Riadok: %d)

source: internal function "%s" is not in internal lookup table
sk: interná funkcia "%s" sa nenachádza v internej vyhµadávacej tabuµke

source: unrecognized API version %d reported by info function "%s"
sk: neznáma verzia API %d vrátená info funkciou "%s"

source: function %u has too many arguments (%d, maximum is %d)
sk: funkcia %u má príli¹ mnoho argumentov (%d, maximum je %d)

source: could not access file "%s": %m
sk: nebolo mo¾né pristúpi» k súboru "%s": %m

source: could not load library "%s": %s
sk: nebolo mo¾né naèíta» kni¾nicu "%s": %s

source: could not find function "%s" in file "%s"
sk: nebolo mo¾né nájs» funkciu "%s" v súbore "%s"

source: invalid macro name in dynamic library path: %s
sk: neplatný názov makra v umiestnení dynamickej kni¾nice: %s

source: zero-length component in parameter "dynamic_library_path"
sk: komponent då¾ky nula v parametri "dynamic_library_path"

source: component in parameter "dynamic_library_path" is not an absolute path
sk: komponent v parametri "dynamic_library_path" nie je absolútna cesta

source: permission denied to set session authorization
sk: prístup zamietnutý pre nastavenie autorizácie sedenia

source: invalid user ID: %d
sk: neplatná hodnota ID u¾ívateµa: %d

source: could not create lock file "%s": %m
sk: nebolo mo¾né vytvori» súbor uzamknutia "%s": %m

source: could not open lock file "%s": %m
sk: nebolo mo¾né otvori» súbor uzamknutia "%s": %m

source: could not read lock file "%s": %m
sk: nebolo mo¾né èíta» súbor uzamknutia "%s": %m

source: lock file "%s" already exists
sk: súbor uzamknutia "%s" u¾ existuje

source: Is another %s (PID %d) running in data directory "%s"?
sk: Be¾í u¾ iný program %s (PID %d) v dátovom adresári "%s"?

source: Is another %s (PID %d) using socket file "%s"?
sk: Pou¾íva iný program %s (PID %d) súbor soketu "%s"?

source: pre-existing shared memory block (key %lu, ID %lu) is still in use
sk: vopred vytvorený blok zdieµanej pamäte (kµúè %lu, ID %lu) sa e¹te stále pou¾íva

source: If you're sure there are no old server processes still running, remove the shared memory block with the command "ipcrm", or just delete the file "%s".
sk: Ak máte istotu, ¾e u¾ nebe¾ia staré procesy servera, odstráòte blok zdieµanej pamäti povelom "ipcrm" alebo iba odstráòte súbor "%s".

source: could not remove old lock file "%s": %m
sk: nebolo mo¾né odstráni» súbor so starou zámkou "%s": %m

source: The file seems accidentally left over, but it could not be removed. Please remove the file by hand and try again.
sk: Tento súbor sa tu asi nechal náhodou, ale nie je mo¾né ho odstráni». Prosím, odstráòte ho ruène a potom sa pokúste znovu.

source: could not write lock file "%s": %m
sk: nebolo mo¾né zapísa» súbor uzamknutia "%s": %m

source: could not read from file "%s": %m
sk: nebolo mo¾né èíta» zo súboru "%s": %m

source: "%s" is not a valid data directory
sk: "%s" nie je platný dátový adresár

source: File "%s" is missing.
sk: Súbor "%s" chýba.

source: File "%s" does not contain valid data.
sk: Súbor "%s" neobsahuje platné dáta.

source: You may need to initdb.
sk: Asi potrebujete spusti» povel initdb.

source: The data directory was initialized by PostgreSQL version %ld.%ld, which is not compatible with this version %s.
sk: Dátový adresár bol inicializovaný systémom PostgreSQL verzie %ld.%ld, ktorá nie je kompatibilná s touto verziou %s.

source: invalid list syntax for parameter "preload_libraries"
sk: neplatná syntax zoznamu pre parameter "preload_libraries"

source: preloaded library "%s" with initialization function "%s"
sk: vopred naèítaná kni¾nica "%s" s funkciou inicializácie "%s"

source: preloaded library "%s"
sk: vopred naèítaná kni¾nica "%s"

source: database "%s", OID %u, has disappeared from pg_database
sk: databáza "%s", OID %u zmizla z pg_database

source: database "%s" is not currently accepting connections
sk: databáza "%s" momentálne neprijíma spojenia

source: The database subdirectory "%s" is missing.
sk: Podadresár databázy "%s" chýba.

source: could not access directory "%s": %m
sk: nebolo mo¾né pristúpi» k adresáru "%s": %m

source: could not change directory to "%s": %m
sk: nebolo mo¾né zmeni» adresár na "%s": %m

source: no users are defined in this database system
sk: ¾iadni u¾ívatelia nie sú definovaný na tomto databázovom systéme

source: You should immediately run CREATE USER "%s" WITH SYSID %d CREATEUSER;.
sk: Ihneï spustite povel CREATE USER "%s" WITH SYSID %d CREATEUSER;

source: connection limit exceeded for non-superusers
sk: bol prekroèený limit pre spojenia u¾ívateµov, ktorí nie sú superu¾ívateµmi

source: ignoring unconvertible UTF-8 character 0x%04x
sk: ignoruje sa nekonvertovateµný znak UTF-8 0x%04x

source: invalid encoding number: %d
sk: Neplatné èíslo kódovania: %d

source: ignoring unconvertible %s character 0x%04x
sk: ignoruje sa nekonvertovateµný %s znak 0x%04x

source: encoding name too long
sk: názov kódovania je príli¹ dlhý

source: Unicode characters greater than or equal to 0x10000 are not supported
sk: Znaky Unicode väè¹ie alebo rovné ako 0x10000 nie sú povolené

source: invalid byte sequence for encoding "%s": 0x%s
sk: neplatná sekvencia bajtov pre kódovanie "%s": 0x%s

source: default conversion function for encoding "%s" to "%s" does not exist
sk: implicitná funkcia konverzie z kódovania "%s" na "%s" neexistuje

source: invalid source encoding name "%s"
sk: neplatný názov zdrojového kódovania "%s"

source: invalid destination encoding name "%s"
sk: neplatný názov cieµového kódovania "%s"

source: internal error: unrecognized run-time parameter type
sk: interná chyba: neznámy typ parametra behu

source: Ungrouped
sk: Nezoskupené

source: Connections and Authentication
sk: Spojenia a overovanie toto¾nosti

source: Connections and Authentication / Connection Settings
sk: Spojenia a overovanie toto¾nosti / nastavenia spojenia

source: Connections and Authentication / Security and Authentication
sk: Spojenia a overovanie toto¾nosti / Bezpeènos» a overovanie toto¾nosti

source: Resource Usage
sk: Vyu¾itie zdrojov

source: Resource Usage / Memory
sk: Vyu¾itie zdrojov / Pamä»

source: Resource Usage / Free Space Map
sk: Vyu¾itie zdrojov / Mapa voµného priestoru

source: Resource Usage / Kernel Resources
sk: Vyu¾itie zdrojov / Zdroje jadra

source: Write-Ahead Log
sk: Log pre predbe¾ný zápis

source: Write-Ahead Log / Settings
sk: Log pre predbe¾ný zápis / Nastavenia

source: Write-Ahead Log / Checkpoints
sk: Log pre predbe¾ný zápis / Kontrolné body

source: Query Tuning
sk: Ladenie dotazov

source: Query Tuning / Planner Method Configuration
sk: Ladenie dotazov / Konfigurácia metódy plánovaèa

source: Query Tuning / Planner Cost Constants
sk: Ladenie dotazov / Nákladové kon¹tanty plánovaèa

source: Query Tuning / Genetic Query Optimizer
sk: Ladenie dotazov / Genetický optimalizér dotazov

source: Query Tuning / Other Planner Options
sk: Ladenie dotazov / Iné voµby plánovaèa

source: Reporting and Logging
sk: Hlásenie a logovanie

source: Reporting and Logging / Where to Log
sk: Hlásenie a logovanie / Kam logova»

source: Reporting and Logging / When to Log
sk: Hlásenie a logovanie / Kedy logova»

source: Reporting and Logging / What to Log
sk: Hlásenie a logovanie / Èo logova»

source: Statistics
sk: ©tatistika

source: Statistics / Monitoring
sk: ©tatistika / Monitorovanie

source: Statistics / Query and Index Statistics Collector
sk: ©tatistika / Mechanizmus zberu ¹tatistických údajov o dotazoch a indexoch

source: Client Connection Defaults
sk: Implicitné hodnoty klientských spojení

source: Client Connection Defaults / Statement Behavior
sk: Implicitné hodnoty klientských spojení / chovanie príkazov

source: Client Connection Defaults / Locale and Formatting
sk: Implicitné hodnoty klientských spojení / Národné nastavenia a formátovanie

source: Client Connection Defaults / Other Defaults
sk: Implicitné hodnoty klientských spojení / Iné implicitné hodnoty

source: Lock Management
sk: Správa uzamknutí

source: Version and Platform Compatibility
sk: Kompatibilita verzií a platforiem

source: Version and Platform Compatibility / Previous PostgreSQL Versions
sk: Kompatibilnos» verzií a platforiem / Predchádzajúce verzie PostgreSQL

source: Version and Platform Compatibility / Other Platforms and Clients
sk: Kompatibilnos» verzií a platforiem / Iné platformy a klienti

source: Developer Options
sk: Voµby pre vývojárov

source: Compiled-in Options
sk: Zakompilované voµby

source: Enables the planner's use of sequential-scan plans.
sk: Umo¾òuje, aby plánovaè pou¾íval plány pre sekvenèné prehµadávanie.

source: Enables the planner's use of index-scan plans.
sk: Umo¾òuje, aby plánovaè pou¾íval plány s indexovým prehµadávaním.

source: Enables the planner's use of TID scan plans.
sk: Umo¾òuje, aby plánovaè pou¾íval plány s prehµadávaním TID.

source: Enables the planner's use of explicit sort steps.
sk: Umo¾òuje, aby plánovaè pou¾íval explicitné kroky triedenia.

source: Enables the planner's use of hashed aggregation plans.
sk: Umo¾òuje, aby plánovaè pou¾íval hashované agregaèné plány.

source: Enables the planner's use of nested-loop join plans.
sk: Umo¾òuje, aby plánovaè pou¾íval plány s spojenia s vnorenými cyklami.

source: Enables the planner's use of merge join plans.
sk: Umo¾òuje, aby plánovaè pou¾íval plány spojení zlúèením.

source: Enables the planner's use of hash join plans.
sk: Umo¾òuje, aby plánovaè pou¾íval plány spojení hashovaním.

source: Enables genetic query optimization.
sk: Povoli» genetickú optimalizáciu dotazov.

source: This algorithm attempts to do planning without exhaustive searching.
sk: Tento algoritmus sa pokú¹a o plánovanie bez vyèerpávajúceho prehµadávania.

source: Shows whether the current user is a superuser.
sk: Vypí¹e, èi je aktuálny u¾ívateµ superu¾ívateµom.

source: Enables SSL connections.
sk: Umo¾ní spojenia SSL.

source: Forces synchronization of updates to disk.
sk: Vynúti si synchronizaèné aktualizácie na disk.

source: The server will use the fsync() system call in several places to make sure that updates are physically written to disk. This insures that a database cluster will recover to a consistent state after an operating system or hardware crash.
sk: Server pou¾ije systémové volanie fsync() na viacerých miestach, aby sa uistil, ¾e aktualizácie sú fyzicky zapísané na disk. Tým sa zabezpeèí, ¾e zoskupenie databáz sa obnoví do konzistentného stavu po zlyhaní operaèného systému alebo hardvéru.

source: Continues processing past damaged page headers.
sk: pokraèuje v spracovaní za po¹kodenými záhlaviami stránok.

source: Detection of a damaged page header normally causes PostgreSQL to report an error, aborting the current transaction. Setting zero_damaged_pages to true causes the system to instead report a warning, zero out the damaged page, and continue processing. This behavior will destroy data, namely all the rows on the damaged page.
sk: Detekcia po¹kodeného záhlavia stránok spôsobuje, ¾e PostgreSQL zahlási chybu a zru¹í aktuálnu transakciu. Nastavením zero_damaged_pages na true sa spôsobí, ¾e systém namiesto vydania upozornenia vynuluje poru¹enú stránku a pokraèuje v spracovaní. Toto chovanie znièí v¹etky dáta, menovite v¹etky riadky na danej stránke.

source: Runs the server silently.
sk: Spustí server v tichosti.

source: If this parameter is set, the server will automatically run in the background and any controlling terminals are dissociated.
sk: Ak je tento parameter nastavený, server bude automaticky be¾a» na pozadí a v¹etky riadiace terminály budú odpojené.

source: Logs each successful connection.
sk: Zaznamená ka¾dé úspe¹né pripojenie do logu.

source: Logs end of a session, including duration
sk: Zapí¹e koniec sedenia do logu, vrátane trvania

source: Turns on various assertion checks.
sk: Zapnú» rôzne kontroly asercií.

source: This is a debugging aid.
sk: Toto je pomôcka pre ladenie.

source: no description available
sk: Popis nedostupný

source: Logs the duration each completed SQL statement.
sk: Zaznamená trvanie ka¾dého vykonaného príkazu jazyka SQL do logu.

source: Prints the parse tree to the server log.
sk: Vypí¹e strom syntaktickej analýzy do logu servera.

source: Prints the parse tree after rewriting to server log.
sk: Vypí¹e strom syntaktickej analýzy po prepise do logu servera.

source: Prints the execution plan to server log.
sk: Vypí¹e plán vykonania do logu servera.

source: Indents parse and plan tree displays.
sk: Zarovná zobrazenie stromov syntaktickej analýzy a plánov.

source: Writes parser performance statistics to the server log.
sk: Zapí¹e ¹tatistiky o syntaktickom analyzátore do logu servera.

source: Writes planner performance statistics to the server log.
sk: Zapí¹e ¹tatistiky o plánovaèi do logu servera.

source: Writes executor performance statistics to the server log.
sk: Zapí¹e ¹tatistiky o výkone výkonnej èasti do logu servera.

source: Writes cumulative performance statistics to the server log.
sk: Zapí¹e kumulatívne ¹tatistiky o výkone do logu servera.

source: Uses the indented output format for EXPLAIN VERBOSE.
sk: Pre povel EXPLAIN VERBOSE pou¾íva zarovnaný formát výstupu.

source: Starts the server statistics-collection subprocess.
sk: Spustí podproces servera pre zber ¹tatistických údajov.

source: Zeroes collected statistics on server restart.
sk: Vynuluje zozbierané ¹tatistické údaje pri re¹tarte servera.

source: Collects statistics about executing commands.
sk: Získava ¹tatistické údaje o vykonávaní povelov.

source: Enables the collection of statistics on the currently executing command of each session, along with the time at which that command began execution.
sk: Povolí zber ¹tatistických údajov na aktuálne vykonávanom povele ka¾dého sedenia, vrátane èasu, v ktorom sa vykonávanie povelu zaèalo.

source: Collects row-level statistics on database activity.
sk: Získava ¹tatistické údaje na úrovni riadkov o aktivite databázy.

source: Collects block-level statistics on database activity.
sk: Získava ¹tatistické údaje na úrovni blokov o aktivite databázy.

source: Generates debugging output for LISTEN and NOTIFY.
sk: Generuje ladiace výstupy pre povely LISTEN a NOTIFY.

source: Logs the host name in the connection logs.
sk: Zapí¹e názov poèítaèa do logu spojenia.

source: By default, connection logs only show the IP address of the connecting host. If you want them to show the host name you can turn this on, but depending on your host name resolution setup it might impose a non-negligible performance penalty.
sk: Implicitne vykazujú logy spojenia iba IP adresu poèítaèa, ktorý sa pripája. Ak chcete, aby vypisovali aj meno poèítaèa, mô¾ete to zapnú», av¹ak v závislosti od nastavenia zis»ovania mien poèítaèov to mô¾e spôsobi» nemalé zní¾enie výkonu.

source: Causes subtables to be included by default in various commands.
sk: Spôsobí implicitné vlo¾enie subtabuliek v rôznych poveloch.

source: Interprets ACST, CST, EST, and SAT as Australian time zones.
sk: Interpretuje ACST, CST, EST a SAT ako austrálske èasové zóny.

source: Otherwise they are interpreted as North/South American time zones and Saturday.
sk: Ináè sa tieto pova¾ujú za americké èasové zóny a sobotu.

source: Encrypt passwords.
sk: ©ifrovanie hesiel.

source: When a password is specified in CREATE USER or ALTER USER without writing either ENCRYPTED or UNENCRYPTED, this parameter determines whether the password is to be encrypted.
sk: Ak sa zadá heslo v povele CREATE USER alebo ALTER USER bez zadania klauzuly ENCRYPTED alebo UNENCRYPTED, tento parameter urèuje, èi má by» heslo ¹ifrované.

source: Treats "expr=NULL" as "expr IS NULL".
sk: Pova¾uje "výraz=NULL" za "výraz IS NULL".

source: When turned on, expressions of the form expr = NULL (or NULL = expr) are treated as expr IS NULL, that is, they return true if expr evaluates to the null value, and false otherwise. The correct behavior of expr = NULL is to always return null (unknown).
sk: Ak je táto voµba pou¾itá, výrazy tvaru výraz = NULL (alebo NULL = výraz) sú pova¾ované za výraz IS NULL, t.j. vrátia hodnotu true, ak výraz sa vyhodnotí ako NULL a ináè false. Správne chovanie v prípade výraz = NULL je v¾dy vráti» hodnotu null (neznáma).

source: Enables per-database user names.
sk: Umo¾ní pou¾íva» mená u¾ívateµov obmedzené na jednotlivé databázy.

source: This parameter doesn't do anything.
sk: Tento parameter neslú¾i na niè.

source: It's just here so that we won't choke on SET AUTOCOMMIT TO ON from 7.3-vintage clients.
sk: Je to tu preto, aby sme nezakopli o povel SET AUTOCOMMIT TO ON v prípade klientov vytvorených pre systémy star¹ie ako 7.3

source: Sets the default read-only status of new transactions.
sk: Nastaví implicitný status "iba èítanie" pre nové transakcie.

source: Sets the current transaction's read-only status.
sk: Nastaví implicitný status "iba èítanie" pre aktuálnu transakciu.

source: Automatically adds missing table references to FROM clauses.
sk: Automaticky pridá chýbajúce referencie na tabuµky do klauzuly FROM.

source: Check function bodies during CREATE FUNCTION.
sk: Prekontrolova» telá funkcií poèas operácie CREATE FUNCTION.

source: By default, newly-created tables should have OIDs
sk: Implicitne majú nanovo vytvorené tabuµky pridelené OID

source: Datetimes are integer based
sk: Dátumoèasy sú zalo¾ené na celých èíslach

source: Emit WAL-related debugging output.
sk: Zapí¹ ladiaci výstup súvisiaci s mechanizmom WAL.

source: Sets the default statistics target.
sk: Urèuje implicitný ¹tatistický cieµ.

source: This applies to table columns that have not had a column-specific target set via ALTER TABLE SET STATISTICS.
sk: To platí pre tabuµkové ståpce, ktoré e¹te nemajú urèený cieµ ¹pecifický pre ståpec prostredníctvom povelu ALTER TABLE SET STATISTICS.

source: Sets the FROM-list size beyond which subqueries are not collapsed.
sk: nastaví veµkos» zoznamu klauzuly FROM za ktorým poddotazy nekolabujú.

source: The planner will merge subqueries into upper queries if the resulting FROM list would have no more than this many items.
sk: Plánovaè zlúèi poddotazy do vy¹¹ích dotazov, ak výsledný zoznam FROM bude ma» menej prvkov, ako je táto hodnota.

source: Sets the FROM-list size beyond which JOIN constructs are not flattened.
sk: Nastaví veµkos» zoznamu klauzuly FROM, nad ktorý sa kon¹trukcie JOIN nevyrovnávajú.

source: The planner will flatten explicit inner JOIN constructs into lists of FROM items whenever a list of no more than this many items would result.
sk: Plánovaè vyrovná explicitné kon¹trukcie vnútorných spojení (JOIN) do zoznamov prvkov klauzuly FROM, ak by operácia dávala zoznam o poète prvkov men¹om, ako je táto hodnota.

source: Sets the threshold of FROM items beyond which GEQO is used.
sk: Nastaví prah poètu prvkov v klauzuli FROM, pre ktoré sa u¾ pou¾ije GEQO.

source: GEQO: effort is used to set the default for other GEQO parameters.
sk: GEQO: úsilie sa vynakladá na nastavenie iných parametrov GEQO.

source: GEQO: number of individuals in the population.
sk: GEQO: poèet jedincov populácie.

source: Zero selects a suitable default value.
sk: Nula znamená výber vhodnej implicitnej hodnoty.

source: GEQO: number of iterations of the algorithm.
sk: GEQO: poèet iterácií algoritmu

source: The time in milliseconds to wait on lock before checking for deadlock.
sk: Koµko milisekúnd sa má poèka» pred kontrolou deadlocku.

source: Sets the maximum number of concurrent connections.
sk: Urèuje maximálny poèet súbe¾ných spojení.

source: Sets the number of connection slots reserved for superusers.
sk: Urèuje poèet soketov spojení rezervovaných pre superu¾ívateµov.

source: Sets the number of shared memory buffers used by the server.
sk: Urèuje maximálny poèet buffrov zdieµanej pamäte, ktoré server vyu¾íva.

source: Sets the TCP port the server listens on.
sk: Urèuje TCP port, na ktorom server oèakáva po¾iadavky.

source: Sets the access permissions of the Unix-domain socket.
sk: Urèuje prístupové právomoci soketu unixovej domény.

source: Unix-domain sockets use the usual Unix file system permission set. The parameter value is expected to be an numeric mode specification in the form accepted by the chmod and umask system calls. (To use the customary octal format the number must start with a 0 (zero).)
sk: Sokety unixových domén vyu¾ívajú zau¾ívanú mno¾inu prístupových právomocí súborového systému systémov Unix. Hodnota parametra sa oèakáva ako èíselná ¹pecifikácia v tvare, ktorý prijímajú povely chmod a umask (aby ste mohli pou¾íva» zau¾ívaný formát oktálnych èísel, musíte zaèa» nulou)

source: Sets the maximum memory to be used for query workspaces.
sk: Urèí maximálne mno¾stvo pamäte vyu¾ívané pracovnými priestormi dotazov.

source: This much memory may be used by each internal sort operation and hash table before switching to temporary disk files.
sk: Toµko pamäti sa mô¾e pou¾i» ka¾dou internou operáciou triedenia a hash tabuµkou pred prepnutím sa na doèasné diskové súbory.

source: Sets the maximum memory to be used for maintenance operations.
sk: Nastaví maximálnu spotrebu pamäte pre operácie údr¾by.
