Repository: IITDBGroup/perm
Catalog: src/backend/po/*.po
Languages: sk

source: missing "=" sign
sk: chýbajúci znak "="

source: invalid mode character: must be one of "%s"
sk: neplatný znak re¾imu: musí by» jeden z "%s"

source: a name must follow the "/" sign
sk: za znakom "/" má nasledova» názov

source: defaulting grantor to user ID %u
sk: Implicitné nastavenie poskytovateµa práv na ID u¾ívateµa %u

source: extra garbage at the end of the ACL specification
sk: nadbytoèné znaky na konci ¹pecifikácie ACL

source: grant options cannot be granted back to your own grantor
sk: nastavenia pridelenia právomocí nie je mo¾né prideli» spä» vlastnému poskytovateµovi práv

source: dependent privileges exist
sk: existujú závislé právomoci

source: Use CASCADE to revoke them too.
sk: pou¾ite klauzulu CASCADE, ak aj tieto chcete odstráni».

source: group with ID %u does not exist
sk: Skupina s ID %u neexistuje

source: aclinsert is no longer supported
sk: povel aclinsert u¾ nie je podporovaný

source: aclremove is no longer supported
sk: povel aclremove u¾ nie je podporovaný

source: cannot specify both user and group
sk: nie je mo¾né urèi» u¾ívateµa aj skupinu

source: unrecognized privilege type: "%s"
sk: neznámy typ právomoci: "%s"

source: function "%s" does not exist
sk: funkcia "%s" neexistuje

source: invalid escape string
sk: neplatný únikový re»azec

source: Escape string must be empty or one character.
sk: Únikový re»azec musí by» prázdny alebo obsahova» jeden znak.

source: missing dimension value
sk: chýbajúca hodnota rozmeru

source: missing "]" in array dimensions
sk: chýbajúci znak "]" v rozmeroch poµa

source: upper bound cannot be less than lower bound
sk: horné ohranièenie nesmie by» ni¾¹ie ako dolné ohranièenie

source: array value must start with "{" or dimension information
sk: hodnota poµa musí zaèína» znakom "{" alebo informáciou o rozmeroch

source: missing assignment operator
sk: chýba operátor priradenia

source: array dimensions incompatible with array literal
sk: rozmery poµa sú nekompatibilné s literálom poµa

source: missing left brace
sk: chýba µavá zlo¾ená zátvorka

source: malformed array literal: "%s"
sk: chybný literál poµa: "%s"

source: invalid array flags
sk: neplatné príznaky poµa

source: wrong element type
sk: nesprávny typ prvku

source: no binary input function available for type %s
sk: pre typ %s nie je dostupná ¾iadna funkcia binárneho vstupu

source: improper binary format in array element %d
sk: nesprávny binárny formát v prvku poµa %d

source: no binary output function available for type %s
sk: pre typ %s nie je dostupná ¾iadna funkcia binárneho výstupu

source: slices of fixed-length arrays not implemented
sk: rezy polí s pevnou då¾kou nie sú implementované

source: invalid array subscripts
sk: neplatné indexy poµa

source: updates on slices of fixed-length arrays not implemented
sk: aktualizácie rezov polí s pevnou då¾kou nie sú implementované

source: source array too small
sk: zdrojové pole príli¹ malé

source: null array elements not supported
sk: prvky polí s hodnotou null nie sú podporované

source: cannot compare arrays of different element types
sk: nie je mo¾né porovna» polia s rôznymi typmi prvkov

source: could not identify a comparison function for type %s
sk: nebolo mo¾né nájs» funkciu porovnania pre typ %s

source: could not determine target array type
sk: nebolo mo¾né urèi» typ cieµového poµa

source: target type is not an array
sk: cieµový typ nie je pole

source: array coercion to domain type elements not currently supported
sk: Zmena typu poµa na prvky typu domény nie je momentálne podporovaná

source: encoding conversion from %s to ASCII not supported
sk: konverzia kódovania z %s na ASCII nie je podporovaná

source: invalid input syntax for type boolean: "%s"
sk: neplatná syntax vstupu pre typ boolean: "%s"

source: invalid input syntax for type money: "%s"
sk: neplatná syntax vstupu pre typ money: "%s"

source: division by zero
sk: delenie nulou

source: date/time value "current" is no longer supported
sk: hodnota "current" (teraz) dátumu/èasu u¾ nie je podporovaná

source: timestamp out of range
sk: èasová známka mimo rozsah

source: cannot convert reserved abstime value to date
sk: nie je mo¾né konvertova» rezervovanú hodnotu abstime na dátum

source: invalid input syntax for type date: "%s"
sk: neplatná syntax vstupu pre typ date: "%s"

source: invalid input syntax for type time: "%s"
sk: neplatná syntax vstupu pre typ time: "%s"

source: "time" units "%s" not recognized
sk: neznáme jednotky "%s" typu "time"

source: invalid input syntax for type time with time zone: "%s"
sk: neplatná syntax vstupu pre typ time with time zone: "%s"

source: "time with time zone" units "%s" not recognized
sk: neznáme jednotky "%s" typu "time with time zone"

source: time zone "%s" not recognized
sk: neznáma èasová zóna "%s"

source: "interval" time zone "%s" not valid
sk: neznáma èasová zóna "%s" typu "interval"

source: inconsistent use of year %04d and "BC"
sk: nekonzistentné pou¾itie roku %04d a "BC" (pred na¹im letopoètom)

source: date/time field value out of range: "%s"
sk: hodnota poµa typu date/time mimo rozsah: "%s"

source: Perhaps you need a different "datestyle" setting.
sk: Skúste nastavi» iný ¹týl dátumu ("datestyle").

source: interval field value out of range: "%s"
sk: hodnota poµa typu interval mimo rozsah: "%s"

source: time zone displacement out of range: "%s"
sk: posunutie èasovej zóny mimo rozsah: "%s"

source: invalid input syntax for type %s: "%s"
sk: neplatná syntax vstupu pre typ %s: "%s"

source: invalid Datum pointer
sk: neplatný smerník na datum

source: unrecognized encoding: "%s"
sk: neznáme kódovanie: "%s"

source: invalid hexadecimal digit: "%c"
sk: neplatná hexadecimálna èíslica: "%c"

source: invalid hexadecimal data: odd number of digits
sk: neplatné hexadecimálne údaje: nepárny poèet èíslic

source: unexpected "="
sk: neoèakávané "="

source: invalid symbol
sk: neplatný symbol

source: invalid end sequence
sk: neplatná sekvencia ukonèenia

source: invalid input syntax for type bytea
sk: neplatná syntax vstupu pre typ bytea

source: type "real" value out of range: overflow
sk: typ "real" mimo rozsah: preteèenie

source: type "real" value out of range: underflow
sk: typ "real" mimo rozsah: podteèenie

source: type "double precision" value out of range: overflow
sk: typ "double precision" mimo rozsah: preteèenie

source: type "double precision" value out of range: underflow
sk: typ "double precision" mimo rozsah: podteèenie

source: deprecated input syntax for type real: ""
sk: zastaralá syntax vstupu pre typ real: ""

source: This input will be rejected in a future release of PostgreSQL.
sk: Tento vstup nebude povolený v budúcich vydaniach PostgreSQL.

source: "%s" is out of range for type real
sk: "%s" je mimo rozsah pre typ real

source: invalid input syntax for type real: "%s"
sk: neplatná syntax vstupu pre typ real: "%s"

source: deprecated input syntax for type double precision: ""
sk: zastaralá syntax vstupu pre typ double precision: ""

source: "%s" is out of range for type double precision
sk: "%s" je mimo rozsah pre typ double precision

source: invalid input syntax for type double precision: "%s"
sk: neplatná syntax vstupu pre typ double precision: "%s"

source: integer out of range
sk: hodnota typu integer mimo rozsah

source: cannot take square root of a negative number
sk: nie je mo¾né vypoèíta» druhú odmocninu záporného èísla

source: invalid argument for power function
sk: neplatný argument funkcie umocnenia

source: result is out of range
sk: výsledok je mimo rozsah

source: cannot take logarithm of zero
sk: nie je mo¾né vypoèíta» logaritmus nuly

source: cannot take logarithm of a negative number
sk: nie je mo¾né vypoèíta» logaritmus záporného èísla

source: input is out of range
sk: vstup je mimo rozsah

source: "9" must be ahead of "PR"
sk: "9" musí by» pred "PR"

source: "0" must be ahead of "PR"
sk: "0" musí by» pred "PR"

source: multiple decimal points
sk: viacero desatinných bodiek

source: cannot use "V" and decimal point together
sk: nie je mo¾né pou¾i» "V" a desatinnú bodku spolu

source: not unique "S"
sk: "S" nie je jedineèné

source: cannot use "S" and "PL"/"MI"/"SG"/"PR" together
sk: nie je mo¾né pou¾i» "S" a "PL"/"MI"/"SG"/"PR" spolu

source: cannot use "S" and "MI" together
sk: nie je mo¾né pou¾i» "S" a "MI" spolu

source: cannot use "S" and "PL" together
sk: nie je mo¾né pou¾i» "S" a "PL" spolu

source: cannot use "S" and "SG" together
sk: nie je mo¾né pou¾i» "S" a "SG" spolu

source: cannot use "PR" and "S"/"PL"/"MI"/"SG" together
sk: nie je mo¾né pou¾i» "PR" a "S"/"PL"/"MI"/"SG" spolu

source: "E" is not supported
sk: pou¾itie "E" nie je podporované

source: "%s" is not a number
sk: "%s" nie je èíslo

source: invalid AM/PM string
sk: neplatný re»azec AM/PM

source: "TZ"/"tz" not supported
sk: pou¾itie "TZ"/"tz" nie je podporované

source: invalid value for %s
sk: neplatná hodnota %s

source: AM/PM hour must be between 1 and 12
sk: hodina AM/PM musí by» z intervalu 1 a¾ 12

source: cannot calculate day of year without year information
sk: nie je mo¾né vypoèíta» deò v roku bez znalosti roka

source: "RN" not supported
sk: "RN" nie je podporované

source: too many points requested
sk: po¾aduje sa príli¹ veµa bodov

source: could not format "path" value
sk: nebolo mo¾né naformátova» hodnotu "path"

source: invalid input syntax for type box: "%s"
sk: neplatná syntax vstupu pre typ box: "%s"

source: invalid input syntax for type line: "%s"
sk: neplatná syntax vstupu pre typ line: "%s"

source: type "line" not yet implemented
sk: typ "line" nie je doteraz implementovaný

source: invalid input syntax for type path: "%s"
sk: neplatná syntax vstupu pre typ path: "%s"

source: invalid number of points in external "path" value
sk: nevhodný poèet bodov v externej hodnote "path"

source: invalid input syntax for type point: "%s"
sk: neplatná syntax vstupu pre typ point: "%s"

source: invalid input syntax for type lseg: "%s"
sk: neplatná syntax vstupu pre typ lseg: "%s"

source: function "dist_lb" not implemented
sk: funkcia "dist_lb" nie je implementovaná

source: function "close_lb" not implemented
sk: funkcia "close_lb" nie je implementovaná

source: cannot create bounding box for empty polygon
sk: nie je mo¾né vytvori» ohranièujúci obdå¾nik pre prázdny polygón

source: invalid input syntax for type polygon: "%s"
sk: neplatná syntax vstupu pre typ polygon: "%s"

source: invalid number of points in external "polygon" value
sk: nevhodný poèet bodov v externej hodnote "polygon"

source: function "poly_distance" not implemented
sk: funkcia "poly_distance" nie je implementovaná

source: function "path_center" not implemented
sk: funkcia "path_center" nie je implementovaná

source: open path cannot be converted to polygon
sk: otvorenú cestu (path) nie je mo¾né konvertova» na polygón (polygon)

source: invalid input syntax for type circle: "%s"
sk: neplatná syntax vstupu pre typ circle: "%s"

source: could not format "circle" value
sk: nebolo mo¾né formátova» hodnotu "circle"

source: invalid radius in external "circle" value
sk: neplatný polomer v externej hodnote "circle" (kru¾nica)

source: cannot convert circle with radius zero to polygon
sk: nie je mo¾né konvertova» kru¾nicu s nulovým polomerom na polygón

source: must request at least 2 points
sk: musíte po¾adova» aspoò 2 body

source: cannot convert empty polygon to circle
sk: nie je mo¾né konvertova» prázdny polygón na kruh

source: int2vector has too many elements
sk: int2vector má príli¹ veµa prvkov

source: step size may not equal zero
sk: veµkos» kroku sa nesmie rovna» nule

source: invalid input syntax for type bigint: "%s"
sk: neplatná syntax vstupu pre typ bigint: "%s"

source: OID out of range
sk: OID mimo rozsah

source: invalid multibyte character for locale
sk: neplatný viacbajtový znak v národnom prostredí

source: requested length too large
sk: po¾adovaná då¾ka je príli¹ veµká

source: invalid input syntax for type macaddr: "%s"
sk: neplatná syntax vstupu pre typ macaddr: "%s"

source: invalid octet value in "macaddr" value: "%s"
sk: neplatná hodnota oktetu v hodnote "macaddr": "%s"

source: text too long to convert to MAC address
sk: text je príli¹ dlhý pre konverziu na MAC adresu

source: must be superuser to signal other server processes
sk: pre zaslanie signálu iným procesom servera musíte by» superu¾ívateµom

source: PID %d is not a PostgreSQL server process
sk: PID %d nie je procesom servera PostgreSQL.

source: could not send signal to process %d: %m
sk: nebolo mo¾né odosla» signál procesu %d: %m

source: global tablespace never has databases
sk: globálny tabuµkový priestor nikdy nemá databázy.

source: %u is not a tablespace oid
sk: %u nie je oid tabuµkového priestoru.

source: invalid time zone name: "%s"
sk: neplatný názov èasovej zóny: "%s"

source: cannot convert abstime "invalid" to timestamp
sk: nie je mo¾né konvertova» abstime hodnotu "invalid" na typ timestamp

source: invalid input syntax for type tinterval: "%s"
sk: neplatná syntax vstupu pre typ tinterval: "%s"

source: invalid status in external "tinterval" value
sk: neplatný status v externej hodnote typu "tinterval"

source: cannot convert reltime "invalid" to interval
sk: nie je mo¾né konvertova» reltime hodnotu "invalid" na typ interval

source: invalid cidr value: "%s"
sk: neplatná hodnota typu cidr "%s"

source: Value has bits set to right of mask.
sk: Hodnota má bity, ktoré majú by» nastavené napravo od masky.

source: could not format inet value: %m
sk: nebolo mo¾né formátova» hodnotu typu inet: %m

source: invalid address family in external "inet" value
sk: neplatná rodina adries v externej hodnote typu "inet"

source: invalid bits in external "inet" value
sk: Neplatné bity v externej hodnote typu "inet"

source: invalid type in external "inet" value
sk: Neplatný typ v externej hodnote typu "inet"

source: invalid length in external "inet" value
sk: Neplatná då¾ka v externej hodnote typu "inet"

source: invalid external "cidr" value
sk: neplatná externá hodnota typu "cidr"

source: invalid mask length: %d
sk: neplatná då¾ka masky: %d

source: invalid name syntax
sk: neplatná syntax názvu

source: Must provide "relationname.columnname".
sk: Musíte zada» "názov_relácie.názov_ståpca".

source: invalid length in external "numeric" value
sk: neplatná då¾ka externej hodnoty typu "numeric"

source: invalid sign in external "numeric" value
sk: neplatné znamienko externej hodnoty typu "numeric"

source: invalid digit in external "numeric" value
sk: neplatná èíslica externej hodnoty typu "numeric"

source: count must be greater than zero
sk: poèet musí by» väè¹í ako nula

source: lower bound cannot equal upper bound
sk: dolné ohranièenie nemô¾e by» toto¾né s horným ohranièením

source: cannot convert NaN to integer
sk: nie je mo¾né previes» hodnotu NaN na celé èíslo (integer)

source: invalid input syntax for type numeric: "%s"
sk: neplatná syntax vstupu pre typ numeric: "%s"

source: value overflows numeric format
sk: hodnota spôsobuje preteèenie na formáte èísla numeric

source: numeric field overflow
sk: preteèenie poµa typu numeric

source: The absolute value is greater than or equal to 10^%d for field with precision %d, scale %d.
sk: Absolútna hodnota je väè¹ia alebo rovná ako 10^%d pre prvok s presnos»ou %d, ¹kálou %d.

source: argument for function "exp" too big
sk: argument funkcie "exp" je príli¹ veµký

source: zero raised to zero is undefined
sk: nultá mocnina nuly je nedefinovaná hodnota

source: invalid input syntax for integer: "%s"
sk: neplatná syntax vstupu pre typ integer: "%s"

source: value "%s" is out of range for type integer
sk: hodnota "%s" je mimo rozsah pre hodnoty typu integer

source: value "%s" is out of range for type shortint
sk: hodnota "%s" je mimo rozsah pre hodnoty typu shortint

source: value "%s" is out of range for 8-bit integer
sk: hodnota "%s" je mimo rozsah pre 8-bitové celé èísla

source: deprecated input syntax for type oid: ""
sk: zastaralá syntax vstupu pre typ oid: ""

source: invalid input syntax for type oid: "%s"
sk: neplatná syntax vstupu pre typ oid: "%s"

source: value "%s" is out of range for type oid
sk: hodnota "%s" je mimo rozsah pre hodnoty typu oid

source: oidvector has too many elements
sk: oidvector má príli¹ veµa prvkov

source: insert or update on table "%s" violates foreign key constraint "%s"
sk: vkladanie alebo aktualizácia dát na tabuµke "%s" poru¹uje obmedzenie cudzieho kµúèa "%s"

source: MATCH FULL does not allow mixing of null and nonnull key values.
sk: klauzula MATCH FULL neumo¾òuje mie¹anie null a nie-null hodnôt kµúèov.

source: function "%s" called with wrong number of trigger arguments
sk: funkcia "%s" bola volaná s nesprávnym poètom argumentov triggra

source: no target table given for trigger "%s" on table "%s"
sk: nebola urèená cieµová tabuµka triggra "%s" na tabuµke "%s"

source: Remove this referential integrity trigger and its mates, then do ALTER TABLE ADD CONSTRAINT.
sk: Odstráòte trigger referenènej integrity a jeho spoloèníkov, potom pou¾ite povel ALTER TABLE ADD CONSTRAINT.

source: table "%s" does not have column "%s" referenced by constraint "%s"
sk: tabuµka "%s" nemá ståpec "%s" referencovaný obmedzením "%s"

source: function "%s" was not called by trigger manager
sk: funkcia "%s" nebola volaná správcom triggrov

source: function "%s" must be fired AFTER ROW
sk: funkcia "%s" musí by» odpálená ako AFTER ROW (po riadku)

source: function "%s" must be fired for INSERT
sk: funkcia "%s" musí by» aktivovaná v prípade povelu INSERT

source: function "%s" must be fired for UPDATE
sk: funkcia "%s" musí by» aktivovaná v prípade povelu UPDATE

source: function "%s" must be fired for INSERT or UPDATE
sk: funkcia "%s" musí by» aktivovaná v prípade povelu INSERT alebo UPDATE

source: function "%s" must be fired for DELETE
sk: funkcia "%s" musí by» aktivovaná v prípade povelu DELETE

source: referential integrity query on "%s" from constraint "%s" on "%s" gave unexpected result
sk: dotaz referenènej integrity na "%s" z obmedzenia "%s" na "%s" vrátil neoèakávaný výsledok

source: This is most likely due to a rule having rewritten the query.
sk: To je pravdepodobne preto, lebo pravidlo prepísalo dotaz.

source: No rows were found in "%s".
sk: V "%s" sa nena¹li ¾iadne riadky

source: Key (%s)=(%s) is not present in table "%s".
sk: Kµúè (%s)=(%s) nie je prítomný v tabuµke "%s".

source: update or delete on "%s" violates foreign key constraint "%s" on "%s"
sk: aktualizácia alebo vymazanie dát v "%s" poru¹uje obmedzenie cudzieho kµúèa "%s" na "%s".

source: Key (%s)=(%s) is still referenced from table "%s".
sk: Kµúè (%s)=(%s) je e¹te stále referencovaný z tabuµky "%s".

source: cannot accept a value of type any
sk: nie je mo¾né prija» hodnotu typu any

source: cannot display a value of type any
sk: nie je mo¾né zobrazi» hodnotu typu any

source: cannot accept a value of type anyarray
sk: nie je mo¾né prija» hodnotu typu anyarray

source: cannot accept a value of type trigger
sk: nie je mo¾né prija» hodnotu typu trigger

source: cannot display a value of type trigger
sk: nie je mo¾né zobrazi» hodnotu typu trigger

source: cannot accept a value of type language_handler
sk: nie je mo¾né prija» hodnotu typu language_handler

source: cannot display a value of type language_handler
sk: nie je mo¾né zobrazi» hodnotu typu language_handler

source: cannot accept a value of type internal
sk: nie je mo¾né akceptova» hodnotu typu internal

source: cannot display a value of type internal
sk: nie je mo¾né zobrazi» hodnotu typu internal

source: cannot accept a value of type opaque
sk: nie je mo¾né akceptova» hodnotu typu opaque

source: cannot display a value of type opaque
sk: nie je mo¾né zobrazi» hodnotu typu opaque

source: cannot accept a value of type anyelement
sk: nie je mo¾né akceptova» hodnotu typu anyelement

source: cannot display a value of type anyelement
sk: nie je mo¾né zobrazi» hodnotu typu anyelement

source: invalid regular expression: %s
sk: neplatný regulárny výraz: %s

source: more than one function named "%s"
sk: existuje viacero funkcií s názvom "%s"

source: more than one operator named %s
sk: existuje viac ako jeden operátor s názvom %s

source: too many arguments
sk: príli¹ mnoho argumentov

source: Provide two argument types for operator.
sk: Zadajte dva typy argumentov pre operátor.

source: expected a left parenthesis
sk: oèakáva sa µavá okrúhla zátvorka

source: expected a right parenthesis
sk: oèakáva sa pravá okrúhla zátvorka

source: expected a type name
sk: oèakáva sa názov typu

source: improper type name
sk: nesprávny názov typu

source: rule "%s" has unsupported event type %d
sk: pravidlo "%s" nepodporovaný typ udalosti %d

source: case insensitive matching not supported on type bytea
sk: porovnávanie bez ohµadu na veµkos» písmen nie je podporované na type bytea

source: regular-expression matching not supported on type bytea
sk: porovnávanie pomocou regulárnych výrazov nie je podporované na type bytea

source: invalid input syntax for type tid: "%s"
sk: neplatná syntax vstupu pre typ tid: "%s"

source: timestamp out of range: "%s"
sk: hodnota timestamp mimo rozsah: "%s"

source: date/time value "%s" is no longer supported
sk: hodnota "%s" dátumu/èasu u¾ nie je podporovaná

source: timestamp(%d) precision must be between %d and %d
sk: presnos» typu timestamp(%d) musí by» z intervalu %d a %d

source: interval out of range
sk: interval mimo rozsah

source: interval(%d) precision must be between %d and %d
sk: presnos» hodnoty interval(%d) musí by» v medziach %d a %d

source: cannot subtract infinite timestamps
sk: nie je mo¾né odèíta» nekoneèné èasové známky

source: invalid input syntax for type timestamp: "%s"
sk: neplatná syntax vstupu pre typ timestamp: "%s"

source: invalid input syntax for type timestamp with time zone: "%s"
sk: neplatná syntax vstupu pre typ timestamp with time zone: "%s"

source: invalid input syntax for type interval: "%s"
sk: neplatná syntax vstupu pre typ interval: "%s"

source: timestamp units "%s" not supported
sk: jednotky "%s" typu timestamp nie sú podporované

source: timestamp units "%s" not recognized
sk: neznáme jednotky "%s" typu timestamp

source: timestamp with time zone units "%s" not supported
sk: jednotky "%s" typu timestamp with time zone nie sú podporované

source: timestamp with time zone units "%s" not recognized
sk: neznáme jednotky "%s" typu timestamp with time zone

source: interval units "%s" not supported
sk: jednotky "%s" typu interval nie sú podporované

source: interval units "%s" not recognized
sk: neznáme jednotky "%s" typu interval

source: cannot calculate week number without year information
sk: nie je mo¾né vypoèíta» èíslo tý¾dòa bez znalosti roku

source: interval time zone "%s" must not specify month
sk: èasová zóna typu interval "%s" nesmie obsahova» mesiac

source: bit string length %d does not match type bit(%d)
sk: då¾ka %d bitového re»azca sa nezhoduje s typom bit(%d)

source: "%c" is not a valid binary digit
sk: "%c" nie je platná binárna èíslica

source: "%c" is not a valid hexadecimal digit
sk: "%c" nie je platná hexadecimálna èíslica

source: bit string too long for type bit varying(%d)
sk: bitový re»azec je príli¹ dlhý pre typ bit varying(%d)

source: invalid length in external bit string
sk: neplatná då¾ka externého bitového re»azca

source: cannot AND bit strings of different sizes
sk: nie je mo¾né aplikova» operáciu AND na bitové re»azce rôznych då¾ok

source: cannot OR bit strings of different sizes
sk: nie je mo¾né aplikova» operáciu OR na bitové re»azce rôznych då¾ok

source: cannot XOR bit strings of different sizes
sk: nie je mo¾né aplikova» operáciu XOR na bitové re»azce rôznych då¾ok

source: value too long for type character(%d)
sk: hodnota je príli¹ dlhá pre typ character(%d)

source: value too long for type character varying(%d)
sk: hodnota je príli¹ dlhá pre typ character varying(%d)
